Repository: hyphanet/website
Catalog: locale/*/LC_MESSAGES/freenet_site.po
Languages: es, zh_cn

source: Freenet unstable testing prerelease 1471-pre3 is now available. This is feature-complete and hopefully the last testing release before the stable release of build 1471. Build 1471 will be the last to support Java 6. Highlights: - Fix uploads stalling when using MAXIMUM physical security. - Fix lots of "setNativePriority(X) has failed!", which was caused by a serious thread priority problem. This might fix nodes unexpectedly losing peers. - Order alerts within a category by time: if you have lots of messages from darknet peers they will remain nicely sorted. For more information and how to help test see the [developer mailing list][devl_1471].
es: La pre-versión de prueba inestable 1471-pre3 está ahora disponible. Esta incluye todas las características y esperamos que sea la última versión de prueba antes de la versión estable de la build 1471. La build 1471 será la última en soportar Java 6. Destacados: - Repara el estancamiento en las subidas al usar en nivel MÁXIMO de seguridad física. - Repara muchos de los casos de "¡setNativePriority(X) ha fallado!" - Ordena por tiempo las alertas dentro de una categoría: Si tiene muchos mensajes de pares (peers) de la darknet, quedarán convenientemente ordenados. Para más información y saber cómo ayudar con las pruebas, vea la [lista de correo de desarrolladores][devl_1471].
zh_cn: Freenet 不稳定测试预发布版本 1471-pre3 现在可以下载了。 此版本计划的功能已经完成，希望是 1471 稳定版本前的最后一个测试版本。版本 1471 会是最后一个支持 Java 6 的版本。 亮点： - 修正了在使用最高物理安全级别时上传卡住的问题。 - 修正了大量“setNativePriority(X) has failed!”错误。此错误是由一个严重的线程优先级问题导致的。这也可能修正了异常丢失节点的问题。 - 警告信息现在按分类和时间排序：如果您有很多来自暗网节点的消息，它们会很好的排序。 要了解更多信息并协助测试，请访问[开发者邮件列表][devl_1471]。

source: 2015-12-20 - "Weekend of Code" hackathon results
es: 2015-12-20 - Resultados del hackathon "Weekend of Code" (fin de semana del código)
zh_cn: 2015-12-20 - “周末编码”编程马拉松结果

source: During the hackathon we got some changes done: - [Fix uploads stalling when using MAXIMUM physical security.][1] - [Fix lots of "setNativePriority(X) has failed!"][2] - [Fix Bokmål localization loading.][3] - [Fix JVM version string parsing.][4] - [Fix and add test for broken localization substitution token pairs.][5] - [Remove Gantros Index][6] because it stopped updating. - [Remove Linkageddon][6] because it stopped updating. - [Remove deprecated negtype crypto.][7] - [Order alerts by date.][8] - [Progress toward Freemail "to" field autocomplete.][9] - Progress toward changing the language setting in Winterface. - Progress toward building and verifying dependencies for [Fred][10] and [Winterface][11] using [Gradle][12] and [gradle-witness][13]. If we're able to get final changes ready build 1471-pre3 will be released the weekend of January 2nd.
es: Durante el hackathon logramos hacer algunos cambios: - [Reparar el estancamiento de las subidas al usar el nivel MÁXIMO de seguridad física.][1] - [Reparar muchos de los casos de "¡setNativePriority(X) ha fallado!"][2] - [Reparar la carga de la localización Bokmål.][3] - [Reparar el procesado de la cadena de la versión de la JVM.][4] - [Reparar y añadir una comprobación para los pares de credenciales de sustitución de localización estropeada.][5] - [Eliminar el índice Gantros][6] porque dejó de actualizarse. - [Eliminar Linkageddon][6] porque dejó de actualizarse. - [Eliminar la desaprobada criptografía negtype.][7] - [Ordenar las alertas por fecha.][8] - [Avanzar hacia el autocompletado del campo "para" de Freemail.][9] - Avanzar hacia la configuración de cambio de idioma en Winterface. - Avanzar hacia la constitución y verificación de dependencias para [Fred][10] y [Winterface][11] usando [Gradle][12] y [gradle-witness][13]. Si somos capaces de tener los cambios finales listos, la build 1471-pre3 se publicará el fin de semana del 2 de enero de 2016.
zh_cn: 在马拉松期间我们完成了如下变更： - [使用最大物理安全时上传卡住的问题。][1] - [修正大量“setNativePriority(X) has failed!”错误。][2] - [修正书面挪威语加载问题。][3] - [修正 JVM 版本字符串解析问题。][4] - [修正了本地语言字符串 Token 替换问题并添加了测试。][5] - [已除了 Gantros 书签][6]，因为其已停止更新。 - [已除了 Linkageddon 书签][6]，因为其已停止更新。 - [已除了已过时的 negtype 加密方式。][7] - [根据日期对警告排序。][8] - [Freemail “发件人”输入框自动完成功能。][9] - Winterface 语言设置功能。 - 使用 [Gradle][12] 和 [gradle-witness][13] 编译和验证 [Fred][10] 和 [Winterface][11]。 如果我们无法及时完成变更，1月2日周末，我们会发布 1471-pre3。

source: 2015-12-12 - New OS X installer and tray app
es: 2015-12-12 - Nuevo instalador para OS X y aplicación de bandeja de sistema
zh_cn: 2015-12-12 - 新的 OS X 安装程序和系统托盘 App

source: The [Freenet installer][downloads_url] for OS X is now a native application. It should fix several major installation problems OS X users have encountered in the past. It also includes an updated [tray application][tray_url] with bugfixes and new features. All Freenet users on OS X are encouraged to [download][tray_release_url] the new tray application. ![][tray_screenshot_url]
es: El [instalador de Freenet][downloads_url] para OS X ahora es una aplicación nativa. Debería corregir los principales problemas de instalación que los usuarios de OS X han encontrado en el pasado. Además incluye una [aplicación de bandeja de sistema][tray_url] actualizada con reparaciones de fallos y nuevas características. Se anima a todos los usuarios de Freenet sobre OS X a [descargar][tray_release_url] la nueva aplicación de bandeja de sistema. ![][tray_screenshot_url]
zh_cn: 苹果 OS X 的 [Freenet 安装程序][downloads_url]现在是一个原生应用了。它解决了过去 OS X 用户遇到的数个主要安装问题。 它也包含了一个更新的[系统托盘应用][tray_url]。新的托盘应用修正了 Bug，新增了几个功能。 所有 OS X 的 Freenet 用户建议[下载][tray_release_url]新的托盘应用。 ![][tray_screenshot_url]

source: 2015-12-12 - Appeal for donations
es: 2015-12-12 - Petición de donaciones
zh_cn: 2015-12-12 - 捐款呼吁

source: Freenet is a platform for censorship-resistant communication and publishing. For the past 15 years the project has built tools to fight for freedom of speech and information. Our software provides a decentralized peer-to-peer network designed to hide who publishes or accesses potentially controversial information - or even that it exists - especially useful for those living in oppressive political regimes. While development is primarily driven by volunteers, the project has also employed paid developers to provide more-focused work. Over the past 2 years, the project's paid developer has made [great progress][build18] improving “Web of Trust” functionality to combat spam, which is a central problem in any anonymous system. Unfortunately, the Freenet Project no longer has enough money to retain his services, so he is now a volunteer. This greatly reduces his capacity to continue this important work. We are extremely excited for the future of Freenet and the [projects built on top of it][projects]. There is so much more work to do, and full-time developers greatly benefit the project. Help us keep Internet freedom alive and expand human liberty. {donate_button} Thank you, Freenet Project volunteers
es: Freenet es una plataforma para la comunicación y publicación resistente a la censura. Durante los pasados 15 años el proyecto ha desarrollado herramientas para luchar por la libertad de expresión e información. Nuestro software proporciona una red entre-pares (P2P) descentralizada, diseñada para ocultar quién publica o accede a información potencialmente controvertida - o incluso si existe - algo especialmente útil para aquellos que viven en regímenes políticos opresivos. Aunque el desarrollo es principalmente llevado por voluntarios, el proyecto también ha empleado desarrolladores pagados para proporcionar un trabajo más enfocado. Durante los pasados 2 años, el desarrollador pagado del proyecto ha hecho un [gran progreso][build18] mejorando la funcionalidad "Web of Trust" para combatir el spam, que es un problema central en cualquier sistema anónimo. Desafortunadamente, el proyecto Freenet ya no tiene suficiente dinero para retener sus servicios, así que ahora es un voluntario. Esto reduce enormemente su capacidad de continuar con este importante trabajo. Estamos extremadamente entusiasmados por el futuro de Freenet y los [proyectos construidos sobre él][projects]. Hay mucho más trabajo por hacer, y los desarrolladores a tiempo completo se benefician enormemente del proyecto. Ayúdenos a mantener viva la libertad en Internet y expandir la libertad humana. {donate_button} Gracias, Freenet Project volunteers

source: 2015-11-20 - "Weekend of Code" hackathon announcement
es: 2015-11-20 - Anuncio del hackathon "Weekend of Code" (find de semana del código)
zh_cn: 2015-11-20 - “周末编码”编程马拉松公告

source: ## Who? We welcome developers of all skill levels, designers, translators, and users. ## What? The Freenet Project is holding a "Weekend of Code" hackathon to improve user experience. ## When? The weekend of December 19th and 20th. ## Where? [chat.freenode.net #freenet][irc_url] [FLIP][flip_url] #freenet Local meetups are arranged separately. ## Details See the [wiki Hackathon page][hackathon_url] for details. Happy hacking!
es: ## ¿Quién? Damos la bienvenida a desarrolladores de todos los niveles de destreza, diseñadores traductores, y usuarios. ## ¿Qué? El proyecto Freenet está llevando a cabo un hackathon "Weekend of Code" (fin de semana del código) para mejorar la experiencia de usuario. ## ¿Cuándo? El fin de semana del 19 y 20 de diciembre. ## ¿Dónde? [chat.freenode.net #freenet][irc_url] [FLIP][flip_url] #freenet Los encuentros locales se organizan de forma separada. ## Detalles Vea la [página wiki del Hackathon][hackathon_url] para los detalles. ¡Feliz hackeo!

source: 2015-10-25 - Prerelease and Windows installer
es: 2015-10-35 - Prelanzamiento e Instalador de WIndows
zh_cn: 2015-10-25 - 预发布版本，以及 Windows 安装程序

source: The Windows installer has updated translations for French, Indonesian, and Simplified Chinese, and is newly translated into Bulgarian, Croatian, and Japanese. In addition, Freenet unstable testing prerelease 1471-pre2 is now available. For details on what it contains and how to test it see the [release announcement][announcement].
es: El instalador de Windows ha actualizado las traducciones de francés, indonesio y chino simplificado, y por primera vez está traducido al búlgaro, croata, y japonés. Además, la pre-versión inestable de prueba 1471-pre2 está ahora disponible. Para ver los detalles sobre lo que contiene y cómo probarla vea el [anuncio de su publicación][announcement].
zh_cn: 我们为 Windows 安装程序更新了法语、印尼语和简体中文翻译，并添加了保加利亚语、克罗地亚语和日语翻译。 另外，Freenet 测试版 1471-pre2 已经提供下载。 要了解更多版本更新信息和测试指南，请阅读 [发布公告][announcement]。

source: 2015-10-21 - Website redesign is live
es: 2015-10-21 - Rediseño del sitio web está en vivo
zh_cn: 2015-10-21 - 网站全新改版！

source: The redesigned website is now live! Existing URLs [redirect](http://www.w3.org/Provider/Style/URI.html) to their new equivalents. Thanks to everyone who contributed feedback, development, and translations. If we missed something, please tell us in our [support chat](help.html#irc)!
es: ¡El sitio web rediseñado ya está en línea! Las URLs existentes [redirigen a](http://www.w3.org/Provider/Style/URI.html) sus nuevos equivalentes. Gracias a todos los que contribuyeron con comentarios, desarrollo y traducciones. ¡Si nos hemos dejado algo, por favor, cuéntenoslo en nuestro [chat de soporte](help.html#irc)!
zh_cn: 全新设计的网站已经正式上线啦！ 旧网站中的网址都已[自动重定向](http://www.w3.org/Provider/Style/URI.html) 到新网站中对应的网址。感谢所有提供反馈，参与开发和翻译的朋友们。 如果您有任何意见和建议，请在 [IRC 聊天室](help.html#irc) 与我们取得联系。

source: 2015-10-11 - Upcoming website redesign
es: 2015-10-11 - Proximamente rediseño del sitio web
zh_cn: 2015-10-11 - 重新设计的网站即将上线

source: In the next few weeks we will transition to a redesigned website. This will be the first major change since 2009. In addition to looking more modern, this new version is also more practical to modify, test, and translate. If you'd like to get a look at the site in testing you can find it [here][url_testing] - as given in the prompt the username and password are "guest". If you'd like to help with translation, please join us on the ["website" resource on Transifex][url_transifex]. If you have any feedback on the new website design please let us know on [chat][url_chat] or the [support list][url_supportlist]! [url_testing]: https://testing.freenetproject.org/ [url_transifex]: https://www.transifex.com/otf/freenet/website/ [url_supportlist]: https://emu.freenetproject.org/cgi-bin/mailman/listinfo/support [url_chat]: irc.html
es: En pocas semanas cambiaremos a un sitio web rediseñado. Este será el primer cambio principal desde 2009. Además de tener un aspecto más moderno, esta nueva versión es también más práctica para modificar, probar, y traducir. Si desea echar un vistazo al sitio en pruebas, puede encontrarlo [aquí][url_testing] - tal como se brindan en el cuadro de acceso, el nombre de usuario y la contraseña son "guest" (invitado). Si desea ayudar con la traducción, por favor, únase a nosotros en el [recurso "website" en Transifex][url_transifex]. ¡Si tiene cualquier comentario sobre el diseño del nuevo sitio web, por favor, háganoslo saber en el [chat][url_chat] o la [lista de soporte][url_supportlist]! [url_testing]: https://testing.freenetproject.org/ [url_transifex]: https://www.transifex.com/otf/freenet/website/ [url_supportlist]: https://emu.freenetproject.org/cgi-bin/mailman/listinfo/support [url_chat]: irc.html

source: 2015-09-17 - elliptic curves: using safe Bouncy Castle since November 2014
es: 2015-09-17 - curvas elípticas: usando la libreria de seguridad Bouncy Castle desde november de 2014
zh_cn: 2015-09-17 - 椭圆曲线：使用2014年10月后发布的 Bouncy Castle 安全版本

source: <p> A recent article outlines <a href="http://web-in-security.blogspot.ca/2015/09/practical-invalid-curve-attacks.html"> practical attacks against elliptic curves</a> to recover private keys which worked against the Bouncy Castle crypto provider used by Freenet until <a href="#build01466">Build 1466</a> (released 2014-11-09) and against Java JCE <a href="http://www.oracle.com/technetwork/topics/security/cpujul2015-2367936.html"> until July 2015</a>. If you use the current stable <a href="#20150816-1470-release">build 1470</a> on an updated Java, your node is not vulnerable to these attacks. </p> <p> On darknet the attacks required knowing both node references, so in darknet mode Freenet was only vulnerable to them if two friends connected to the same malicious third party or shared their node references in public. On opennet the target of these attacks would have been the seednodes because other opennet connections are neither persistent nor trusted. </p>
es: <p> Un artículo reciente perfila <a href="http://web-in-security.blogspot.ca/2015/09/practical-invalid-curve-attacks.html">ataques prácticos contra curvas elípticas</a> para recuperar claves privadas que funcionaron contra el proveedor de criptografía Bouncy Castle usada por Freenet hasta la <a href="#build01466">bulid 1466</a> (publicada el 2014-11-09) y contra Java JCE usado <a href="http://www.oracle.com/technetwork/topics/security/cpujul2015-2367936.html">hasta julio de 2015</a>. Si usa la <a href="#20150816-1470-release">build 1470</a> estable actual en un Java actualizado, su nodo no será vulnerable a estos ataques. </p> <p> En la darknet los ataques requerían conocer las referencias de ambos nodos, así que en modo darknet Freenet sólo era vulnerable a ellos si dos amigos estaban conectados al mismo tercero malicioso o compartían las referencias de sus nodos en público. En la opennet el objetivo de estos ataques habrían sido los nodos semilla (seednodes) porque otras conexiones de la opennet no son persistentes ni confiables. </p>

source: 2015-08-16 - Freenet 0.7.5 build 1470 released
es: 2015-08-16 - Freenet 0.7.5 build 1470 publicada
zh_cn: 2015-08-16 - Freenet 0.7.5 build 1470 发布

source: <p> This release fixes Freemail problems that prevented sending mail, and removes a compromised opennet seed node. Freemail also gains a new message link on the inbox page, links to senders' WoT profiles, and new translations: </p> <ul> <li>Czech</li> <li>Greek</li> <li>Spanish</li> <li>Finnish</li> <li>Hungarian</li> <li>Dutch</li> <li>Polish</li> <li>Portuguese (Portugal)</li> <li>Serbian</li> <li>Turkish</li> </ul> <p> To clarify, the CHK metadata bug fixes in 1468 are added as a new compatibility mode that is not yet the default. Compatibility with 1416 keys is available. </p> <p> The Fred Spanish translation has comprehensive updates as well. </p>
es: <p> Esta versión corrige problemas de Freemail que impedían enviar correo, y elimina de la opennet un nodo semilla que había sido comprometido. Freemail además gana un enlace de nuevo mensaje en la página de la bandeja de entrada, enlaces a perfiles WoT de los remitentes, y nuevas traducciones: </p> <ul> <li>Checo</li> <li>Griego</li> <li>Español</li> <li>Finlandés</li> <li>Húngaro</li> <li>Holandés</li> <li>Polaco</li> <li>Portugués (Portugal)</li> <li>Serbio</li> <li>Turco</li> </ul> <p> Para dejarlo claro, las correcciones de fallos de metadatos CHK en la 1468 se añadieron como un nuevo modo de compatibilidad que aún no es el predeterminado. La compatibilidad con las claves de la 1416 está disponible. </p> <p> Además, la traducción de Fred al español tiene una actualización integral. </p>

source: 2015-08-07 - Windows translation update
es: 2015-08-07 - Actualización de la traducción para Windows
zh_cn: 2015-08-07 - Windows 翻译更新

source: <p> The Windows installer and tray app have updated translations. The installer is newly translated into Portuguese (Portugal) and Serbian. The tray app is newly translated into Spanish, Persian, Portuguese (Portugal), and Serbian. This also fixes a tray app problem where translations for Brazilian Portuguese and Simplified Chinese were not used. </p>
es: <p> El instalador de Windows y la aplicación de bandeja de sistema han actualizado sus traducciones. El instalador está recientemente traducido al portugués (Portugal) y al serbio. La aplicación de bandeja de sistema está recientemente traducida al español, persa, portugués (Portugal) y serbio. Esto también corrige un problema de la aplicación de bandeja de sistema donde las traducciones al portugués (Brasil) y al chino simplificado no se usaban. </p>

source: 2015-07-19 - Freenet 0.7.5 build 1469 released
es: 2015-07-19 - Freenet 0.7.5 build 1469 publicada
zh_cn: 2015-07-19 - Freenet 0.7.5 build 1469 发布

source: <p> This release fixes two bugs introduced in build 1468. One caused very slow operation and high CPU usage with large files and physical security levels above None (i.e. Freenet-level disk encryption). The other prevented interactive usage (e.g. freesite browsing) while finishing large downloads or starting large uploads. </p>
es: <p> Esta versión corrige dos fallos introducidos en la build 1468. Una causaba una operación muy lenta y un alto uso de CPU con ficheros grandes y niveles de seguridad por encima de 'Ninguno' (es decir, cifrado de disco a nivel-Freenet). El otro evitaba el uso interactivo de Freenet (ej. navegación por freesites) mientras se finalizaban descargas grandes o se iniciaban grandes subidas. </p>

source: 2015-07-13 - Build 1468 known issues
es: 2015-07-13 - Problemas conocidos de la build 1468
zh_cn: 2015-07-13 - Build 1468 已知问题

source: <p> Despite being in some form of prerelease for over 6 months, and two weeks of being available as a release candidate, we didn't catch some bugs in time. There are two main issues: </p> <ol> <li> Because the reimplementation of the client layer without db4o did not include prioritization of FEC decoding / encoding, large bulk download or upload queues can starve the realtime queues, making them unresponsive. (See <a href="https://github.com/freenet/fred/pull/381">PR #381</a>.) </li> <li> Due to our misunderstanding of when the cryptography library we use - Bouncy Castle - included which fixes, we did not realize that version 1.51, used by build 1468, has severe performance problems with the way we use it to implement disk encryption. Build 1469 will upgrade to Bouncy Castle 1.52, which fixes this problem. It is only an issue when the physical security level is set to "Low" or higher. It does not happen when physical security is set to "None." (See <a href="https://github.com/freenet/fred/pull/382">PR #382</a>.) </li> </ol> <p> Sadly, these problems can combine to make a node use 100% CPU to slowly process bulk queues while the realtime queue does not respond. Matthew (toad_) has already released a snapshot to fix these problems, which you can find <a href="https://emu.freenetproject.org/pipermail/devl/2015-July/038123.html">on the mailing list</a> or <a href="http://localhost:8080/forumviewthread.htm?messageuuid=E544C7BB-5E5E-4159-83F8-AFC46C089329@h2RzPS4fEzP0zU43GAfEgxqK2Y55kEUNR01cWvYApI#E544C7BB-5E5E-4159-83F8-AFC46C089329@h2RzPS4fEzP0zU43GAfEgxqK2Y55kEUNR01cWvYApI">on FMS</a>. </p>
es: <p> A pesar de estar en alguna forma de pre-versión durante más de 6 meses, y dos semanas de estar disponible como candidata a versión, no identificamos algunos fallos a tiempo. Hay dos problemas principales: </p> <ol> <li> A causa de la reimplementación de la capa de cliente sin db4o, no se incluyó la priorización de la decodificación / codificación FEC (corrección de errores hacia adelante), las grandes colas de descargas o subidas masivas pueden privar de ancho de banda a las colas en tiempo real, dejándolas arreactivas. (Vea <a href="https://github.com/freenet/fred/pull/381">PR #381</a>.) </li> <li> Debido a nuestra equivocación acerca de cuándo se incluyeron qué correcciones en la librería de criptografía que usamos - Bouncy Castle -, no nos dimos cuenta de que la versión 1.51, usada por la build 1468 de Freenet, tiene graves fallos de rendimiento en la forma en que la usamos para implementar el cifrado de disco. La build 1469 se actualizará a Bouncy Castle 1.52, que arregla este problema. Sólo es un problema cuando el nivel de seguridad física está establecido a "Bajo" o superior a este. No sucede cuando el nivel de seguridad física está establecido a "Ninguno". (Vea <a href="https://github.com/freenet/fred/pull/382">PR #382</a>.) </li> </ol> <p> Tristemente, estos problemas se pueden combinar para hacer que un nodo use el 100% de la CPU para procesar lentamente las colas masivas mientras la cola en tiempo real no responde. Matthew (toad_) ya ha publicado una instantánea para reparar estos problemas, que puede encontrar <a href="https://emu.freenetproject.org/pipermail/devl/2015-July/038123.html">en la lista de correo</a> o <a href="http://localhost:8080/forumviewthread.htm?messageuuid=E544C7BB-5E5E-4159-83F8-AFC46C089329@h2RzPS4fEzP0zU43GAfEgxqK2Y55kEUNR01cWvYApI#E544C7BB-5E5E-4159-83F8-AFC46C089329@h2RzPS4fEzP0zU43GAfEgxqK2Y55kEUNR01cWvYApI">en FMS</a>. </p>

source: 2015-07-11 - Freenet 0.7.5 build 1468 released
es: 2015-07-11 - Freenet 0.7.5 build 1468 publicada
zh_cn: 2015-07-11 - Freenet 0.7.5 build 1468 发布
