Repository: hyphanet/website
Catalog: locale/*/LC_MESSAGES/freenet_site.po
Languages: es, zh_cn

source: <p> The Freenet team is very happy to announce the stable release of Freenet 0.7.5 build 1468. </p> <p> <b>Important notes</b>: downgrading from build 1468 is not supported; if you want to go back to build 1467 without losing the upload and download queues, <b>before</b> upgrading, back-up the following files and directories: master.keys, persistent-temp-*/, and node.db4o (see https://wiki.freenetproject.org/Program_files ). Please note that running transfers will be restarted from scratch too. A reminder to those testing auto-update to 1468-pre4: please restore your auto-update key to the default. One way to do this is to stop Freenet, remove the "node.updater.URI" line from freenet.ini, and start Freenet again. </p> <p> In this release, the way Freenet stores data locally has changed drastically by no longer using the now-deprecated db4o object storage. It is replaced with the product of toad's summer of work - a custom on-disk format that is much more robust against corruption and more efficient. </p> <ul> <li>Existing unfinished downloads and uploads will be imported to a new format, which requires restarting them from the beginning.</li> <li>Space for downloads is now all allocated at the start, so machines very low on disk space may run out, which causes downloads to temporarily fail until more space is available.</li> <li>CHKs will change due to metadata bugfixes.</li> <li>Some unofficial plugins will need to be updated because of API changes. Sone already works, as do all official plugins.</li> <li>The queue format changes should make it extremely rare to lose the entire queue: the impact of corruption will almost always be localized.</li> <li>Multi-container / site uploads can now be persistent, making it more practical to upload large sites.</li> <li>Passworded physical security is now much stronger. (Full-disk encryption is still preferable.)</li> </ul> <ul> <li>The Windows installer now defaults to starting Freenet on login.</li> <li>There is a <a href="https://github.com/freenet/wintray">new Windows tray app</a> with some useful features that is included with new installations. If you are using the existing Windows tray app you can download the new one <a href="https://downloads.freenetproject.org/alpha/installer/FreenetTray.exe.build01468">here</a>. No need to put it in a specific directory - it will try the default installation location and prompt if it can't find it.</li> </ul> <ul> <li>The list of download keys moved from downloads/listFetchKeys.txt to downloads/listKeys.txt.</li> <li>A list of upload keys is now available at uploads/listKeys.txt</li> </ul> <ul> <li>Gantros' index is now in the default bookmarks. It uses the same software as Enzo's index, which is no longer updated.</li> </ul> <ul> <li>The obsolete and deprecated XMLLibrary and XMLSpider plugins are no longer officially supported. They will still load for those who have them added, but are no longer shown on the plugin page.</li> <li>In the interests of releasing this build more quickly, the new version of FlogHelper does not support exporting and importing backups from the web UI. The old backup code did not work with the new Freenet version after removing db4o. People can instead back up "plugins.floghelper.FlogHelper" files in the plugin-data directory. These can be dropped into the directory after unloading FlogHelper to restore a backup.</li> <li>ThawIndexBrowser works again. Thanks saces!</li> </ul> <ul> <li>Fred translations are updated.</li> </ul> <ul> <li>Add two seed nodes, one sponsored by meshnet.pl - the Polish radio/meshnet darknet users group, and another run by ArneBab. Thanks!</li> <li>Update existing seed node references.</li> </ul> <p> Thank you for using Freenet! </p>
es: <p> El equipo de Freenet está muy contento de anunciar la versión estable de Freenet 0.7.5. build 1468. </p> <p> <b>Notas importantes</b>: Desactualizar desde la build 1468 no está soportado. Si quiere volver a la build 1467 sin perder las colas de subida y bajada, <b>antes</b> de actualizar, realice una copia de seguridad de los siguientes ficheros y directorios: master,keys, persistent-temp-*/, y node.db4o (vea https://wiki.freenetproject.org/Program_files ). Por favor, observe que las transferencias en marcha también se reiniciarán desde cero. Un recordatorio para aquellos que estén probando la auto-actualización a la 1468-pre4: Por favor, restaure su clave de auto-actualización a la predeterminada. Una forma de hacer esto es detener Freenet, eliminar la línea "node.updater.URI" de freenet.ini, y reiniciar Freenet de nuevo. </p> <p> En esta versión, la forma en que Freenet almacena sus datos localmente ha cambiado drásticamente al dejar de usar el ahora-desaprobado almacenamiento de objetos db4o. Es reemplazado con el producto del verano de trabajo de toad (desarrollador) - un formato en-disco personalizado que es mucho más robusto contra la corrupción de datos, y más eficiente. </p> <ul> <li>Las descargas y subidas no finalizadas existentes se importarán al nuevo formato, lo que requiere reiniciarlas desde el principio.</li> <li>El espacio para descargas ahora se asigna todo al inicio, así que las máquinas con muy poco espacio de disco pueden agotarlo, lo que provoca que las descargas fallen temporalmente hasta que haya más espacio disponible.</li> <li>Las CHKs (claves hash de contenidos) cambiarán debido a las reparaciones de los fallos en los metadatos.</li> <li>Algunos complementos no oficiales necesitarán actualizarse a causa de los cambios en la API. Sone ya funciona, tal como lo hacen todos los complementos oficiales.</li> <li>Los cambios del formato de cola deben hacer que sea extremadamente raro perder toda la cola: El impacto de la corrupción de datos casi siempre estará localizado.</li> <li>Las subidas multi-contenedor / sitio ahora pueden ser persistentes, haciéndolas más prácticas para subir grandes sitios.</li> <li>La seguridad física protegida por contraseña es ahora mucho más robusta (el cifrado de disco completo todavía es preferible).</li> </ul> <ul> <li>El instalador de Windows ahora establece por defecto iniciar Freenet al iniciar sesión del sistema.</li> <li>Hay una <a href="https://github.com/freenet/wintray">nueva aplicación de bandeja de sistema Windows</a> con algunas características útiles que se incluyen con las nuevas instalaciones. Si está usando la aplicación de bandeja de sistema Windows existente, puede descargar la nueva <a href="https://downloads.freenetproject.org/alpha/installer/FreenetTray.exe.build01468">aquí</a>. No necesita situarla en ningún directorio específico - probará con la ubicación de instalación predeterminada, y se la pedirá si no puede encontrarla.</li> </ul> <ul> <li>La lista de claves de descarga se movió de downloads/listFetchKeys.txt a downloads/listKeys.txt.</li> <li>Una lista de claves de subida está ahora disponible en uploads/listKeys.txt.</li> </ul> <ul> <li>El índice de Gantros está ahora en los marcadores predeterminados. Usa el mismo software que el índice de Enzo que ya no se actualiza.</li> </ul> <ul> <li>Los obsoletos y desaprobados complementos XMLLibrary y XMLSpider ya no están soportados oficialmente. Todavía cargan para aquellos que los han añadido, pero ya no se muestran en la página de complementos.</li> <li>En interés de publicar esta versión (build) con mayor rapidez, la nueva versión de FlogHelper no soporta exportar e importar copias de seguridad desde la interfaz de usuario web. El código de copia de seguridad antiguo no funciona con la nueva versión de Freenet después de eliminar db4o. En su lugar la gente puede realizar una copia de seguridad de los ficheros "plugins.floghelper.FlogHelper" en el directorio plugin-data (datos de complementos). Estas pueden ser depositarse en el directorio tras rescindir la carga de FlogHelper, para restaurar una copia de seguridad.</li> <li>ThawIndexBrowser funciona de nuevo. ¡Gracias saces!</li> </ul> <ul> <li>Las traducciones de Fred se han actualizado.</li> </ul> <ul> <li>Añade dos nodos semilla, uno patrocinado por meshnet.pl - el grupo de usuarios polaco de darknet por radio/meshnet (red de malla), y otro ejecutado por ArneBab. ¡Gracias!</li> <li>Actualiza las referencias existentes de nodos semilla.</li> </ul> <p> ¡Gracias por usar Freenet! </p>

source: 2015-06-27 - New Windows installer and tray app
es: 2015-06-27 - Nuevo instalador de Windows y aplicación de bandeja de sistema
zh_cn: 2015-06-27 - 新的 Windows 安装程序和托盘程序

source: <p> The Windows installer is updated with Java 8u45, a <a href="https://github.com/freenet/wintray#freenet-tray-application">new tray application</a>, and is newly translated into: </p> <ul> <li>Czech</li> <li>German</li> <li>Greek</li> <li>Indonesian</li> <li>Italian</li> <li>Polish</li> <li>Brazilian Portuguese</li> <li>Simplified Chinese</li> </ul>
es: <p> El instalador de Windows está actualizado con Java 8u45, una <a href="https://github.com/freenet/wintray#freenet-tray-application">nueva aplicación de bandeja de sistema</a>, y está recientemente traducido al: </p> <ul> <li>Checo</li> <li>Alemán</li> <li>Griego</li> <li>Indonesio</li> <li>Italiano</li> <li>Polaco</li> <li>Portugués de Brasil</li> <li>Chino simplificado</li> </ul>

source: 2015-06-24 - Upcoming installer and testing releases
es: 2015-06-24 - Instalador venidero y versiones de prueba
zh_cn: 2015-06-24 - 安装程序和测试发布即将到来

source: <p> This weekend we will release an updated Windows installer for build 1467 along with a <a href="https://github.com/freenet/wintray/blob/master/README.md">new Windows tray application</a>. We will also release 1468-pre4, which if all goes according to plan will be the last prerelease before a stable release two weeks later. </p> <p> If you'd like to help with translations before then please do so! The Windows-related resources are: </p> <ul> <li><a href="https://www.transifex.com/projects/p/freenet/resource/windows-installer/">Windows installer</a></li> <li><a href="https://www.transifex.com/projects/p/freenet/resource/windows-tray-commands/">Windows tray commands</a></li> <li><a href="https://www.transifex.com/projects/p/freenet/resource/windows-tray-common/">Windows tray common</a></li> <li><a href="https://www.transifex.com/projects/p/freenet/resource/windows-tray-crash/">Windows tray crash</a></li> <li><a href="https://www.transifex.com/projects/p/freenet/resource/windows-tray-preferences/">Windows tray preferences</a></li> </ul> <p> Some of the Windows tray resources contain many strings tagged notranslate; to hide these search for Tags: translate. </p>
es: <p> Este fin de semana publicaremos un instalador de Windows actualizado para la build 1467 junto con una <a href="https://github.com/freenet/wintray/blob/master/README.md">nueva aplicación de bandeja de sistema</a>. También publicaremos la versión 1468-pre4, que, si todo va de acuerdo con el plan, será la última pre-versión antes de una versión estable dos semanas más tarde. </p> <p> ¡Si desea ayudar con las traducciones previamente, entonces por favor hágalo así! Los recursos relacionados con Windows son: </p> <ul> <li><a href="https://www.transifex.com/projects/p/freenet/resource/windows-installer/">El instalador de Windows</a></li> <li><a href="https://www.transifex.com/projects/p/freenet/resource/windows-tray-commands/">Comandos de la bandeja de sistema Windows</a></li> <li><a href="https://www.transifex.com/projects/p/freenet/resource/windows-tray-common/">Cuestiones comunes de la bandeja de sistema Windows</a></li> <li><a href="https://www.transifex.com/projects/p/freenet/resource/windows-tray-crash/">Caídas de la bandeja de sistema Windows</a></li> <li><a href="https://www.transifex.com/projects/p/freenet/resource/windows-tray-preferences/">Preferencias de la bandeja de sistema Windows</a></li> </ul> <p> Algunos de los recursos de la bandeja de sistema Windows contienen muchas cadenas de texto etiquetadas como 'notranslate' (no traducir); para ocultar estas busque por Etiquetas: 'translate'. </p>

source: 2015-05-22 - UN Report: Encryption and Anonymity Deserve Strong Protection
es: 2015-05-22 - Informe de la ONU: El cifrado y el anonimato merecen una protección más fuerte
zh_cn: 2015-05-22 - 联合国报告：加密和匿名应得到保护

source: The UN Special Rapporteur published [a report on encryption, anonymity, and the human rights framework](http://www.ohchr.org/EN/Issues/FreedomOpinion/Pages/CallForSubmission.aspx) ([doc](http://www.ohchr.org/EN/HRBodies/HRC/RegularSessions/Session29/Documents/A.HRC.29.32_AEV.doc), [companion pdf](http://www.ohchr.org/Documents/Issues/Opinion/Communications/States/Selected_References_SR_Report.pdf)). From the summary: > encryption and anonymity enable individuals to exercise their rights to freedom of opinion and expression in the digital age. The reports concludes that > 63\. The use of encryption and anonymity tools and better digital literacy should be encouraged. The Special Rapporteur, recognizing that the value of encryption and anonymity tools depends on their widespread adoption, encourages States, civil society organizations and corporations to engage in a campaign to bring encryption by design and default to users around the world and, where necessary, to ensure that users at risk be provided the tools to exercise their right to freedom of opinion and expression securely. We with the Freenet Project welcome the official recognition of our mission as important part of securing human rights in the digital age and we invite everyone - especially reporters and civil society organizations - to install Freenet and its communication tools to provide a point of contact for users at risk.
es: El Relator Especial de la ONU publicó [un informe sobre cifrado, anonimato, y el marco de los derechos humanos](http://www.ohchr.org/EN/Issues/FreedomOpinion/Pages/CallForSubmission.aspx) ([doc](http://www.ohchr.org/EN/HRBodies/HRC/RegularSessions/Session29/Documents/A.HRC.29.32_AEV.doc), [pdf acompañante](http://www.ohchr.org/Documents/Issues/Opinion/Communications/States/Selected_References_SR_Report.pdf)). Del resumen: > el cifrado y el anonimato habilitan a los individuos a ejercitar sus derechos de libertad de opinión y expresión en la era digital. El informe concluye que > 63\. Debe alentarse el uso de herramientas de cifrado y anonimato, y una mejor alfabetización digital. El Relator Especial, reconociendo que el valor de las herramientas de cifrado y anonimato depende de su adopción amplia, anima a los Estados, las organizaciones de la sociedad civil y las empresas, a involucrarse en una campaña para llevar el cifrado por diseño y de forma predeterminada a los usuarios de todo el mundo, y donde sea necesario, asegurar que los usuarios en riesgo acceden a las herramientas para ejercitar sus derechos a la libertad de opinión y expresión de forma segura. Nosotros con el Freenet Project damos la bienvenida al reconocimiento oficial de nuestra misión como una parte importante del afianzamiento de los derechos humanos en la era digital, e invitamos a todos - especialmente a los reporteros y las organizaciones de la sociedad civil - a instalar Freenet y sus herramientas de comunicación, para proporcionar un punto de contacto para los usuarios en riesgo.

source: 2015-04-14 - SUMA Award Acceptance Speech (video)
es: 2015-04-14 - Discurso de aceptación de Premio SUMA (vídeo)
zh_cn: 2015-04-14 - SUMA 获奖感言（视频）

source: The video from the talk given when Freenet [received the SUMA Award 2015](#20150211) for being the best project against surveillance and espionage on the Internet is available on [the Award page][url_award] and [on YouTube][url_youtube]: {embed_youtube} The Freenet Project receives the SUMA award and Arne Babenhauserheide accepts the prize as representative of the project. Arne then presents the current capabilities of Freenet to regain confidential and pseudonymous speech on the Internet, along with a vision of how whistleblowers could use Freenet to contact journalists without spilling their identity.
es: El vídeo de la charla ofrecida cuando Freenet [recibió el premio SUMA 2015](#20150211) por ser el mejor proyecto contra la vigilancia y el espionaje en Internet, está disponible en [la página del Premio][url_award] y [en YouTube][url_youtube]: {embed_youtube} El Freenet Project recibe el premio SUMA y Arne Babenhauserheide acepta el premio como representante del proyecto. Arne presenta entonces las capacidades actuales de Freenet para recobrar el discurso confidencial y pseudónimo en Internet, junto con una visión de cómo los informantes podrían usar Freenet para contactar con periodistas sin dejar escapar su identidad.

source: 2015-03-29 - New Linux/Unix/OS X installer
es: 2015-03-29 - Nuevo instalador para Linux/Unix/OS X
zh_cn: 2015-03-29 - 新的 Linux/Unix/OS X 安装程序

source: The installer for Linux, Unix, and Mac OS X is updated to better detect Java.
es: El instalador para Linux, Unix, y Mac OS X está actualizado para detectar mejor Java.
zh_cn: 面向 Linux、Unix 和 Mac OS X 的安装程序已经更新，可以更好的检测 Java。

source: 2015-03-15 - Progress toward build 1468
es: 2015-03-15 - Progreso hacia la build 1468
zh_cn: 2015-03-15 - 走向 build 1468

source: Build 1468 continues to make progress toward release. What is done: * Replace the unreliable db4o database. (Yay!) * Create more flexible Windows tray app. * Update Windows installer translations for Finnish and French. * Add Windows installer translations for Czech, German, Italian, Polish, Brazilian Portuguese, and Simplified Chinese. * Improve the reliability of starting Freenet under changing Java installations on Linux/OS X/POSIX. * Update WebOfTrust with bug fixes and a new API. What remains to be done: * <del>Finish reviewing the synchronous plugin communication API. Review is split between [GitHub](https://github.com/freenet/fred/pull/319) and more recently the [development mailing list](https://emu.freenetproject.org/pipermail/devl/2015-February/037986.html).</del> -- Done 2015-03-28 * Update all plugins (KeyUtils and WebOfTrust are already ready) for the API breakage in this version. * Add a .NET 3.5 install to the Windows installer, along with the new tray app. (This is necessary for it to always work for those not on Windows 7.) * Everything on [this list](https://bugs.freenetproject.org/roadmap_page.php?version_id=85). Because this is such a large release new installers for build 1467 will be released shortly to test those changes. Once everything on this list is complete, there will be a release candidate, then finally the stable release.
es: La build 1468 continúa haciendo progresos hacía la versión. Qué se ha hecho: * Reemplazar la base de datos no fiable db4o. (¡Bien!) * Crear una aplicación de bandeja de sistema Windows más flexible. * Actualizar las traducciones del instalador de Windows para finlandés y francés. * Añadir al instalador de Windows las traducciones para checo, alemán, italiano, polaco, portugués de Brasil, y chino simplificado. * Mejorar la fiabilidad de Freenet al iniciarse bajo instalaciones de Java cambiantes en Linux/OS X/POSIX. * Actualizar WebOfTrust con reparaciones de fallos y una nueva API. Lo que falta por hacer: * <del>Finalizar la revisión de la API de comunicación de complementos asíncronos. La revisión está dividida entre [GitHub](https://github.com/freenet/fred/pull/319) y más recientemente la [lista de correo de desarrollo](https://emu.freenetproject.org/pipermail/devl/2015-February/037986.html).</del> -- Completado el 2015-03-28 * Actualizar todos los complementos (KeyUtils y WebOfTrust ya están listos) para la ruptura de la API en esta versión. * Añadir una instalación de .NET 3.5 al instalador de Windows, junto con la nueva aplicación de bandeja de sistema (esto es necesario para que siempre funcione para aquellos que no están sobre Windows 7). * Todo sobre [esta lista](https://bugs.freenetproject.org/roadmap_page.php?version_id=85). A causa de que esta es una versión tan grande, los nuevos instaladores para la build 1467 se publicarán en breve para probar esos cambios. Una vez que todo lo de esta lista esté completo, habrá una candidata de versión, y luego finalmente la versión estable.

source: 2015-03-14 - Freenet translation joins Localization Lab
es: 2015-03-14 - La traducción de Freenet se une al Localization Lab
zh_cn: 2015-03-14 - Freenet 翻译加入 Localization Lab

source: The Freenet Project has joined the [Localization Lab](http://www.localizationlab.org) organization on Transifex. This allows a larger team of translators, translating into more languages, and access to paid support. If this transition has caused any problems please let us know!
es: El Freenet Project se ha unido a la 'organización' [Localization Lab](http://www.localizationlab.org) en Transifex. Esto permite un mayor equipo de traductores, traducciones a un mayor número de idiomas, y la posibilidad para los traductores de acceder a apoyo económico. Si esta transición ha causado cualquier problema, por favor, ¡háganoslo saber!

source: 2015-02-15 - New Windows tray app for testing
es: 2015-02-15 - Nueva aplicación de bandeja de sistema Windows para pruebas
zh_cn: 2015-02-15 - 新的 Windows 托盘应用面向测试

source: The Windows tray application distributed as of build 1467 is written in the automation scripting language AutoHotKey. It has not been well-maintained and is also often falsely detected by antivirus by virtue of the language it uses. We are pleased to announce a new Windows tray application written in C# which has some additional features: * Allow choosing which browser to launch. * Allow starting Freenet without the tray on startup. * Allow opening the Downloads folder from the menu. * Give a more actionable response to crashes. * Can be hidden while keeping Freenet running. * Can be located other places than in the Freenet installation folder. If all goes well we plan for this tray app to be distributed with build 1468. Testing is appreciated! If you'd like to try it for yourself you can find it [here](https://downloads.freenetproject.org/FreenetTray-testing-eaf31ea.exe). Please let us know how it goes and if you'd like to see any changes.
es: La aplicación de bandeja de sistema Windows distribuida desde la build 1467 está escrita en el lenguaje de scripting de automatización AutoHotKey. No ha estado bien mantenida, y además a menudo es falsamente detectada por antivirus en virtud del lenguaje que usa. Nos complace anunciar una nueva aplicación de bandeja de sistema Windows escrita en C# que tiene algunas características adicionales: * Permite elegir qué navegador iniciar. * Permite iniciar Freenet sin la bandeja de sistema durante el arranque. * Permite la apertura de la carpeta de descargas desde el menú. * Proporciona una respuesta más evaluable de los fallos. * Se puede ocultar mientras Freenet continúa ejecutándose. * Puede ubicarse en otros lugares distintos de la carpeta de instalación de Freenet. Si todo va bien para esta aplicación de bandeja de sistema, planeamos que se distribuya con la build 1468. ¡Apreciamos mucho que la prueben! Si desea probarla usted mismo, puede encontrarla [aquí](https://downloads.freenetproject.org/FreenetTray-testing-eaf31ea.exe). Por favor, háganos saber qué tal va y si desearía ver cualquier cambio.

source: 2015-02-11 - Freenet received the SUMA Award 2014/15
es: 2015-02-11 - Freenet recibió el Premio SUMA 2014/15
zh_cn: 2015-02-11 - Freenet 获得 SUMA Award 2014/15
