Repository: hyphanet/website
Catalog: locale/*/LC_MESSAGES/freenet_site.po
Languages: es, zh_cn

source: A typical CHK key looks like this: CHK@file hash,decryption key,crypto settings or for example: CHK@SVbD9~HM5nzf3AX4yFCBc-A4dhNUF5DPJZLL5NX5Brs,bA7qLNJR7IXRKn6uS5PAySjIM6azPFvK~18kSi6bbNQ,AAEA--8 The decryption key is stored encrypted within the file, so it is not possible to decrypt the file without the CHK key. To access the file, the whole key must be pasted behind the FProxy address (cut to fit screen): http://localhost:8888/CHK@SVbD9~[..]X5Brs,bA7qLN[..]Si6bbNQ,AAEA--8
zh_cn: 一个典型的 CHK 格式如下： CHK@文件哈希值,解密密钥,加密方式设置 示例： CHK@SVbD9~HM5nzf3AX4yFCBc-A4dhNUF5DPJZLL5NX5Brs,bA7qLNJR7IXRKn6uS5PAySjIM6azPFvK~18kSi6bbNQ,AAEA--8 解密密钥是和文件一并加密储存的，因此如果没有 CHK 键值，是无法解密文件的。 要访问文件，您需要将整个键值都粘贴到 FProxy 网址后（下面的示例已截短以适配页面宽度）： http://localhost:8888/CHK@SVbD9~[..]X5Brs,bA7qLN[..]Si6bbNQ,AAEA--8

source: ### Containers A container, in general Freenet terms, is a file that contains several other files. In freenet 0.7, a freesite, or other collection of files, may be bundled together in a ZIP file, which is limited in size to 2MB. Containers have the advantage that when you load one page you load all the files on the freesite, so either it loads in its entirety or it doesn't load at all, and greatly reduce the number of keys required to insert a given freesite. Containers are currently created transparently when inserting a freesite using e.g. jSite.
zh_cn: ### 容器 “容器”，在 Freenet 术语中是指一个文件，它包含了其他一些文件。在 Freenet 0.7 中，Freesite 或其他文件集合，可能被打包在一个 ZIP 文件中，文件大小限制为 2MB。容器的优点是当您加载一个页面时，您其实加载了该页面所在 Freesite 的所有文件。这样要么整个网站都被加载，要么都不加载。它也减少了插入 Freesite 所需的键值数量。在使用 jSite 等工具插入 Freesite 时，用户基本上不会注意到容器的存在。

source: Social
zh_cn: 社交

source: [Step by step guide](http://freesocial.draketo.de/) to setting up Freenet and various Freenet apps. Please try this, especially if installing on OS X. We are not responsible for unofficial third party apps it recommends (including FMS), but many Freenet users and developers use them.
zh_cn: 这里有一篇[指南](http://freesocial.draketo.de/)可以手把手教您如何设置 Freenet 以及各种运行在 Freenet 上的 App。强烈建议您阅读！如果您恰好使用苹果的 OS X 操作系统，那么更要看一下了。我们对此文中推荐的的第三方 App 无法提供技术支持（包括 FMS），但是很多 Freenet 用户和开发者都使用它们。

source: Show instructions for:
zh_cn: 点击显示其他操作系统的安装说明：

source: ### Windows Download and run [the installer](assets/jnlp/FreenetInstaller.exe) ([try this if the first link is blocked](https://downloads.freenetproject.org/latest/FreenetInstaller.exe)) It will automatically install Freenet and other required components for you. When done, your default browser will automatically open up to Freenet's web-based user interface. (Freenet contains **NO spyware or adware** , it's Free Software! The source code is publicly available for review) Freenet requires Windows XP or later.
zh_cn: ### Windows 下载[安装程序](assets/jnlp/FreenetInstaller.exe)，双击运行。如果第一个链接无法下载，试试[这个链接](https://downloads.freenetproject.org/latest/FreenetInstaller.exe)。 安装程序将自动为您安装 Freenet 和其他必需的组件。安装完成后，您的默认浏览器将自动打开 Freenet 的控制台网页（Freenet **不包含恶意软件或广告软件**，它是一个自由软件！您可以审阅它的源代码）。 Freenet 需要 Windows XP 或更高版本。

source: ### OS X Download and run [the installer][url_mac_installer] ([gpg signature][url_gpg_sig]). It will automatically install Freenet and other required components for you. When done, your default browser will automatically open up to Freenet's web-based user interface. Freenet requires OS X 10.8 or later.
zh_cn: ### OS X 下载并运行[安装程序][url_mac_installer] ([gpg signature][url_gpg_sig])。 它会自动为您安装 Freenet 和其依赖组件。安装完成后，您的默认浏览器会自动打开 Freeent 的网页界面。 Freenet 需要 OS X 10.8 或更高版本。

source: ### GNU/Linux & POSIX Try the [Java Web Start installer](assets/jnlp/freenet.jnlp). If it doesn't work: You need to have a recent **Java Runtime Environment** (JRE). We have experienced best results with Oracle's Java Runtime Environment which can be obtained via your [package manager]( https://en.wikipedia.org/wiki/Package_manager) or from [ http://www.java.com/](http://www.java.com/). Java version 1.6 or higher is required, and 1.7 or higher is strongly recommended. You should keep Java up to date to avoid problems and for better performance. Open a terminal and run:
zh_cn: ### GNU/Linux & POSIX 尝试使用 [Java Web Start 安装程序](assets/jnlp/freenet.jnlp)。如果无法正常工作： 您需要安装最新版的 **Java 运行环境** (JRE)。Oracle 的 JRE 是最好的选择，您可以通过您的[包管理器]( https://en.wikipedia.org/wiki/Package_manager) 或 [ http://www.java.com/](http://www.java.com/) 免费下载安装。 Java 最低版本要求为 1.6。推荐使用 1.7 或更高版本。您应当经常升级 Java，以避免问题和提高性能。 打开终端命令提示符运行：

source: Alternatively, downloading [the installer](assets/jnlp/freenet_installer.jar) ([gpg signature][jar_sig]) and then clicking on the file may work on some systems, but if there are problems we recommend the above command lines. If wget is not installed, it can be installed with a package manager, such as sudo apt-get install wget on Debian or Ubuntu. If the link above is blocked, you could download it from our server [here](https://downloads.freenetproject.org/latest/new_installer_offline.jar). But please use the other link if you can. **Note:** Many GNU/Linux distributions no longer ship with Java Web Start enabled. We would like to make distribution packages for easier installation, and have an in-development (and not maintained) [Debian package]( https://github.com/freenet/debian), but haven't gotten it stable or made official ones for other distributions. If you are a developer and would like to join us and help it would be much appreciated! If this doesn't work on a headless server, try "java -jar new_installer_offline.jar -console", and follow the prompts to tell it where to install Freenet etc.
zh_cn: 另外，您还可以[下载安装程序](assets/jnlp/freenet_installer.jar) ([gpg signature][jar_sig])，并双击它来安装。不过在有些系统这种方式可能不起作用，这时我们推荐您尝试上面的命令。如果没有安装 wget，您可以通过系统的软件包管理器来安装，如 Debian 或 Ubuntu 可以使用命令：sudo apt-get install wget。 如果上面的下载链接被封，您可以[点击这里](https://downloads.freenetproject.org/latest/new_installer_offline.jar)从我们的服务器直接下载。不过因为流量和带宽的原因，尽可能不要使用这个链接。 **注意：** 许多 GNU/Linux 的发行版不再启用 Java Web Start。我们想制作一个更容易安装的软件包，并且已经有一个正在开发的（目前已没有人维护）[Debian 软件包]( https://github.com/freenet/debian)，但是目前还不稳定，也不支持其他类型的发行版。如果您是个开发者，愿意加入并协助我们完成这个任务，不甚感激！ 上述方式如果不能在无外设服务器上正常工作，您可以使用命令 "java -jar new_installer_offline.jar -console"，并根据提示安装 Freenet。

source: ### Mirrored installation If you have a working Freenet installation directory that you have mirrored from one Unix machine to another (e.g. via rsync or unison), enabling the mirrored installation is not difficult. Nothing in a Freenet installation cares about its host's IP address; it can't, or Freenet would fail on machines that get IP addresses from a DHCP pool. All you actually need to do is tell the system you've mirrored to that it should start the Freenet proxy daemon for you on boot. Do `crontab -l` on the source machine, find the line that is tagged "FREENET AUTOSTART" and add that to your crontab on the mirrored machine. However: each installation has a unique identity key generated at installation time. If you try to run two instances with the same identity _at the same time_, both proxy demons will become confused and upset. Don't do this! ### HOWTO You might find the [Freenet Social Networking Guide](http://freesocial.draketo.de/index.html) useful.
zh_cn: ### 镜像安装 如果您的 Freenet 安装目录是从其他 Unix 电脑镜像过来的（例如：通过 rsync 或 unison），启用镜像安装很简单。Freenet 的任何部分都不依赖于其主机 IP 地址；否则，如果主机是从 DHCP 获取的动态 IP，Freenet 就会无法正常运行。 您只要告诉存放镜像的系统，应该在启动时自动启动 Freenet 代理服务。在源系统使用 `crontab -l`，找到标记有“FREENET AUTOSTART”的一行，将它添加到镜像系统的 crontab 中。 但是每个 Freenet 节点有一个唯一的身份键值，是安装时自动生成的。如果您的两个节点_同时_使用同一个身份键值，两个代理服务会互相干扰运行异常。请别这么做！ ### HOWTO 这里有一篇 [Freenet 社交网络指南](http://freesocial.draketo.de/index.html)，推荐您阅读。 useful.

source: ### It doesn't work, now what? If you have problems installing or running Freenet, please contact us on [the support list](mailto:support@freenetproject.org) ([subscribe here]( help.html#mailing-lists)), or join us on IRC on the #freenet channel on irc.freenode.net (try [here]( https://webchat.freenode.net/?randomnick=1&channels=freenet)).
zh_cn: ### 我运行不起来，怎么办？ 如果您安装或运行 Freenet 遇到问题，您可以在[技术支持邮件列表](mailto:support@freenetproject.org)与我们联系（[在这里订阅]( help.html#mailing-lists)），或是使用 IRC 软件进入 irc.freenode.net 服务器的 #freenet 频道（[点这里在浏览器里面直接访问](https://webchat.freenode.net/?randomnick=1&channels=freenet)）。

source: ### Upgrading Freenet provides an update-over-freenet mechanism: It will keep itself up to date automatically from other Freenet nodes, and this will normally work even if it is unable to route to them due to them being too new. This is anonymous and secure, and we recommend people use it. However, if something is severely broken, you can update your node manually from our servers: * Windows users can upgrade to the latest-stable Freenet release from the system tray menu, or by running "update.cmd" in the Freenet directory. * OS X, GNU/Linux, or other POSIX users may upgrade by running the update.sh shell script in the Freenet directory. **Source Code:** See [the GitHub repository](https://github.com/freenet/fred).
zh_cn: ### 升级 Freenet 提供了通过 Freenet 网络自动升级的机制：它会自动从其他节点下载升级文件，自动更新。即使您的 Freenet 版本过旧，无法正常通过其他节点路由，仍能够自动升级。升级是匿名安全的，我们建议您使用这种方式。但是，如果出现严重问题，无法自动升级，您可以连接到我们的服务器手动升级： * Windows 用户可以点击系统托盘图标相应的菜单，或者运行 Freenet 安装目录下的“update.cmd”升级到最新稳定版本。 * OS X、GNU/Linux 或其他 POSIX 操作系统的用户可以运行 Freenet 安装目录下的“update.sh”脚本来升级。 **源代码**：参见 [GitHub 库](https://github.com/freenet/fred)。

source: Important note for first time users
zh_cn: 新用户重要提示

source: All my friends donate very little space and bandwidth. Why should I donate more?
zh_cn: 我的朋友只贡献了很少的空间和带宽。为什么我要多贡献？

source: Yes, in fact even without the anonymity feature Freenet is very useful because of its unique way it handles content distribution and information load. In simple terms that means you can publish a website without worrying about how big the site will be and without having to put someone elses ad banners on it. While it is unlikely that freenet sites will ever load faster than regular websites, it does adapt to sudden surges of visitors better ( which often happen when relatively unknown sites get linked to from a big site), and reasonable download speeds for big files are feasible too. Just don't expect very low latency.
zh_cn: 其实，不算上匿名功能的 Freenet 也非常有用，这是因为其独特的内容分发和信息载入方式。 简单来说，这意味着你可以发布一个网站，并且无需担心如何放置较大的网站，也不用放置别人的广告横幅。虽然 Freenet 网站永远不可能比普通的网站载入更快，但它能更好的适应突然增加的访问量（这往往发生在一个未知的网站被一个大型网站链接），较大的文件也有着合理和可行的下载速度。只是，不要期待有较低的延迟。

source: Fred (the Freenet REference Daemon) runs as a daemon, or service, in the background. You normally talk to it through a Freenet client. One built-in client is fproxy, which lets you talk to Freenet with a web browser. Freenet should have installed a Browse Freenet shortcut on the desktop and/or the start menu, or a system tray icon (rabbit) with a Launch Freenet menu item. Failing that, point your web browser to [http://127.0.0.1:8888/]( http://127.0.0.1:8888/) for the gateway page. Try clicking the various links in the "Freesite subscriptions" panel to reach some of the popular Freenet index sites.
zh_cn: Fred（Freenet REference Daemon）运行为一个后台进程或者服务。您通常使用 Freenet 客户端与其交谈。一个内置的客户端是 fproxy，它让你可以用一个网页浏览器与 Freenet 沟通。Freenet 应该已经在桌面和/或开始菜单安装了一个 Freenet 的快捷方式，或者一个带有启动 Freenet 菜单项的托盘图标（兔子图案）。如果以上都没有，请使用网页浏览器访问 [http://127.0.0.1:8888/](http://127.0.0.1:8888/) 到达网关页面。尝试点击“Freesite 订阅”面板的各个链接到达各个流行的 Freenet 索引网站。

source: How do I get freenet working with a Firewall/NAT?
zh_cn: 我可以在 防火墙/NAT 后面使用 Freenet 吗？

source: Freenet will have problems if your clock is constantly being rewound. Usually this happens when something is resetting your clock regularly in big jumps. On linux, you should run ntpd to make sure your clock isn't too far off (this isn't vital but it's helpful), but if you see clock skew errors, try adding the -x option to it to avoid big backwards jumps. Also, running ntpdate on startup so there is one big jump before freenet starts is a good idea. This can also happen on Windows sometimes, let us know how you managed to fix it ... generally it's not all that serious though, especially if big jumps in the clock are only once a day.
zh_cn: Freenet 将出现问题，如果您的时钟经常向回走。这通常发生在一些定期发生的时钟有较大跳跃时。在 Linux 上，您应该运行 ntpd 来确保您的时钟没有偏移（这不是必要的，但有用），但如果您看到时钟偏移错误，尝试添加 -x 选项来避免较大的向后跳跃。另外，在启动时运行 ntpdate 以保证 Freenet 启动前被纠正是个好主意。这有时也发生在 Windows 上，如果您知道怎么解决它，让我们知道...通常它不会特别严重，特别是如果较大的时钟跳跃每天只有一次。

source: Freenet is a platform for censorship-resistant communication and publishing. It helps you to remain anonymous, and communicate without fear.
zh_cn: Freenet 是一个无法被任何个人或者组织审查的通讯和内容发布平台。 通过它，您可以匿名、无所顾忌的与他人沟通。

source: *'Daddy, where were you when they took freedom of the press away from the Internet?'* — Mike Godwin ([read more](about.html))
zh_cn: *“‘老爸，当年他们将新闻自由权从网络夺走的时候，你去哪了？’”* — Mike Godwin ([了解更多](about.html))

source: Host a Website
zh_cn: 托管网站

source: Need a website nobody can take over? That is hosted for free? That is very resistant to attacks? Publish it on Freenet!
zh_cn: 不想自己的网站被其他人强制接管？网站托管还是免费的？还能抵御攻击？把它发布在 Freenet 上吧！

source: *'Now the Mempo repository can not be censored, DDoSed or taken offline, despite having just one tiny server.'* — rfree in [apt-get over Freenet](news.html#20150105)
zh_cn: *“现在 Mempo 软件库不可能再被审查、DDoS 攻击或被强制下线，尽管有一台很小的服务器。”* — 在《[apt-get over Freenet](news.html#20150105)》新闻中 rfree 说。

source: Upload a file to Freenet and anyone with the secret URL can access it.
zh_cn: 上传一个文件到 Freenet，所有知道其秘密网址的人都可以下载它。

source: *[follow the blue rabbit through the looking glass](download.html#autostart)*
zh_cn: *[跟随这只蓝色兔子梦游仙境……](download.html#autostart)*

source: Meet New People
zh_cn: 认识新朋友

source: People from all over the world use Freenet to communicate. Some of them do so anonymously. You might never hear their voices in the open.
zh_cn: 来自世界各地的人们使用 Freenet 沟通。其中某些人喜欢匿名沟通。您可能从来没有在开放场合听到过他们的声音。

source: *'The value of publishing is not me wanting you to watch. The value of publishing is you wanting to see what I provide.'* — A.B.
zh_cn: *“公开发表的价值不是我想让您看。公开发表的价值是您想看我提供的内容。”* — A.B.

source: Experiment with Exciting New Technology
zh_cn: 体验激动人心的新技术

source: Freenet is on the cutting edge of distributed routing research. The data storage provided by Freenet is a proving ground for a number of new distributed systems. ([Papers](about.html#papers))
zh_cn: Freenet 是对分布式路由最前沿的研究。Freenet 的“数据存储”是多个新分布式系统的试验场。([论文](about.html#papers))

source: *'A decentralized anonymous datastore with real censorship resistance, no central authority and long lifetime only for information which people actually use.'* — [The forgotten Cryptopunk Paradise](http://draketo.de/english/freenet/forgotten-cryptopunk-paradise)
zh_cn: *“一个去中心化的匿名数据存储，真正能够抵御内容审查。它没有中央集权，信息能够长时间存在。它是一个真正可用的系统。”* — [The forgotten Cryptopunk Paradise](http://draketo.de/english/freenet/forgotten-cryptopunk-paradise)

source: Improve the World
zh_cn: 改善世界

source: By using Freenet from the "free world" you help people in oppressive regimes share information. The more people use Freenet the easier it will be to obtain.
zh_cn: 在“自由世界”使用 Freenet，您可以帮助被高压政权统治的人们分享信息。越多人使用 Freenet，越多人能够获得它。

source: If one percent of people used Freenet, everyone could safely be a whistleblower.
zh_cn: 如果 1% 的人使用 Freenet，每个人都可以安全的爆料。

source: Join us in Freenet
zh_cn: 加入 Freenet

source: *'Many years passed, two towers fell, the empire expanded its hunt for rebels all over the globe, and now, as the empire’s grip has become so horrid that even the most loyal servants of the emperors turn and expose their dark secrets, Freenet is still moving forward.'* — [The forgotten Cryptopunk Paradise](http://draketo.de/english/freenet/forgotten-cryptopunk-paradise)
zh_cn: *“很多年过去了，世贸双塔倒了，这个帝国正在全球打击恐怖主义。现在，这个帝国的控制力变得如此恐怖，即使皇帝最忠实的仆人也无法保守他们自己内心深处的秘密。但是 Freenet 仍在不停进步。'* — [The forgotten Cryptopunk Paradise](http://draketo.de/english/freenet/forgotten-cryptopunk-paradise)

source: The Freenet project has joined the [Localization Lab](http://www.localizationlab.org) organization on Transifex. This allows a larger team of translators, translating into more languages, and access to paid support. If this transition has caused any problems please let us know!
zh_cn: Freenet 项目已加入 Transifex 上的 [Localization Lab](http://www.localizationlab.org) 组织。这可以带来更大的翻译团队，翻译成更多的语言，以及获得付费支持。 如果这一转换引发了任何问题，请告知我们！
