Repository: hyphanet/website
Catalog: locale/*/LC_MESSAGES/freenet_site.po
Languages: es, zh_cn

source: ![][icon_pdf] [Presentation: Towards "Dark" Social Networking Services (Strufe et al.)](https://www.icsi.berkeley.edu/icsi/sites/default/files/events/events_1303_strufe.pdf) (PDF) An interesting presentation by the group responsible for the two above papers.
es: ![][icon_pdf] [Presentation: Towards "Dark" Social Networking Services (Strufe et al.)](https://www.icsi.berkeley.edu/icsi/sites/default/files/events/events_1303_strufe.pdf) (PDF) Una presentación interesante del grupo responsable de las dos publicaciones anteriores.
zh_cn: ![][icon_pdf] [Presentation: Towards "Dark" Social Networking Services (Strufe et al.)](https://www.icsi.berkeley.edu/icsi/sites/default/files/events/events_1303_strufe.pdf) (PDF) 来自上面两篇论文团队的一个有趣的幻灯演示。

source: ![][icon_pdf] [Pisces: Anonymous Communication Using Social Networks](http://arxiv.org/abs/1208.6326) An algorithm for setting up onion-like tunnels on darknets.
es: ![][icon_pdf] [Pisces: Anonymous Communication Using Social Networks](http://arxiv.org/abs/1208.6326) Un algoritmo para establecer túneles tipo-onion en darknets.
zh_cn: ![][icon_pdf] [Pisces: Anonymous Communication Using Social Networks](http://arxiv.org/abs/1208.6326) 一篇关于在暗网中设置类似 Tor 隧道的算法论文。

source: ![][icon_pdf] [Routing in the Dark: Pitch Black](http://grothoff.org/christian/pitchblack.pdf) ([citeseer](http://citeseerx.ist.psu.edu/viewdoc/summary?doi=10.1.1.117.1543)) (PDF) A paper describing some attacks on Freenet 0.7's location swapping algorithm. We have solutions for this but they are still being tested.
es: ![][icon_pdf] [Routing in the Dark: Pitch Black](http://grothoff.org/christian/pitchblack.pdf) ([citeseer](http://citeseerx.ist.psu.edu/viewdoc/summary?doi=10.1.1.117.1543)) (PDF) Una publicación describiendo algunos ataques sobre el algoritmo de intercambio de ubicaciones de Freenet 0.7. Tenemos soluciones para esto pero aún se están probando.
zh_cn: ![][icon_pdf] [Routing in the Dark: Pitch Black](http://grothoff.org/christian/pitchblack.pdf) ([citeseer](http://citeseerx.ist.psu.edu/viewdoc/summary?doi=10.1.1.117.1543)) (PDF) 这篇论文描述了一些对 Freenet 0.7 位置交换算法的攻击方式。 我们对此已经有了解决方案，仍在测试中。

source: The most up to date reference is of course [the source code]( https://github.com/freenet/fred), but there is also some useful documentation on [the wiki](https://wiki.freenetproject.org/) (you may have to search a bit), and most implemented ideas have been discussed in detail on [the mailing lists](help.html#mailing-lists) at some point, more recently often in-Freenet forums such as FMS, or [the bug tracker](https://bugs.freenetproject.org/). [icon_pdf]: assets/img/small-n-flat/file-pdf.png [icon_video]: assets/img/small-n-flat/file-video.png
es: La referencia más actualizada es por supuesto [el código fuente]( https://github.com/freenet/fred), pero también hay algo de documentación útil en [el wiki](https://wiki.freenetproject.org/) (puede que tenga que buscar un poco), y la mayoría de ideas implementadas han sido discutidas en detalle en [las listas de correo](help.html#mailing-lists) en algún punto, más recientemente a menudo en los foros dentro de Freenet como FMS, o en [el rastreador de falllos](https://bugs.freenetproject.org/). [icon_pdf]: assets/img/small-n-flat/file-pdf.png [icon_video]: assets/img/small-n-flat/file-video.png
zh_cn: 最新的参考资料当然是[源代码]( https://github.com/freenet/fred)，但是 [Wiki](https://wiki.freenetproject.org/) 中也有一些有用的文档（您可能需要搜索一下）。而很多实现的想法细节也曾在[邮件列表](help.html#mailing-lists)中讨论过。最近我们也经常在 Freenet 中的论坛（如 FMS），或是[Bug 跟踪网站](https://bugs.freenetproject.org/)中讨论。 [icon_pdf]: assets/img/small-n-flat/file-pdf.png [icon_video]: assets/img/small-n-flat/file-video.png

source: About
es: Acerca de
zh_cn: 关于

source: I'll be patient, I promise!
es: ¡Tendré paciencia, lo prometo!

source: Please note
es: Por favor, observe que
zh_cn: 请注意

source: This chat is staffed by volunteers, and it may be that no one is around right now. Please ask your question, and someone will answer within several hours.
es: Este chat está gestionado por voluntarios, y puede ser que no haya ninguno por aquí ahora mismo. Por favor, formule su pregunta, y alguien le responderá dentro de varias horas.
zh_cn: 这个聊天由志愿者组成，有时可能没有人在线。请直接提出你的问题，其他人会在几个小时内答复。

source: Freenet rabbit logo
es: Logo del conejo de Freenet
zh_cn: Freenet 兔子标志

source: Contact
es: Contactar
zh_cn: 联系我们

source: Press:
es: Prensa:
zh_cn: 媒体：

source: Support:
es: Soporte:
zh_cn: 用户支持：

source: {irc_channel} on {irc_server}
es: {irc_channel} en {irc_server}
zh_cn: {irc_server} 上的 {irc_channel} 频道

source: License
es: Licencia
zh_cn: 许可协议

source: Content on this website is licensed under the GNU Free Documentation License and may be available under other licenses.
es: El contenido en este sitio web está licenciado bajo la GNU Free Documentation License y puede estar disponible bajo otras licencias.
zh_cn: 本网站上的内容可按照 GNU 自由文档许可证及其他可适用的许可协议授权。

source: Design by DesignBootstrap
es: Diseño por DesignBootstrap
zh_cn: 网站设计 DesignBootstrap

source: Developers
es: Desarrolladores
zh_cn: 开发者

source: If you already have a contribution in mind you can find the project repositories [on GitHub](https://github.com/freenet/). - Get in contact in the [mailing lists](help.html#mailing-lists) - Join us on IRC: [#freenet on chat.freenode.net](help.html#irc) - Report issues in the [bug tracker](https://bugs.freenetproject.org/) The Wiki contains a list of [freenet-related projects](https://wiki.freenetproject.org/Projects) and documentation of the [Freenet Client Protocol](https://wiki.freenetproject.org/FCPv2) for using Freenet from external programs. We're happy to accept pull requests on GitHub as well as patches sent under a pseudonym through Freenet forums such as [FMS](http://freesocial.draketo.de/fms_en.html).
es: Si ya tiene una contribución en mente, puede encontrar los respositorios del proyecto [en GitHub](https://github.com/freenet/). - Póngase en contacto en las [listas de correo](help.html#mailing-lists) - Únase a nosotros en el IRC: [#freenet en chat.freenode.net](help.html#irc) - Informe de fallos en el [rastreador de fallos](https://bugs.freenetproject.org/) El Wiki contiene una lista de [proyectos relacionados con Freenet](https://wiki.freenetproject.org/Projects) y documentación del [Protocolo de Cliente de Freenet](https://wiki.freenetproject.org/FCPv2) para usar Freenet desde programas externos. Nos complace aceptar peticiones de incorporación (pull) en GitHub así como parches enviados bajo pseudónimo a través de foros de Freenet tales como [FMS](http://freesocial.draketo.de/fms_en.html).

source: Translation
es: Traducción
zh_cn: 翻译

source: Bug tracker
es: Monitor de errores
zh_cn: Bug 跟踪系统

source: Contribute
es: Contribuir
zh_cn: 贡献

source: Documentation
es: Documentación
zh_cn: 文档

source: The documentation on Freenet is forever changing, since this is a project in development. However, here under the Documentation menu, you may find usage documents on how to setup Freenet and use the most popular Freenet tools as well as a user driven Wiki and an extensive Frequently Asked Questions department. * [**Install**](#install) Contains detailed instructions on how to install Freenet using the new installer. * [**Connect**](#connect) How to connect to Freenet. * [**Content**](#content) Freenet as a Content Distribution System. * [**Understand**](#understand) Explains the workings of Freenet, and a glossary with the most frequently used terms. * [**Social**](#social) How to setup email, forums and microblogging over Freenet. * [**jSite**](#jsite) jSite is a Freenet website (a.k.a. Freesite) insertion tool. * [**Wiki**](https://wiki.freenetproject.org/) The Freenet Wiki is a user driven space where new features may be described before finding their way into the website. It is a good source of information about all sorts of Freenet related issues.
es: La documentación en Freenet siempre está cambiando, ya que este es un proyecto en desarrollo. Sin embargo, aquí bajo el menú Documentación, puede encontrar documentos de uso sobre cómo instalar Freenet y usar las herramientas de Freenet más populares, además de un Wiki llevado por los usuarios y un extenso apartado de Preguntas Frecuentes (FAQ). * [**Instalar**](#install) Contiene instrucciones detalladas sobre cómo instalar Freenet usando el nuevo instalador. * [**Conectar**](#connect) Cómo conectar a Freenet. * [**Contenido**](#content) Freenet como un sistema de distribución de contenidos (CDS). * [**Comprender**](#understand) Explica los trabajos sobre Freenet e incluye un glosario con los términos más frecuentemente usados. * [**Social**](#social) Cómo configurar correo electrónico, foros y microblogging sobre Freenet. * [**jSite**](#jsite) jSite es una herramienta de inserción de sitios web de Freenet (Freesites). * [**Wiki**](https://wiki.freenetproject.org/) El Wiki de Freenet es un espacio llevado por los usuarios donde se pueden describir nuevas características antes de que encuentren su camino hacia el sitio web de Freenet. Es una buena fuente de información sobre todo tipo de asuntos relacionados con Freenet.

source: Install
es: Instalar
zh_cn: 安装

source: To install Freenet might not be as difficult as you might have heard. There are three ways to install Freenet: * Graphical install * Headless install * Enabling a mirror copy of a Freenet installation If you want to install the Freenet software on a computer which lacks a GUI, see the [Headless install](download.html#unix) instructions. If you have mirrored a working Freenet installation to a machine without explicitly installing it, see [Mirrored install](download.html#mirrored). Otherwise, continue reading.
es: Instalar Freenet podría no ser tan difícil como puede haber oído. Hay tres maneras de instalar Freenet (según lo que se instala): * Instalación con interfaz 'Gráfica' * Instalación sin intefaz gráfica 'Headless' * Habilitar una copia réplica 'Mirror' de una instalación de Freenet Si quiere instalar el software Freenet en una computadora carente de interfaz gráfica (GUI) vea las instrucciones de [instalación sin interfaz gráfica 'Headless'](download.html#unix). Si ha replicado una instalación funcional de Freenet en una máquina sin instalarlo explícitamente, vea [instalación replicada 'Mirrored'](download.html#mirrored). De otro modo, continúe leyendo.
zh_cn: 安装 Freenet 并不是您想像得那么难。安装 Freenet 有三种方式： * 图形界面安装 * 无外设安装 * 复制一个已安装的 Freenet 镜像 如果您要在无图形界面的操作系统下安装 Freenet 软件，参见[无外设安装](download.html#unix)说明。如果您想复制一套安装好的 Freenet 到另一台电脑，参见[镜像安装](download.html#mirrored)。如果不是上述两种情况，请继续阅读本文。

source: #### Graphical install **The information below does not apply to Windows systems**. For Windows you should use [the installer for Windows](assets/jnlp/FreenetInstaller.exe) as described on [the download page](download.html). You can also get the installer for Windows from [here](https://downloads.freenetproject.org/latest/FreenetInstaller.exe). For a graphical installation you have to have: * a working Java Runtime Environment * a downloaded copy of [new_installer_offline.jar](assets/jnlp/freenet_installer.jar) (if this does not work try [here](https://downloads.freenetproject.org/latest/new_installer_offline.jar)) * a working graphical user interface (GUI) You should save the new_installer.jar file somewhere where you can find it again. Your home-directory should be a good place. The next step requires you to know where you stored the file (the path to it), so it is quite important that you do that step thoroughly.
es: #### Instalación gráfica **La información de debajo no se aplica a sistemas Windows**. Para Windows debe usar [el instalador para Windows](assets/jnlp/FreenetInstaller.exe) tal como se describe en [la página de descargas](download.html). También puede obtener el instalador para Windows [aquí](https://downloads.freenetproject.org/latest/FreenetInstaller.exe). Para una instalación gráfica ha de tener: * un Java Runtime Environment (entorno de ejecución de Java) funcional * una copia descargada del [new_installer_offline.jar](assets/jnlp/freenet_installer.jar) (si este no funciona pruebe [aquí](https://downloads.freenetproject.org/latest/new_installer_offline.jar)) * una interfaz gráfica de usuario (GUI) funcional Debe guardar el fichero new_installer.jar en algún lugar donde pueda encontrarlo de nuevo. Su directorio personal debería ser un buen lugar. El próximo paso requiere que sepa dónde guardó el fichero (la ruta hacia este), así que es bastante importante que realice este paso concienzudamente.

source: To start the installation, open a command line interface/terminal/shell window. Exchange the **/path/to** to the real path (for example: /home/username/download/new_installer.jar) to the new_installer.jar-file and type: <pre> $ java -jar /path/to/new_installer_offline.jar</pre> The first window you should see is the one below, which allows you to select your preferred language for the installation program. ![](assets/img/install/1-langselect.png) Next is shown an about-box, some information about the version of Freenet and authors. Just click **Next** to proceed. ![](assets/img/install/2-about.png) The next step is to choose the directory in which to install Freenet. The default location on GNU/Linux & POSIX operating systems is **/home/username/Freenet** as shown below. Change it to something appropriate or leave "as is". Click **Next** when you are finished. ![](assets/img/install/4-Install_directory.png) Select the packages that you want to install with your Freenet software. Since it takes up virtually no extra disk-space, it is recommended that you leave all packages selected and press **Next**. ![](assets/img/install/5-select_packages.png) In the next stage, the packages are installed, and a progress meter runs across the window. When it is finished, press **Next** to continue to the next step. ![](assets/img/install/6-Install_packages.png) After that, the Freenet software is installed and/or upgraded, plugins are enabled and the environment is started. When completed, press **Next** to proceed. ![](assets/img/install/7-install_progress.png) For some graphical environments, shortcuts in the menu-structure can be created. This is not the case for all of the platforms that Freenet run on. However, there should be created shortcuts on the desktop in all supported environments. Change the application group according to your needs and press **Next** when finished. ![](assets/img/install/8-create_shortcuts.png) After that, the installation is finished. Click **Done** to close the window. ![](assets/img/install/9-Install_finished.png) If all has gone well, a browser window should have opened in the background. This will ask you a bunch of questions to configure Freenet, and then you should be able to use it.
es: Para comenzar la instalación, abra una ventana de interfaz de línea-de-comandos/terminal/shell. Intercambie la **/ruta/a** con la ruta real al fichero new_installer.jar (ej. /home/username/download/new_installer.jar) y escriba: <pre> $ java -jar /ruta/a/new_installer_offline.jar</pre> La primera ventana que debería ver es la de debajo, que le permite seleccionar su idioma preferido para el programa de instalación. ![](assets/img/install/1-langselect.png) A continuación se muestra un cuadro 'acerca de', con algo de información sobre la versión de Freenet y los autores. Simplemente pulse **Siguiente** para continuar. ![](assets/img/install/2-about.png) El siguiente paso es para elegir el directorio en el que instalar Freenet. La ubicación predeterminada en sistemas operativos GNU/Linux y POSIX es **/home/username/Freenet** tal como se muestra debajo. Cámbielo por algo adecuado o déjelo "como está". Pulse **Siguiente** cuando termine. ![](assets/img/install/4-Install_directory.png) Seleccione los paquetes que quiera instalar con su software Freenet. Como prácticamente no requiere espacio extra de disco, se recomienda que deje seleccionados todos los paquetes y pulse **Siguiente**. ![](assets/img/install/5-select_packages.png) En la siguiente etapa los paquetes se instalan, y el un medidor de progreso avanza a lo largo de la ventana. Cuando termine, pulse **Siguiente** para continuar con el sigueinte paso. ![](assets/img/install/6-Install_packages.png) Después de eso, el software Freenet se instala y/o actualiza, los complementos se habilitan y el entorno es iniciado. Cuando se complete pulse **Siguiente** para continuar. ![](assets/img/install/7-install_progress.png) Para algunos entornos gráficos, se pueden crear atajos en la estructura de menú. Este no es el caso para todas las plataformas en las que se ejecuta Freenet. Sin embargo, deberían haberse creado atajos en el escritorio en todos los entornos soportados. Cambie el grupo de la aplicación de acuerdo a sus necesidades y pulse **Siguiente** cuando termine. ![](assets/img/install/8-create_shortcuts.png) Tras esto la instalación está finalizada. Haga clic en **Completado* para cerrar la ventana. ![](assets/img/install/9-Install_finished.png) Si todo ha ido bien, debería haberse abierto una ventana de navegador en segundo plano. Esta le formulará un montón de preguntas para configurar Freenet, y posteriormente debería ser capaz de usarlo.
zh_cn: 要开始安装，您需要打开命令行提示符/终端/Shell 窗口。运行命令时，请将命令中的 **/path/to** 替换为 new_installer.jar 文件的真实路径（例如：/home/username/download/new_installer.jar）然后输入下面的命令： <pre> $ java -jar /path/to/new_installer_offline.jar</pre> 首先弹出的窗口让您选择安装程序的语言。 ![](assets/img/install/1-langselect.png) 接下来会显示关于对话框，显示一些 Freenet 版本和作者的信息。点击 **Next** 继续。 ![](assets/img/install/2-about.png) 下一步选择 Freenet 的安装目录。GNU/Linux 和 POSIX 操作系统的默认安装目录是 **/home/username/Freenet**，如下图所示。您可以根据需要修改，或者直接点击 **Next** 按钮。 ![](assets/img/install/4-Install_directory.png) 选择您要安装的 Freenet 组件。因为选择更多的组件不会使用额外的磁盘空间，建议您全部选择。完成后点击 **Next**。 ![](assets/img/install/5-select_packages.png) 下一步，安装开始。当进度条走完，点击 **Next** 来到下一步。 ![](assets/img/install/6-Install_packages.png) 完成后，Freenet 便安装或升级完成，插件会自动启用，Freenet 会自动开始运行。完成后，点击 **Next** 继续。 ![](assets/img/install/7-install_progress.png) 在一些图形环境，可以创建菜单，不是所有环境都支持这一点。但是 Freenet 可运行的图形环境都支持创建桌面快捷方式。根据您的需要修改应用程序组，然后点击 **Next** 按钮。 ![](assets/img/install/8-create_shortcuts.png) 安装完成！点击 **Done** 按钮关闭窗口。 ![](assets/img/install/9-Install_finished.png) 如果一切正常，一个新的浏览器窗口会打开。打开的页面会询问您一些问题来配置 Freenet，之后您就可以正式开始使用 Freenet 了。

source: It will ask about network security level - "protection from strangers attacking you over the internet". If you choose LOW or NORMAL, Freenet should "just work", connecting in a few minutes. If you choose HIGH or MAXIMUM, Freenet will need you to add friends before you can use it. These must be people you personally know. Adding people you don't know will not improve security.
es: Preguntará acerca del nivel de seguridad de red - "protección frente a extraños que le ataquen a traves de Internet". Si escoge BAJO o NORMAL, Freenet debería "simplemente funcionar", conectando en unos pocos minutos. Si elige ALTO o MÁXIMO, Freenet precisará que añada amigos antes de que pueda usarlo. Debe ser gente que conozca personalmente. Añadir personas que no conoce no mejorará la seguridad.

source: Connect
es: Conectar
zh_cn: 连接

source: There are two ways to connect to Freenet: * You can enable insecure mode (the installation wizard will ask you) and Freenet will automatically find nodes to connect to - Strangers. * You can connect to nodes run by people you know - Friends. Note that these should be people you actually know on some level, in order to maintain good network topology and maximum security. In practice, you should probably use both of these options, unless you are really paranoid, in which case you should of course only connect to people you trust. Insecure mode should work automatically once enabled, so the rest of this page is about connecting to Friends. To connect to your friends' nodes, you have to exchange Node references with them. The references must be added on **both sides** to be established. That is, you need to add his/hers, and he/she needs to add yours.
es: Hay dos formas de conectarse a Freenet: * Puede habilitar el modo inseguro (el asistente de instalación le preguntará) y Freenet automáticamente encontrará nodos a los que conectarse - Extraños. * Puede conectar con nodos ejecutados por personas que conoce - Amigos. Observe que estas deben ser personas que de hecho conozca suficientemente, para mantener una buena topología de red y la máxima seguridad. En la práctica probablemente debería usar simultáneamente ambas opciones, a menos que sea verdaderamente paranoico, en cuyo caso por supuesto sólo debería conectar con personas en las que confíe. El modo inseguro debe funcionar automáticamente una vez habilitado, así que el resto de esta página trata acerca de conectar con Amigos. Para conectar con los nodos de sus amigos, tiene que intercambiar referencias de nodos con ellos. Las referencias deben añadirse en **ambos extremos** para que sean establecidas. Esto es, necesita añardir los de él/ella, y él/ella necesita añadir los suyos.
zh_cn: 有两种方式连接到 Freenet： * 您可以启用非安全模式（安装向导会询问您），Freenet 就会自动查找并连接到陌生人。 * 您可以连接到您认识的人运行的节点——好友。请注意他们应当是您比较熟识的人，以维护好的网络拓补和保证最大的安全性。 实践中，两种模式是混合的，除非您比较偏执。非安全模式启用后会自动工作，因此接下来我们会主要介绍如何连接到好友。 要连接到您好友的节点，您需要与他们互相交换节点信息。节点信息必须**双方**都要添加，连接才能建立。也就是，您要添加对方的节点信息，对方也要添加您的节点信息。

source: *When you have a freshly connected node, you have no data cached in your datastore, and very few connections even if insecure mode is enabled. Requests are sent out in a random fashion. **This makes some (or all) requests time out before retrieving anything.** It takes a couple of days for your Freenet node to get up to speed, so please don't get discouraged by this.* You should have at least three nodes that are connected to you at all times, ideally at least five to seven. Since some nodes may be unreachable at times, you need to connect to some more nodes to get the expected number. The nodes that are connected directly to you are the only nodes on Freenet that might see what kind of traffic passes through to your Freenet node. But if insecure mode is enabled, any node can find yours; this is the big advantage of **not** enabling insecure mode: you are effectively invisible except to your friends. In practice most people start off with insecure mode and gradually add friends, and hopefully turn off insecure mode once they have at least 10 friends.
es: *Cuando tenga un nodo conectado por primera vez, no tendrá datos guardados en caché en su almacenamiento de datos, y tendrá muy pocas conexiones incluso si el modo inseguro está habilitado. Las peticiones se envían de forma aleatoria. **Esto hace que algunas (o todas) las peticiones expiren antes de descargar algo.** Llevará un par días para que su nodo Freenet adquiera velocidad, así que, por favor, no se desanime por esto.* Debería tener al menos tres nodos que estén conectados a usted en todo momento, lo ideal sería al menos entre cinco y siete. Como algunos nodos puede que sean inalcanzables en ocasiones, necesita conectar a algunos nodos más para lograr el número esperado. Los nodos que estén conectados directamente a usted son los únicos nodos en Freenet que podrían ver qué clase de tráfico atraviesa su nodo Freenet. Pero si el modo inseguro está habilitado, cualquier nodo puede encontrar el suyo; he aquí la gran ventaja de **no** habilitar el modo inseguro: usted se hace invisible de forma efectiva excepto para sus amigos. En la práctica la mayoría de la gente se inicializa en modo inseguro y gradualmente añade amigos, hasta que eventualmente apagan el modo inseguro una vez tienen al menos 10 amigos.
