Repository: hyphanet/website
Catalog: locale/*/LC_MESSAGES/freenet_site.po
Languages: es, zh_cn

source: ![](assets/img/Freenet-architecture-small.png) *Figure 1: Visible Freenet connections* **Node A** in the figure also has a number of nodes connected to it, but they are all (except from your own node) invisible to you. The traffic routing algorithm is therefore only able to direct traffic to one of the few nodes that you know of that it thinks is most able to find what you are looking for. The traffic is encrypted, so it is quite difficult for the nodes that you connect to to see what your Freenet traffic consists of, but it is far from impossible. It is therefore important that you connect only to people you know. If that is not possible, then at least people you've talked to. There are a number of ways to add peer node references.
es: ![](assets/img/Freenet-architecture-small.png) *Figura 1: Conexiones visibles de Freenet* El **Nodo A** en la figura tiene también distintos nodos conectados a él, pero (excepto su propio nodo) todos son invisibles para usted. Por tanto el algoritmo de enrutamiento del tráfico sólo puede dirigir el tráfico hacia uno de los pocos nodos de entre los que usted conoce que el algoritmo crea que es el más capaz de encontrar lo que usted está buscando. El tráfico está cifrado, así que para los nodos a los que se conecta es bastante difícil ver en qué consiste su tráfico de Freenet, aunque está lejos de ser imposible. Por tanto, es importante que conecte sólo con personas que conoce. Si eso no es posible, entonces al menos con personas con las que haya hablado. Hay distintas formas de añadir referencias de nodos de pares (peers).

source: ### Fproxy Connecting peer nodes with FProxy can be done in several ways. Common for all these are that they are all done under the **Darknet** menu item or using the [http://127.0.0.1:8888/friends/](http://127.0.0.1:8888/friends/) link. Below is the thing that makes it all happen: ![](assets/img/add_peers.png) As you can see, there are three ways of getting a node reference from someone else: * Pasting it "as is", in the top field, * a URL pointing at the reference, or * a file, containing the reference. [http://dark-code.bulix.org/](http://dark-code.bulix.org/) is a so called **paste-bin**, where you can add your node reference, make sure that the **private** box is checked, and press **Paste**. The paste-bin then returns an URL (e.g. http://dark-code.bulix.org/yuf01h-34676?raw), which can be shared with others. Make sure that you add **?raw** to the link. This makes the link point only to the actual pasted data, with no extra design elements. Your own Freenet reference can be found on the [ http://127.0.0.1:8888/friends/](http://127.0.0.1:8888/friends/) page, under the caption **My Node Reference**. It might look something like this (cut to fit on the screen):
es: ### Fproxy Conectar a nodos de pares (peers) con FProxy se puede hacer de varias formas. Todas ellas tienen en común que se realizan bajo el elemento de menú **Darknet** o usando el enlace [http://127.0.0.1:8888/friends/](http://127.0.0.1:8888/friends/). Debajo está aquello que hace que todo esto ocurra: ![](assets/img/add_peers.png) Como puede ver, hay tres formas de obtener una referencia de nodo de alguna otra persona: * Pegarla "tal cual", en el campo de la parte superior, * una URL apuntando a la referencia, o * un fichero, que contenga la referencia [http://dark-code.bulix.org/](http://dark-code.bulix.org/) es uno de los llamados **paste-bin** (recipiente de pegados), donde puede añadir la referencia de su nodo, asegúrese de que la casilla **privado** está marcada, y pulse **Pegar**. El paste-bin devuelve una URL (ej. http://dark-code.bulix.org/yuf01h-34676?raw) a continuación, que se puede compartir con otros. Asegúrese de que añade **?raw** al enlace. Esto hace que el enlace apunte únicamente a los datos que realmente se pegaron, sin elementos adicionales del diseño de la página. Su propia referencia de Freenet se puede encontrar en la página [http://127.0.0.1:8888/friends/](http://127.0.0.1:8888/friends/), bajo el encabezado **Referencia de mi nodo**. Podría tener un aspecto similar a este (aquí recortada para ajustarlo a la pantalla).

source: Remember that both you and the node you are connecting to must add references to make the connection work. This means that if you add a persons node reference on your side, but that person does not add your reference on his/her side, the connection **does not work**.
es: Recuerde que tanto usted como el nodo al que se está conectando deben añadir las referencias para hacer que la conexión funcione. Esto significa que si usted añade la referencia del nodo de una persona por su lado, pero la otra persona no añade su referencia por el otro lado, la conexión **no funciona**.
zh_cn: 请记得您和您的好友必须都互相添加了对方的节点信息，你们才能互相连接。也就是说，如果您添加了某位好友的节点信息，但是他并没有添加您的节点信息，你们俩是**连不上的**。

source: ### Darknet peers When you have a number of connections, you can visit the Darknet page. It should look something like this: ![](assets/img/Freenet-darknet_peers.png) There are a number of status messages that can be seen here: * CONNECTED - the node is connected and ready to take your request * BACKED OFF - the node is choked with traffic and unable to respond * DISCONNECTED - the node is not connected to your node, and probably turned off * NEVER CONNECTED - the connection between the nodes has not been established. This can be because of firewall problems/restrictions, one side not adding the other sides node reference or that the nodes have not been online at the same time yet in order to confirm the connection. If the problem persists over a long time and both sides have added each other, try to redo the connection. In the Idle column, you can see how much time has passed since the last status message.
es: ### Pares de la Darknet Cuando tenga varias conexiones, puede visitar la página de la Darknet. Debería tener un aspecto parecido a este: ![](assets/img/Freenet-darknet_peers.png) Hay varios mensajes de estado que se pueden ver aquí: * CONECTADO - el nodo está conectado y listo para ocuparse de su petición * DESASISTIDO - el nodo está saturado de tráfico y no puede responder * DESCONECTADO - el nodo no está conectado al suyo, y probablemente está apagado * NUNCA CONECTADO - la conexión entre los nodos no se ha establecido. Esto puede ser a causa de problemas/restricciones del cortafuegos (firewall), de que una de las partes no añada las referencias del nodo de la otra parte, o de que los nodos aún no hayan estado en línea al mismo tiempo para confirmar la conexión. Si el problema persiste durante un largo periodo y ambas partes se han añadido entre si, pruebe a volver a establecer la conexión. En la columna Desocupado, puede ver cuánto tiempo ha pasado desde el último mensaje de estado.

source: Content
es: Contenido
zh_cn: 内容

source: In addition to its anonymity features, as a content distribution network Freenet has the following strengths: * **Totally decentralized** Information can be inserted into Freenet for download without any reliance on a centralized server. All the inserter needs to do is give the content's "key" to someone else and they will be able to download it. * **Adaptive caching** Many CDN architectures only allow peers which have already downloaded a file to share it with other peers. Freenet will adaptively cache information on peers as necessary to meet demand regardless of what that peer has downloaded. This allows Freenet to "scale-up" much more quickly than most solutions for popular files, and improves load-balancing. * **Strong Security** Freenet has long-supported the concept of "Content Hash Keys" which guarantee the integrity of retrieved data. This approach has since been adopted by other architectures. Freenet also supports "Signed Subspace Keys" which allow content to be digitally signed. This also allows content integrity to be guaranteed, but is more flexible than CHKs. * **Forward Error Correction** In common with some other CDN architectures, Freenet employs "Forward Error Correction", which allows a file to be reconstructed even if some of the parts of that file can't be retrieved. Uniquely, Freenet also supports "healing", which involves the reconstruction and reinsertion of missing file components. This page contains links to freely available content on Freenet. If you would like to add a new link please email it to [us]( https://emu.freenetproject.org/cgi-bin/mailman/listinfo/support) - remember that we will only link to content that can be legally distributed in the United States of America.
es: Además de sus características de anonimato, Freenet tiene las siguientes fortalezas como red de distribución de contenidos: * **Totalmente descentralizado** La información puede insertarse en Freenet para ser descargada sin confiar en un servidor centralizado. Todo lo que el insertador necesita hacer es dar la "clave" del contenido a otra persona y esta podrá descargarlo. * **Guardado en caché adaptativo** Muchas arquitecturas CDN sólo permiten compartir un fichero con otros pares (peers) a los pares que ya hayan descargado el fichero. Freenet guardará adaptativamente en caché información sobre pares en lo necesario para cubrir la demanda al margen de lo que ese par haya descargado. Esto permite a Freenet "escalar" mucho más rápidamente que la mayoría de las soluciones para ficheros populares, y mejora el equilibrado-de-carga. * **Seguridad robusta** Freenet ha dado soporte durante mucho tiempo al concepto de "Content Hash Keys" (CHKs, claves hash de contenidos) que garantizan la integridad de los datos descargados. Esta aproximación ha sido adoptada desde entonces por otras arquitecturas. Freenet también soporta "Signed Subspace Keys" (SSK, claves de subespacio firmadas) que permiten que se firme digitalmente el contenido. Estas también permiten garantizar la integridad del contenido, pero son más flexibles que las CHKs. * **Corrección de errores hacia delante** En común con algunas otras arquitecturas CDN (red de distribución de contenidos), Freenet emplea "Forward Error Correction" (corrección de errores hacia delante), que permite que los ficheros sean reconstruidos incluso si alguna de las partes del fichero no se puede descargar. Singularmente, Freenet también soporta "sanación", lo que implica la reconstrucción y reinserción de componentes del fichero ausentes. Esta página contiene enlaces a contenido disponible libremente en Freenet. Si desea añadir un nuevo enlace, por favor, escríbanos un correo electrónico (https://emu.freenetproject.org/cgi-bin/mailman/listinfo/support) - recuerde que sólo enlazaremos a contenido que se pueda distribuir legalmente en los Estados Unidos de América.

source: Understand
es: Comprender
zh_cn: 原理

source: Freenet can be thought of as a large storage device. When you store a file in it, you receive a key which can be used to retrieve the file. When you supply Freenet with a key, it returns the appropriate file (if it is located). The storage space is distributed among all connected nodes on Freenet. Freenet is a peer-to-peer network which is both decentralized and anonymized. The nodes that you connect to only know their nearest neighbours and have no idea about how the network as a whole is structured.
es: Se puede pensar en Freenet como en un gran dispositivo de almacenamiento. Cuando guarda un fichero en él, recibe una clave que se puede usar para descargar el fichero. Cuando proporciona a Freenet una de estas claves devuelve el fichero asociado (si se localiza). El espacio de almacenamiento está distribuido entre todos los nodos conectados en Freenet. Freenet es una red entre pares (P2P) que es tanto descentralizada como anonimizada. Los nodos a los que se conecta sólo conocen a sus vecinos más cercanos y no tienen ni idea acerca de cómo se estructura la red en conjunto.

source: ### Small world network Freenet is built on the principle of small world networks. By connecting to nodes of people you already know, and the people you know in turn connect to people they know, one should be able to reach all nodes in a Freenet network.
es: ### Red de mundo pequeño Freenet se erige sobre el principio de redes de mundo pequeño (small world networks). Al conectarse a nodos de personas que ya conoce, y a su vez las personas que conoce conectarse a gente que ellos conocen, uno debería poder alcanzar todos los nodos en una red Freenet.
zh_cn: ### 小世界网络 Freenet 基于“小世界网络”的理论构建。您只连接到自己认识的人的节点，而其他人也只连接到自己认识的人的节点，那么所有人都可以访问所有节点的数据。

source: ### The datastore All Freenet nodes contribute a part of their hard drive space to store encrypted pieces of files. They are stored in the **datastore** directory in the Freenet installation directory.
es: ### El almacenamiento de datos Todos los nodos Freenet aportan una parte del espacio de sus discos duros para almacenar fragmentos de ficheros. Están almacenados en el directorio **datastore** dentro del directorio de instalación de Freenet.

source: Unlike other peer-to-peer networks, you as a user have little or no control over what is stored in your datastore. Instead, files are kept or deleted depending on how popular they are. This allows Freenet to be censorship-resistant. There is no "delete file" operation.
es: Al contrario que otras redes entre pares (P2P), usted como usuario tiene poco o ningún control sobre lo que se guarda en su almacenamiento de datos. En su lugar, los ficheros se conservan o se borran dependiendo de cómo sean de populares. Esto permite a Freenet ser resistente a la censura. No hay ninguna operación "borrar fichero".

source: It is hard, but not impossible, to determine what the encrypted file pieces stored in your local Freenet datastore are part of. This allows plausible deniability.
es: Es difícil, pero no imposible, determinar el todo del que forman parte los fragmentos de fichero guardados en su almacenamiento de datos (datastore) local de Freenet. Esto permite la denegabilidad plausible.

source: Freenet suggests an initial size based on how much space is available, and you can change the store size at any time. A larger store uses more RAM, but makes for better browsing for you and helps Freenet as a whole.
es: Freenet sugiere un tamaño inicial basado en cuánto espacio hay disponible, y usted puede cambiar el tamaño del almacenamiento en cualquier momento. Un almacenamiento más grande usa más RAM, pero contribuye a una mejor navegación para usted y ayuda al conjunto de Freenet.
zh_cn: 我们建议您根据自己的硬盘可用空间大小合理的设置 Freenet 数据存储的大小。您可以在以后随时更改它。更大的存储需要更多的内存，但是这能够让您更好的浏览 Freenet，同时也为整个 Freenet 作出了贡献。

source: ### Freenet Routing Initially, each node has no information about the performance of the other nodes it knows about. This means that routing of requests is essentially random. But since different nodes have different randomness, they will disagree about where to send a request, given a key. So the data in a newly-started Freenet will be distributed somewhat randomly.
es: ### Enrutamiento de Freenet Inicialmente, cada nodo no tiene información acerca del rendimiento de los demás nodos que conoce. Esto significa que el enrutamiento de peticiones es esencialmente aleatorio. Pero como distintos nodos tienen diferentes aleatoriedades, no estarán de acuerdo acerca de dónde enviar una petición, dada una clave de almacenamiento. Así que los datos en una Freenet que acaba de iniciarse estarán distribuidos aleatoriamente de algún modo.
zh_cn: ### Freenet 路由 起初，每个节点都不了解它所知的其他节点的有关性能的信息。这意味着对请求的路由是随机的。但由于不同的节点都有不同的随机性，有些会拒绝对某个键值的请求。因此新启动的 Freenet 会被随机分布在某个位置。

source: As more documents are inserted by the same node, they will begin to cluster with data items whose keys (see below) are similar, because the same routing rules are used for all of them. More importantly, as data items and requests from different nodes "cross paths", they will begin to share clustering information as well.
es: Según se inserten más documentos en el mismo nodo, comenzarán a formar agrupaciones (clusters) con elementos de datos cuyas claves (vea debajo) sean similares, porque para todos ellos se usan las mismas reglas de enrutamiento. De modo más importante, como los elementos de datos y las peticiones de distintos nodos "entrecruzan sus caminos", comenzarán a compartir a su vez información de agrupamientos.
zh_cn: 随着越来越多的数据被相同的节点插入，键值类似（参见下文）的数据将自动聚合起来，因为同样的路由规则对所有这些数据都是有效的。更重要的是，因为来自不同节点的数据内容和请求跨路径传输，节点便互相开始分享这些聚合信息。

source: The result is that the network will self-organize into a distributed, clustered structure where nodes tend to hold data items that are close together in key space. There will probably be multiple such clusters throughout the network, any given document being replicated numerous times, depending on how much it is used.
es: El resultado es que la red se auto-organizará en una estructura distribuida, en agrupaciones, donde los nodos tienden a retener los elementos de datos que sean estrechamente cercanos en el espacio de claves de almacenamiento. Probablemente habrá múltiples de estos agrupamientos (clusters) por toda la red, con cualquier documento dado siendo replicado numerosas veces, dependiendo de cuánto se use.
zh_cn: 结果是整个网络会自我组织为一个分布式、聚合的结构，节点会趋向于储存键值空间接近的的数据。网络中可能有多个类似的聚合，根据数据的使用频率，数据会被重复储存多次。

source: ### Freenet keys Each file that exists on Freenet has a key associated with it. Freenet 0.7 has various types of keys. Keys are used for everything on Freenet, and are a kind of [URI](https://en.wikipedia.org/wiki/Uniform_Resource_Identifier) ( e.g. freenet:=KSK@sample.txt).
es: ### Claves Freenet Cada fichero existente en Freenet tiene una clave de Freenet asociada a él. Freenet 0.7 tiene varios tipos de claves. Las claves Freenet se usan para todo en Freenet, y son un tipo de [URI](https://es.wikipedia.org/wiki/Identificador_de_recursos_uniforme) (ej. freenet:=KSK@sample.txt).

source: Most keys are hashes: there is no notion of semantic closeness when speaking of key closeness. Therefore there will be no correlation between key closeness and similar popularity of data as there might be if keys did exhibit some semantic meaning, thus avoiding bottlenecks caused by popular subjects.
es: La mayoría de las claves son identificadores criptográficos (hashes): No hay noción de cercanía semántica cuando se habla de similaridad de clave. Por tanto no habrá correlación entre similaridad de clave y una popularidad semejante de los datos como podría haber si las claves hubieran exhibido algún significado semántico, evitando por tanto cuellos de botella causados por asuntos populares.
zh_cn: 大部分的键值都是哈希值：我们在说键值比较接近，不是指它们在人可以看懂的那一部分比较接近。即使两个键值人能看懂的部分是一致的，键值接近和数据流行的相似程度间也没有直接的关系。两个语义相同的键值可以是不同的内容。这就避免了某个流行话题的相关数据太多，键值不够用的情况。

source: ### Accessing data To access a particular piece of data on Freenet, you can use FProxy. You need to know the key to the data, and enter it like this (or click a link containing the key): <pre> http://localhost:8888/[Freenet Key]</pre> There are four types of keys in Freenet: * **CHK** - Content Hash Keys * **SSK** - Signed Subspace Keys * **USK** - Updatable Subspace Keys * **KSK** - Keyword Signed Keys
es: ### Acceder a los datos Para acceder a una pieza de datos concreta en Freenet, puede usar FProxy. Necesita saber la clave para los datos, e introducirla del siguiente modo (o hacer clic en un enlace que contenga la clave): <pre> http://localhost:8888/[Clave Freenet]</pre> Hay cuatro tipos de claves en Freenet: * **CHK** - Content Hash Keys (claves hash de contenidos) * **SSK** - Signed Subspace Keys (claves de subespacio firmadas) * **USK** - Updateable Subspace Keys (claves de subespacio actualizables) * **KSK** - Keyword Signed Keys (claves firmadas con contraseña)

source: CHKs are the most fundamental. All files over 1kB are ultimately divided into one or more 32kB CHKs. CHKs' filenames are determined only by their contents. SSKs are the other basic type. These combine a public key with a human-readable filename and therefore allow for freesites. KSKs are a variant of SSKs where everything is determined by a simple human readable filename ( e.g. =KSK@sample.txt). These are spammable but convenient in some cases. And USKs are a form of updatable keys especially useful for freesites and **Address Resolution Keys**.
es: Las CHKs son las más fundamentales. Todos los ficheros de más de 1KB en último término se dividen en uno o más CHKs de 32KB. Los nombres de fichero de los CHKs sólo se determinan por sus contenidos. Las SSKs son el otro tipo básico. Estas combinan una clave pública con un nombre de fichero legible por humanos y por tanto permiten establecer freesites. Las KSKs son una variante de las SSKs donde todo se determina por un simple nombre de fichero legible por humanos (ej: KSK@sample.txt). Pueden ser utilizadas para spam, pero son convenientes en algunos casos. Y las USKs son una forma de claves actualizables especialmente útiles para freesites y **Address Resolution Keys** (ARKs, claves de resolución de direcciones).
zh_cn: CHK 是最基础的。所有超过 1kB 的文件最终都会分割到一或多个 32kB 的 CHK 中。CHK 的文件名只根据它们的内容决定。SSK 是另外一种基本类型。它们是由一个公钥和一个人可读的文件名组合起来的，因此支持 Freesite 网站。KSK 是 SSK 的变种，其键值仅根据人可读的文件名（例如 =KSK@sample.txt）来决定。KSK 容易被垃圾信息骚扰，但是在某些情况下会比较方便。USK 是可更新的键值，对 Freesite 和**地址解析键值**（Address Resolution Key）特别有用。

source: An Address Resolution Key (ARK) is an Updatable Subspace Key (USK) inserted by the node whenever its IP address changes. It contains the reference for the node - its cryptographic details, and in particular its IP address(es). ARKs are a way to help people connect to Freenet if they have problems caused by firewalls, routers or changing IP addresses. If someone cannot accept incoming traffic it can make it difficult to connect. ARKs are an implementation detail and you don't need to know anything about them to use Freenet.
es: Una Address Resolution Key (ARK, clave de resolución de direcciones) es una Updateable Subspace Key (USK, clave de subespacio actualizable) insertada por el nodo en el momento en que su dirección IP cambia. Contiene la referencia para el nodo - sus detalles criptográficos, y en particular su(s) dirección(es) IP. Las ARKs son una forma de ayudar a la gente a conectar a Freenet si tienen problemas causados por cortafuegos (firewalls), routers, o direcciones IP cambiantes. Si alguien no puede aceptar el tráfico entrante, conectar puede hacerse difícil. Las ARKs son un detalle de implementación y no necesita conocer nada sobre ellas para usar Freenet.
