Repository: hyphanet/website
Catalog: locale/*/LC_MESSAGES/freenet_site.po
Languages: es, zh_cn

source: ### Content Hash Keys Content Hash Keys are for files with static content, like an .mp3 or a PDF-document. These keys are hashes of the content of the file. A hash is a reproducible method of turning a specific piece of data into a relatively small number that serve as a sort of *fingerprint* for the data. If the file content changes, even ever so little, the hash of the file changes radically. This makes the data hard to tamper with without anyone noticing. A CHK uniquely identifies a file, it should not be possible for two files with different content to have the same CHK. The CHK consists of three parts: 1. the hash for the file 2. the decryption key that unlocks the file, and 3. the cryptographic settings used
es: ### Content Hash Keys Las Content Hash Keys (CHKs, claves hash de contenidos) son para ficheros con contenido estático, como un .mp3 o un documento-PDF. Estas claves son hashes del contenido del fichero. Un hash es un método reproducible de convertir una pieza de datos específica en un número relativamente pequeño que sirve a modo de *huella dactilar* para los datos. Si el contenido del fichero cambia, incluso en lo más mínimo, el hash del fichero cambia radicalmente. Esto hace que sea difícil manipular los datos sin que nadie lo note. Un CHK identifica de forma única un fichero, no debe ser posible para dos ficheros con distinto contenido tener el mismo CHK. El CHK consiste en tres partes: 1. el identificador criptográfico (hash) del fichero 2. la clave de descifrado que desbloquea el fichero, y 3. las configuraciones criptográficas usadas
zh_cn: ### 内容哈希键值（Content Hash Keys，CHK） 内容哈希键值（CHK）可以用在静态内容文件上，比如 .mp3 或 PDF 文档。键值是文件内容的哈希值。 哈希值是将特定的数据根据一定的算法计算出来的相对较短的“指纹”，同一数据每次生成的哈希值一定是相同的。如果文件内容改变，即使只是改变了一点点，文件的哈希值也会变化。这样如果数据被篡改，人们就会注意到。一个 CHK 键值指向一个唯一的文件。两个不同内容的文件不可能有相同的 CHK。CHK 由 3 部分组成： 1. 文件的哈希值， 2. 用于解锁文件的解密密钥， 3. 文件的加密方式。

source: A typical CHK key looks like this: CHK@file hash,decryption key,crypto settings or for example: CHK@SVbD9~HM5nzf3AX4yFCBc-A4dhNUF5DPJZLL5NX5Brs,bA7qLNJR7IXRKn6uS5PAySjIM6azPFvK~18kSi6bbNQ,AAEA--8 The decryption key is part of the key for the file, and is not included in requests for the file's pieces. It is thus not possible to decrypt the file without the CHK key. To access the file, the whole key must be pasted behind the FProxy address (cut to fit screen): http://localhost:8888/CHK@SVbD9~[..]X5Brs,bA7qLN[..]Si6bbNQ,AAEA--8
es: Una clave Freenet CHK típica tiene este aspecto: CHK@hash-del-fichero,clave-de-descifrado,configuraciones-de-criptografía o, por ejemplo: CHK@SVbD9~HM5nzf3AX4yFCBc-A4dhNUF5DPJZLL5NX5Brs,bA7qLNJR7IXRKn6uS5PAySjIM6azPFvK~18kSi6bbNQ,AAEA--8 La clave de descifrado forma parte de la clave Freenet para el fichero, y no se incluye en las peticiones de fragmentos del fichero. Por tanto, no es posible descifrar el fichero del ejemplo sin la clave Freenet CHK. Para acceder al fichero, se debe pegar la clave Freenet completa tras la dirección de FProxy (aquí recortada para ajustarla a la pantalla): http://localhost:8888/CHK@SVbD9~[..]X5Brs,bA7qLN[..]Si6bbNQ,AAEA--8

source: ### Signed Subspace Keys Signed Subspace Keys are usually for sites that are going to change over time. For example, a website that may need news to be updated or information to be corrected, added or deleted. They work in such a way that someone else can't put up a newer version of your site and pretend it was you who did it. It works by using public-key cryptography so you can sign your site. Only the person with the secret key can add updated versions of your site to Freenet.
es: ### Signed Subspace Keys Las Signed Subspace Keys (SSKs, claves de subespacio firmadas) normalmente son para sitios que van a cambiar con el tiempo. Por ejemplo, un sitio web que puede necesitar que se actualicen las noticias o que se corrija, añada, o borre información. Funcionan de modo que cualquier otra persona que colocase una nueva versión de su sitio web no pueda pretender que fue usted quien lo hizo. Funciona usando criptografía de clave-pública de forma que puede firmar su sitio web. Sólo la persona en posesión de la clave secreta puede añadir versiones actualizadas de su sitio web a Freenet.
zh_cn: ### 已签名子空间键值（Signed Subspace Keys，SSK） 已签名子空间键值（SSK）通常用在经常更新的网站上。网站一般需要更新新闻，添加、删除或修正内容。SSK 的作用就是让除了网站拥有者外的其他人无法自己做一个新版本，然后冒充是网站拥有者做的。 它使用公钥加密方式，因此您可以为自己的网站签名。只有拥有密钥的人才能在 Freenet 上更新网站。

source: Also the SSK consists of five parts: * **public key hash** - This part is all that is required to uniquely identify the file (but not decrypt it), so nodes need only store this bit. The actual public key is stored (unencrypted) with the (encrypted) data. * **document decryption key** - This is only known to clients and not to the nodes storing the data, so nodes cannot decrypt the data they store without the full address. * **crypto settings** - Cryptographic algorithm used, etc. * **user selected name** - a word or sentence chosen by the site author. * **version** - the current version of the site. The version number is increased each time a new version of the site is created and inserted into Freenet. This approach is used since it is not currently possible to update already inserted data in Freenet. Updateable Subspace Keys makes this more transparent to the user, see below. A typical SSK key looks like this: SSK@public key hash,decryption key,crypto settings/user selected name-version For example (cut for screen purposes): SSK@GB3wuHmt[..]o-eHK35w,c63EzO7u[..]3YDduXDs,AQABAAE/mysite-4
es: Además la SSK consta de cinco partes: * **hash de clave pública** - Esta parte es todo lo que se requiere para identificar de forma única el fichero (pero no descifrarlo), así que los nodos sólo necesitan almacenar este pedacito. La clave pública actual se almacena (sin cifrar) con los datos (cifrados). * **clave de descifrado de documento** - Esta sólo es conocida por los clientes y no por los nodos que almacenan los datos, así que los nodos no pueden descifrar los datos que almacenan sin la dirección completa. * **configuraciones de criptografía** - El algoritmo criptográfico usado, etc. * **nombre seleccionado por el usuario** - una palabra o frase elegida por el autor del sitio. * **versión** - la versión actual del sitio. El número de versión se incrementa cada vez que se crea e inserta en Freenet una nueva versión del sitio. Esta aproximación se usa ya que actualmente no es posible actualizar datos ya insertados en Freenet. Las claves de subespacio actualizables (USKs) hacen que esto sea más transparente para el usuario, vea debajo. Una clave SSK típica se parece a esto: SSK@hash_de_clave_pública,clave_de_descifrado,configuraciones_de_criptografía/nombre_seleccionado_por_usuario-versión Por ejemplo (cortada para ajustar a la pantalla): SSK@GB3wuHmt[..]o-eHK35w,c63EzO7u[..]3YDduXDs,AQABAAE/mysite-4
zh_cn: SSK 由 5 部分组成： * **公钥哈希值** - 只需要这一部分，就可以识别一个唯一的文件（但不使用它加密文件），因此节点只需储存这一部分。完整的公钥是（未加密）和（加密的）数据储存在一起的。 * **文档解密密钥** - 只有上传文件的客户端知道此密钥，而储存数据的节点并不知道。因此，如果节点不知道文件的完整网址，它便无法解密数据。 * **加密方式设置** - 使用的加密算法等。 * **用户指定的名称** - 网站作者指定的一个单词或句子。 * **版本** - 网站当前的版本。 每次当新版本的网站被创建并插入到 Freenet 时，版本号便会增加。因为当前无法在 Freenet 上更新已插入的数据，因此我们采用了这种方式。可更新子空间键值（Updateable Subspace Key，USK）让其对用户更加透明。参见下文。 典型的 SSK 键值格式如下： SSK@公钥哈希值,解密密钥,加密方式设置/用户指定的名称-版本 示例（截短以适配页面宽度）: SSK@GB3wuHmt[..]o-eHK35w,c63EzO7u[..]3YDduXDs,AQABAAE/mysite-4

source: ### How Signed Subspace Keys work * The author generates a cryptographic keypair: a **private key** for signing files and a **public key** for verifying the signature. * The author also generates a single **symmetric key** (one that is used for both encrypting and decrypting). * When a file is inserted into Freenet, it is encrypted with the **symmetric key** and signed with the **private key**. The signature is stored with the file. Nodes don't store the **symmetric key**, only the **public key** part of the SSK, as an index to the data. This is so they can plausibly deny knowledge of the data on their node. The SSK is made up of a hash of the public key, and the symmetric key. The hash of the public key acts as the index to the data for searching purposes. Also, the actual public key is stored with the data. This is so that Freenet nodes can verify the signature when the SSK file comes into their node, and also so that clients can verify the signature when retrieving the file. The symmetric key is so that clients can decrypt the file. Signed Subspace Key sites have largely been superseded by Updatable Subspace Key (USK) sites, which are based on SSKs but allow for links that try to always retrieve the most up-to-date version of the site.
es: ### Cómo funcionan las claves de subespacio firmadas (SSKs) * El autor genera un par de claves criptográficas: una **clave privada** para firmar ficheros y una **clave pública** para verificar la firma. * El autor también genera una única **clave simétrica** (una que se usa tanto para cifrar como descifrar). * Cuando se inserta un fichero en Freenet, se cifra con la **clave simétrica** y se firma con la **clave privada**. La firma se almacena con el fichero. Los nodos no almacenan la **clave simétrica**, sólo la **clave pública** parte de la SSK, como un índice hacia los datos. Esto es así para que que los autores pueden negar de forma plausible conocimiento de los datos presentes en sus nodos. La SSK se compone de un hash de la clave pública, y la clave simétrica. El hash de la clave pública actúa como el índice hacia los datos para propósitos de búsqueda. Además, la clave pública actual se almacena con los datos. Esto es así para que los nodos Freenet puedan verificar la firma cuando el fichero SSK llega a su nodos, y también para que los clientes puedan verificar la firma al descargar el fichero. La clave simétrica está para que los clientes puedan descifrar el fichero. Los sitios con clave de subespacio firmada (SSK) han sido ampliamente reemplazados por sitios con clave de subespacio actualizable (USK), que están basados en SSKs pero permiten enlaces que siempre tratan de descargar la versión más actualizada del sitio.
zh_cn: ### 已签名子空间键值（SSK）是如何工作的 * 文件拥有者生成一对加密密钥：**私钥**用来对文件签名，**公钥**用来验证签名。 * 文件拥有者还会生成一个**对称密钥**（同时用于加密和解密）。 * 当某个文件插入到 Freenet 时，它会使用**对称密钥**加密，使用**私钥**签名。签名是和文件一同存储的。节点不储存**对称密钥**，仅储存 SSK 的**公钥**部分，用于索引数据。这样用户可以推脱不知道自己节点到底存储了哪些内容。 SSK 是由公钥的哈希值和对称密钥组成的。公钥的哈希值用于索引数据，方便搜索。真正的公钥是和数据一同储存的。这样当某个 SSK 代表的文件上传到 Freenet 节点时，它可以验证文件的签名。另外当其他节点下载这个文件时，也可以验证其签名。其他节点还使用对称密钥解密文件。 已签名子空间键值（SSK）网站最近已经被可更新子空间键值（USK）网站取代。USK 基于 SSK，但是可以提供可自动更新的网址链接，随时接收最新版本的网站。

source: ### Updateable Subspace Keys Updateable Subspace Keys are useful for linking to the latest version of a Signed Subspace Key (SSK) site. Note that USKs are really just a user-friendly wrapper around SSKs, which hide the process of searching for more recent versions of a site. A typical USK key looks like this: USK@public key hash,decryption key,crypto settings/user selected name/number/ It is almost identical to the Signed Subspace Key, with the exception of the version-number. There are two types of USK addresses: * an USK with a positive number at the end, or * an USK with a negative number at the end.
es: ### Updateable Subspace Keys Las Updateable Subspace Keys (USKs, claves de subespacio actualizables) son útiles para enlazar a la última versión de un sitio con Signed Subspace Key (SSK, clave de subespacio firmado). Observe que las USKs son en realidad sólo un envoltorio amigable en torno a las SSKs, que ocultan el proceso de búsqueda para versiones más recientes de un sitio. Una clave USK típica se parece a esto: USK@hash_de_clave_pública,clave_de_descifrado,configuraciones_de_criptografía/nombre_elegido_por_el_usuario/número/ Es casi identica a la clave de subespacio firmada (SSK), con la excepción del número de versión. Hay dos tipos de direcciones USK: * una USK con un número positivo al final, o * una USK con un número negativo al final.
zh_cn: ### 可更新子空间键值（Updateable Subspace Keys，USK） 可更新子空间键值（USK）用于链接到最新版本的已签名子空间键值（SSK）网站。其实 USK 只是对 SSK 的一个包装，使其更人性化，隐藏了搜索最新版网站的过程。 典型的 USK 键值格式如下： USK@公钥哈希值,解密密钥,加密方式设置/用户指定的名称/版本/ 它和 SSK 的格式基本一致，除了末尾的版本号。USK 地址有两种类型： * USK 末尾的版本号是个正数，或 * USK 末尾的版本号是个负数。

source: The USK with a **positive** number at the end works like this: the Freenet node on your computer keeps a list of versions of USKs that it knows about, without necessarily storing the data as well. This list is built up from previous visits, and also background requests from previous visits to these kind of links. When you visit an USK like the one below, it consults this list for versions of the mysite site of number 5 or greater. If it finds any, it return the latest one. Then, in the background, it searches for **newer** versions that it doesn't yet know about to add to your USK registry for the next time you visit the address. Example (cut for screen purposes): USK@GB3wuHmt[..]o-eHK35w,c63EzO7u[..]3YDduXDs,AQABAAE/mysite/5/
es: La USK que termina con un número **positivo** funciona de este modo: el nodo Freenet en su computadora conserva una lista de versiones de USKs de las que tiene conocimiento, sin necesariamente guardar también los datos. Esta lista se desarrolla en base a visitas previas, además de peticiones en segundo plano de visitas previas a esta clase de enlaces. Cuando visita una USK como la del ejemplo de debajo, consulta esta lista de versiones del sitio 'misitio' de número 5 o mayor. Si encuentra alguno, devuelve el último. Entonces, en segundo plano, busca las versiones **más recientes** de las que aún no tiene conocimiento, para añadirlas a su registro de USKs para la próxima vez que visite la dirección. Ejemplo (recortado para que quepa en pantalla): USK@GB3wuHmt[..]o-eHK35w,c63EzO7u[..]3YDduXDs,AQABAAE/misitio/5/
zh_cn: 末尾版本号是**正数**的 USK 的工作方式如下：您的 Freenet 节点储存了它所知的 USK 的版本号列表，而并不储存所有的数据。该列表在上一次访问该网站的时候被创建，并在后台尝试请求它们。当您访问如下的 USK 网址，它会从列表中查询是否有版本 5 或更高版本的 mysite 网站。如果找到新版本的网站，则直接返回最新版本的网站。然后，在后台，它会继续搜索未知的**更新**的版本并添加到您的 USK 注册表中，以供您下次访问该网址时使用。 示例（截短以适配页面宽度）： USK@GB3wuHmt[..]o-eHK35w,c63EzO7u[..]3YDduXDs,AQABAAE/mysite/5/

source: When you visit a link with a **negative** number at the end, Freenet searches for the version you requested (e.g. **-7**) plus four more (i.e. 7,8,9,10, 11) at the node on your computer and on other nodes. If it finds only version 7, it will return that. If it finds one of the others, it searches for another batch of five versions: 12,13,14,15,16\. It repeats this until there are four consecutive versions it can't find. Then it will return the latest version it has found so far. Example (cut for screen purposes): USK@GB3wuHmt[..]o-eHK35w,c63EzO7u[..]3YDduXDs,AQABAAE/mysite/-7/ The real treat with USKs comes when data is to be inserted into Freenet. But more on that elsewhere.
es: Cuando visita un enlace terminado en un número **negativo**, Freenet busca la versión que pidió (ej. **-7**) más cuatro más (es decir 7,8,9,10,11) en el nodo de su computadora y en otros nodos. Si sólo encuentra la versión 7, devolverá esa. Si encuentra una de las otras, busca el siguiente lote de cinco versiones: 12,13,14,15,16\. Y repite esto hasta que haya cuatro versiones consecutivas que no pueda encontrar. Entonces devolverá la última versión que encontró hasta el momento. Ejemplo (recortada para que quepa en pantalla): USK@GB3wuHmt[..]o-eHK35w,c63EzO7u[..]3YDduXDs,AQABAAE/misitio/-7/ La amenaza real con las USKs viene cuando los datos se van a insertar en Freenet. Pero este problema ocurre cualquier parte.
zh_cn: 当您访问一个末尾为**负数**版本号的 USK 网址时，Freenet 会在您自己的节点以及其他节点搜索您请求的版本号（例如：**-7**），以及往后 4 个版本（也就是：7,8,9,10,11）。如果它只找到了版本 7，那么就直接返回它。如果它找到了另外四个版本中的任何一个，它会继续搜索接下来一批 5 个版本：12,13,14,15,16。它会继续搜索，直到最后连续 4 个版本都无法找到。然后它会返回找到的最新版本。 示例（截短以适配页面宽度）： USK@GB3wuHmt[..]o-eHK35w,c63EzO7u[..]3YDduXDs,AQABAAE/mysite/-7/ 在插入数据到 Freenet 时，USK 最方便。当然它的方便还体现在其他一些地方。

source: ### Keyword Signed Keys Keyword-Signed Keys (KSKs) allow you to save named pages in Freenet. They are not secure against spamming or name hijacking. Several people could each insert a different file to Freenet, all with the same address. However, there is a collision detection, which tries to prevent overwriting of a once-inserted page. A KSK address looks like this: KSK@myfile.txt The drawback to KSKs is that anyone can insert a file with the same name as yours and divert traffic from your file to their own. The advantage is human readable links that can be easily remembered. The KSK description should not contain slashes, just as with other keys ( slashes are used to denote Manifests or Containers). A KSK address can contain a redirection to a CHK address, or it can contain the file itself.
es: ### Keyword Signed Keys Las Keyword-Signed Keys (KSKs, claves firmadas con contraseña) le permiten guardar páginas con nombre en Freenet. No son seguras contra su envío como spam o el secuestro de nombre. Varias personas podrían insertar un fichero diferente cada una en Freenet, todas con la misma dirección. Sin embargo hay detección de colisiones, lo cual trata de evitar la sobrescritura de una página ya insertada. Una dirección KSK se parece a esto: KSK@mifichero.txt El inconveniente de las KSKs es que cualquiera puede insertar un fichero con el mismo nombre que el suyo y derivar tráfico desde su fichero al de él. La ventaja es que son enlaces legibles por humanos que pueden recordarse fácilmente. La descripción de la KSK no debe contener barras oblicuas (/), igual que las demás claves (las barras oblicuas se usan para denotar manifiestos o contenedores). Una dirección KSK puede contener un redireccionamiento a una dirección CHK, o puede contener el propio fichero.
zh_cn: ### 关键词签名键值（Keyword Signed Keys，KSK） 关键词签名键值（KSK）允许您在 Freenet 上保存有名字的网页。它们不是足够安全，无法抵御垃圾信息攻击或名称劫持。几个人可以插入不同的文件到 Freenet，但是都使用相同的网址。但是，Freenet 有冲突侦测机制，会尝试避免覆盖已插入的页面。KSK 地址格式如下： KSK@myfile.txt KSK 的缺点是任何人都可以插入与您相同名称的文件，将您的文件的流量转移给它们。优点是它很容易看懂，人们很容易记下来。 KSK 键值和其他键值一样，不应该包含斜杠（斜杠用来表示 Manifest 或容器）。 KSK 地址可以包含一个重定向，指向一个 CHK 地址。它也可以自己包含文件。

source: ### Containers A container, in general Freenet terms, is a file that contains several other files. In Freenet 0.7, a freesite, or other collection of files, may be bundled together in a ZIP file, which is limited in size to 2MB. Containers have the advantage that when you load one page you load all the files on the freesite, so either it loads in its entirety or it doesn't load at all, and greatly reduce the number of keys required to insert a given freesite. Containers are currently created transparently when inserting a freesite using e.g. jSite.
es: ### Contenedores En términos generales, un contenedor de Freenet es un fichero que contiene varios otros ficheros. En Freenet 0.7 un freesite, u otra colección de ficheros, puede empaquetarse en conjunto en un fichero ZIP, cuyo tamaño está limitado a 2 MB. Los contenedores tienen la ventaja de que al cargar una página cargará todos los ficheros del freesite, así que o bien carga la página por completo o no la carga en absoluto, y además reducen enormemente el número de claves Freenet necesarias para insertar un freesite determinado en Freenet. Los contenedores en la actualidad se crean de forma transparente cuando se inserta un freesite, por ejemplo, usando jSite.

source: ### Manifests A manifest contains metadata over the list of blocks a CHK is divided into and some information about the content-type(MIME), the filenames and other useful information. The main information is whether the CHK-key is a splitfile or not, and whether the manifest is chained or not. You don't need to know much about manifests in order to use Freenet, since it is a part that is handled internally.
es: ### Manifiestos Un manifiesto contiene metadatos acerca de la lista de bloques en que está dividido un CHK, y algo de información acerca del tipo de contenido (MIME), los nombres de ficheros y otra información útil. La información principal es si la clave CHK es un fichero por bloques (splitfile) o no, y si el manifiesto está encadenado o no. No necesita saber mucho acerca de manifiestos para usar Freenet, ya que es una parte que se maneja internamente.
zh_cn: ### Manifest Manifest 包含了 CHK 分块列表的元数据、一些 MIME 内容类型（Content Type）的信息、文件名和其他一些有用的信息。主要的信息是某个 CHK 键值是否为分割文件，Mainfest 是否链接。您不需要对 Mainfest 了解太多，因为它只用在内部处理。

source: Freenet provides the foundation for anonymous email, forums and chat, as well as a replacement for Facebook/Twitter. Setup of these is described in the [Freenet Social Networking Guide](http://freesocial.draketo.de/) which can also be accessed [over Freenet](http://127.0.0.1:8888/USK@t5zaONbYd5DvGNNSokVnDCdrIEytn9U5SSD~pYF0RTE,guWyS9aCMcywU5PFBrKsMiXs7LzwKfQlGSRi17fpffc,AQACAAE/fsng/58/).
es: Freenet proporciona los fundamentos para correo electrónico, foros y chat anónimos, así como un sustitutivo para Facebook/Twitter. La configuración de estos se describe en la [Guía de redes sociales de Freenet](http://freesocial.draketo.de/) a la que también se puede acceder [sobre Freenet](http://127.0.0.1:8888/USK@t5zaONbYd5DvGNNSokVnDCdrIEytn9U5SSD~pYF0RTE,guWyS9aCMcywU5PFBrKsMiXs7LzwKfQlGSRi17fpffc,AQACAAE/fsng/58/).
zh_cn: Freenet 提供了匿名 Email、论坛和聊天工具，也提供了类似 Facebook/Twitter 的社交网络。您可以在《[Freenet 社交网络指南](http://freesocial.draketo.de/)》一文了解到详细的设置方法。此文也可以[在 Freenet 中访问](http://127.0.0.1:8888/USK@t5zaONbYd5DvGNNSokVnDCdrIEytn9U5SSD~pYF0RTE,guWyS9aCMcywU5PFBrKsMiXs7LzwKfQlGSRi17fpffc,AQACAAE/fsng/58/)。

source: jSite is a graphical application that you can use to create, insert and manage your own Freenet sites. It was written in Java by Bombe. You can [download jSite here](https://downloads.freenetproject.org/alpha/jSite/jSite.jar)
es: jSite es una aplicación gráfica que puede usar para crear, insertar y administrar sus propios sitios de Freenet. Fue escrita en Java por Bombe. is a graphical application that you can use to create, insert and manage your own Freenet sites. It was written in Java by Bombe. Puede [descargar jSite aquí](https://downloads.freenetproject.org/alpha/jSite/jSite.jar)
zh_cn: jSite 是一个图形应用程序，它可以帮助你创建、插入和管理自己的 Freenet 网站。它由 Bombe 使用 Java 撰写。 您可以[在这里下载 jSite](https://downloads.freenetproject.org/alpha/jSite/jSite.jar)。

source: ### Starting jSite To start jSite, type the following in a terminal: <pre> java -jar jSite.jar</pre> The first window you see is this: ![](assets/img/jsite/select-project.png) In the pane to the left, already created projects can be selected for updating, deleting or cloning. Since this is the first start, no such projects exist.
es: ### Iniciar jSite Para iniciar jSite, escriba lo siguiente en un terminal: <pre> java -jar jSite.jar</pre> La primera ventana que verá es esta: ![](assets/img/jsite/select-project.png) En el panel de la izquierda, los proyectos ya creados se pueden seleccionar para actualizarlos, eliminarlos o clonarlos. Como este es el primer inicio, no existen tales proyectos.
zh_cn: ### 启动 jSite 要启动 jSite，在终端命令行提示符下输入如下命令： <pre> java -jar jSite.jar</pre> 启动后您看到的第一个窗口如下图： ![](assets/img/jsite/select-project.png) 窗口左侧列出了已经创建的项目，您可以选中它，进行更新、删除或复制操作。因为这是您第一次启动 jSite，还没有项目，所以这里是空的。
