Repository: hyphanet/website
Catalog: locale/*/LC_MESSAGES/freenet_site.po
Languages: es, zh_cn

source: Some academics [have published](http://www.ee.hawaii.edu/~dong/traceback/index.htm) a couple of attacks against Freenet, and they appear to be working on more as part of a project to unmask anonymous Freenet users. Build 1411, which was released on the 3rd of September, makes their main attack largely impractical. Nonetheless, we are working on improvements to both make this attack harder and to solve some of the [other known attacks](https://freenetproject.org/faq.html#attack). You can learn more about the attacks and our solution to them on our chief developer's [personal blog](http://amphibian.dyndns.org/flogmirror/#20120911-security). We welcome all work to understand Freenet's security and expose any problems with it, although we would suggest that next time they might let us know before they make the paper public, as is common practice in the security community. Finally, the long term solution is to build a darknet, a Freenet network where people only connect directly to people they trust. That means, get your friends using Freenet, and then add them as Friends on your node. When enough people use Freenet and form darknet connections, we won't need opennet, and this makes all attacks dramatically harder. We will work on making this easier and faster in the near future, as well as fixing the Pitch Black attack.
es: Algunos académicos [han publicado](http://www.ee.hawaii.edu/~dong/traceback/index.htm) un par de ataques contra Freenet, y parecen estar trabajando en más como parte de un proyecto para desenmascarar usuarios de Freenet anónimos. La (versión) build 1411, que fue publicada el 3 de septiembre de 2015, hace a su principal ataque enormemente impráctico. A pesar de todo, estamos trabajando en mejoras tanto para dificultar el ataque como para solucionar algunos de los [otros ataques conocidos](https://freenetproject.org/faq.html#attack). Puede conocer más sobre estos ataques y nuestra solución para ellos en el [blog personal](http://amphibian.dyndns.org/flogmirror/#20120911-security) de nuestro desarrollador jefe. Damos la bienvenida a todo trabajo para comprender la seguridad de Freenet y exponer cualquier problema con él, aunque sugeriríamos que la próxima vez nos permitiesen conocer el trabajo antes de publicarlo, como es práctica habitual en la comunidad de seguridad. Finalmente, la solución a largo plazo es construir una darknet, una red de Freenet donde las personas sólo conectan directamente con personas en las que confía. Eso significa, lograr que sus amigos usen Freenet, y luego añadirlos como Amigos en su nodo. Cuando suficiente gente use Freenet y forme conexiones de darknet, no necesitaremos la opennet, y esto hace todos los ataques drásticamente más difíciles. Trabajaremos en hacer esto más fácil y más rápido en el futuro cercano, así como solucionar el ataque Pitch Black.

source: 2011-04-13 - Freenet top anti-censorship tool in survey of Chinese users!
es: 2011-04-13 - ¡La herramienta puntera anti-censura Freenet en sondeo de los usuarios Chinos!
zh_cn: 2011-04-13 - Freenet 是中国用户的顶级反审查工具！

source: A [report](http://www.freedomhouse.org/sites/default/files/inline_images/Censorship.pdf) by [Freedom House](http://freedomhouse.org/) surveyed users in Azerbaijan, Burma, [China](http://www.freedomhouse.org/sites/default/files/LOtF_China.pdf) and Iran for their perceptions of and preferred tools for bypassing local government censorship. In China, Freenet was the only anti-censorship tool to achieve 5 stars, and the third most widely used overall.
es: Un [informe](http://www.freedomhouse.org/sites/default/files/inline_images/Censorship.pdf) de [Freedom House](http://freedomhouse.org/) encuestó a usuarios de Azerbayán, Birmania, [China](http://www.freedomhouse.org/sites/default/files/LOtF_China.pdf) e Irán sobre sus percepciones y herramientas preferidas para eludir la censura gubernamental local. En China, Freenet fue la única herramienta anti-censura en alcanzar las 5 estrellas, y fue la tercera más ampliamente usada globalmente.
zh_cn: [Freedom House](https://freedomhouse.org/) 制作了一份[报告](https://www.freedomhouse.org/sites/default/files/inline_images/Censorship.pdf)，其中对阿塞拜疆、缅甸、[中国](https://www.freedomhouse.org/sites/default/files/LOtF_China.pdf)和伊朗用户对绕过当地政府审查的首选工具进行了调查。在中国，Freenet 是唯一的达到5星的反审查工具，并且是第三个被广泛使用的工具。

source: News
es: Noticias
zh_cn: 新闻

source: Title of the Section
es: Título de la sección
zh_cn: 章节标题

source: Markdown text
es: Texto Markdown
zh_cn: Markdown 文本

source: Title
es: Título
zh_cn: 标题

source: Page Title
es: Título de la página
zh_cn: 页面标题

source: ### 1\. A Disclaimer There are many reasons why people get involved in the Freenet Project. Some share the views outlined in this document; some share variations of these views, which are also served by what we are trying to achieve; and some just enjoy the technical challenge. These are the ideas which motivated me to architect the system in the first place, but not necessarily the views that everyone involved in the Freenet project holds.
zh_cn: ### 1\. 免责声明 人们参与 Freenet 项目有很多原因。有些人赞同本文的观点；有些人有着不同的观点，但是这些观点同样支持我们要完成的事业；而另一些人仅热衷于技术方面的挑战。上述想法驱动我最初实现了这个系统，但这些观点不一定是所有 Freenet 项目的参与者认同的。

source: ### 10\. Alternatives to Copyright Fortunately it won't come to this. There are many alternative ways to reward artists. The simplest is voluntary payment. This is an extension of the patronage system which was frequently used to reward artists prior to copyright, where a wealthy person would fund an artist to allow them to create full-time. The Internet permits an interesting extension of this idea, where rather than having just one wealthy patron, you could have hundreds of thousands, contributing small amounts of money over the Internet. We actually practice what we preach in this regard too, on the 15th of March 2001 the Freenet Project started taking donations, and within a week we had collected over $1000\.
zh_cn: ### 10\. 版权的替代品 幸运的是，艺术家不会饿死。现在有很多其他的方式来回报他们。最简单的方式是众筹捐款。这是赞助系统的扩展。赞助现在被频繁用于在版权前给艺术家以回报，具体做法是某个有钱人愿意资助艺术家让他们全心全意创作。互联网扩展了这个想法，不再是某一个人资助大笔资金，而是成百上千人，每人资助少量的资金。 我们自己也开始言行施教，在2001年3月15日，Freenet 项目开始接受捐款，一周内我们收到超过 $1000 美元。

source: **Note:** This is an incomplete list, a large number of people have contributed to the project.
zh_cn: **注意：**这不是一个完整的名单，还有很多人为本项目做出了贡献。

source: ### Oskar Sandberg Oskar was also one of the earliest contributors to the Freenet project, and has made some important theoretical breakthroughs that lead to the beginning of Freenet 0.7, see the papers page.
zh_cn: ### Oskar Sandberg Oskar 也是 Freenet 项目最早的贡献者之一。他实现了理论上的突破，是 Freenet 0.7 的基础。参见论文页面。

source: ### Dave Baker Dave's main contribution has been [Freemail](documentation.html#freemail), his Summer of Code project to build a working email-over-freenet system, as well as some debugging and core work in various places.
zh_cn: ### Dave Baker Dave 的主要贡献是 [Freemail](documentation.html#freemail)。他的 Summer of Code 项目是创建一个 Freenet 中的 Email 系统，同时他也在各个方面完成了调试和核心代码工作。

source: ### David Sowder David (Zothar) has helped the Freenet project as time permits and interest directs, including configuration, statistics and peer management via FCP, the FProxy stats page and Node 2 Node Messages (N2NM/N2NTMs). And **hundreds of others**, who either haven't asked to be added here, who prefer to remain nameless, or who we just haven't got around to thanking. Not to mention thousands of users, testers, and [donors](donate.html#sponsors)!
zh_cn: ### David Sowder David (Zothar) 帮助了 Freenet 很多，包括配置、通过 FCP 的节点管理和统计、FProxy 统计页面以及点对点消息（N2NM/N2NTMs）。 还有**上百人**，没有将自己的名字列在这里。他们要不没有说出自己的名字，要么我们来没来得及感谢。更别提还有上千用户、测试者和[捐助者](donate.html#sponsors)！

source: Open chat
zh_cn: 打开聊天

source: If you already have a contribution in mind you can find the project repositories [on GitHub](https://github.com/freenet/). For a separate list of projects see [here](https://wiki.freenetproject.org/Projects). We're happy to accept either pull requests on GitHub or patches sent under a pseudonym through Freenet forums such as FMS. Feel free to join us on IRC: [#freenet on chat.freenode.net](help.html#irc)
zh_cn: 如果你考虑进行一个贡献，[在 GitHub](https://github.com/freenet/) 上找到我们的本项目的版本库。项目的列表见[这里](https://wiki.freenetproject.org/Projects)。 我们欢迎在 GitHub 上发起 Pull 请求，或者通过例如 FMS 的 Freenet 论坛匿名发送补丁。 欢迎参与 IRC 聊天: [#freenet on chat.freenode.net](help.html#irc)

source: The documentation on Freenet is forever changing, since this is a project in development. However, here under the Documentation menu, you may find usage documents on how to setup Freenet and use the most popular Freenet tools as well as a user driven Wiki and an extensive Frequently Asked Questions department. * [**Install**](#install) Contains detailed instructions on how to install Freenet using the new installer. * [**Connect**](#connect) How to connect to Freenet. * [**Content**](#content) Freenet as a Content Distribution System. * [**Understand**](#understand) Explains the workings of Freenet, and a glossary with the most frequently used terms. * [**Social**](#social) How to setup email, forums and microblogging over Freenet. * [**jSite**](#jsite) jSite is a Freenet website (a.k.a. Freesite) insertion tool. * [**Wiki**](https://wiki.freenetproject.org/) The Freenet Wiki is a user driven space where new features may be described before finding its way into the website. It is a good source of information about all sorts of Freenet related issues.
zh_cn: Freenet 的开发是持续进行的，它的文档也在不断更新。在本页面您可以阅读它的各种文档资源，包括：如何安装设置 Freenet；如何使用最流行的 Freenet 工具；以及如何访问 Freenet 用户贡献的 Wiki 站点和详尽的常见问题解答。 * [**安装**](#install) 详尽的 Freenet 安装指南（使用全新安装程序）。 * [**连接**](#connect) 如何连接到 Freenet。 * [**内容**](#content) 如何使用 Freenet 发布您的内容。 * [**理解**](#understand) 解释 Freenet 是如何工作的，以及对常见属于的解释。 * [**社交**](#social) 如何设置 Freenet 上的 Email、论坛和微博。 * [**jSite**](#jsite) jSite 是 Freenet 网站 (也称为 Freesite) 插入工具。 * [**Wiki**](https://wiki.freenetproject.org/) Freenet Wiki 是用户自发贡献的文档的集散地。一些新功能文档会首先在 Wiki 上出现，然后才会被整理到本站。这里是 Freenet 所有相关问题的信息来源。

source: #### Graphical install **The below is outdated for Windows systems**, for Windows you should use [the Windows installer](assets/jnlp/FreenetInstaller.exe) as described on [the download page](download.html). You can also get the Windows installer from [here](https://downloads.freenetproject.org/latest/FreenetInstaller.exe). For a graphical installation you have to have: * A working Java Runtime Environment, * a downloaded copy of [new_installer_offline.jar](assets/jnlp/freenet_installer.jar) (if this does not work try [here](https://downloads.freenetproject.org/latest/new_installer_offline.jar)) * a working graphical user interface (GUI) You should save the new_installer.jar file somewhere where you can find it again. Your home-directory should be a good place. The next step requires you to know where you stored the file (the path to it), so it is quite important that you do that step thoroughly.
zh_cn: #### 图形界面安装 **下述内容在 Windows 系统下已经过时**。Windows 下您应该使用[Windows 安装程序](assets/jnlp/FreenetInstaller.exe)安装，参见[下载页面](download.html)。您也可以在[这里下载](https://downloads.freenetproject.org/latest/FreenetInstaller.exe) Windows 安装程序。 要进行图形界面安装，您需要有： * 一个可以正常工作的 Java 运行库； * 最新版本的离线安装 jar 文件 [new_installer.jar](assets/jnlp/freenet_installer.jar) （如果前面的链接无法下载，可以试试[这个链接](https://downloads.freenetproject.org/latest/new_installer_offline.jar)） * 一个图形化用户界面（GUI） 您应该将 new_installer.jar 保存到一个可以找到的地方，譬如您的下载目录。下一步您需要找到这个文件（知道其路径），因此这个步骤很重要。

source: It will ask about network security level - "protection from strangers attacking you over the internet". If you choose LOW or NORMAL, Freenet should "just work", connecting in a few minutes. If you choose HIGH or MAXIMUM, Freenet will need you to add Friends before you can use it. These must be people you personally know. Adding people you don't know will not improve security.
zh_cn: 其中有一个问题是关于网络安全级别的 —— ”protection from strangers attacking you over the internet“（对陌生人通过互联网攻击您的保护）。如果您选择“低“或“中”，Freenet 应该“可以工作”了，需要等待数分钟连接到网络。如果您选择“高”或“最高”，您需要添加几个好友才能使用 Freenet。这些好友必须是您真实认识的。添加那些您不认识的人为好友不会提高安全性。

source: *When you have a freshly connected node, you have no data cached in your datastore, and very few connections even if insecure mode is enabled. Requests are sent out in a random fashion. **This makes some (or all) requests time out before retrieving anything.** It takes a couple of days for your Freenet-node to get up to speed, so please don't get discouraged by this.* You should have at least three nodes that are connected to you at all times, ideally at least five to seven. Since some nodes may be unreachable at times, you need to connect to some more nodes to get the expected number. The nodes that are connected directly to you are the only nodes on freenet that might see what kind of traffic that passes through to your Freenet node. But if insecure mode is enabled, any node can find yours; this is the big advantage of **not** enabling insecure mode: you are effectively invisible except to your Friends. In practice most people start off with insecure mode and gradually add Friends, and hopefully turn off insecure mode once they have at least 10 Friends.
zh_cn: *对于一个全新安装的 Freenet，您的数据存储中不会有任何数据，即使非安全模式启用，连接数也会很少。请求是随机发出的。**这会导致某些（或全部）请求在还未获取数据前便超时。**数天后，您的 Freenet 节点的速度才会变得正常，因此请勿沮丧。* 您应当至少保证随时有 3 个节点连接，5 到 7 个连接是更理想的。因为某些节点有时无法连接，您需要添加更多的节点以保证连接数。只有那些直接与您的 Freenet 节点连接的节点才有可能侦测到通过您的节点的数据。但是如果非安全模式启用，任何节点都有可能侦测到。这就是**不启用**非安全模式的最大优点：您可以有效的隐身，只有您的好友知道。实践中很多人始于非安全模式并逐渐添加好友。当他们拥有超过 10 位好友时，关闭非安全模式

source: ![](assets/img/Freenet-architecture-small.png) *Figure 1: Visible Freenet connections* **Node A** in the figure also has a number of nodes connected to it, but they are all (except from your own node) invisible to you. The traffic routing algorithm is therefore only able to direct traffic to one of the few nodes that you know of that it thinks is most able to find what you are looking for. The traffic is encrypted, so it is quite difficult for the nodes that you connect to to see what your Freenet-traffic consists of, but it is far from impossible. It is therefore important that you connect only to people you know. If that is not possible, then at least people you've talked to. There are a number of ways to add peer node references.
zh_cn: ![](assets/img/Freenet-architecture-small.png) *图表 1: 可见的 Freenet 连接* 图表中，一些其他的节点连接到**节点 A**（Node A） ，但是这些节点您都看不到。您只能看到与自己的节点（Your Node）建立连接的节点。流量路由算法因此仅会在与您建立连接的节点中寻找最合适的节点获取数据。 传输的数据是加密的，因此与您连接的那些节点很难了结到您的 Freenet 节点到底获取了哪些数据，但是这并不是完全不可能的。所以您只能连接到您认识的人，这非常重要。如果很难实现，至少与那些您说过话的人建立连接。 有数种方式添加他人的节点信息。

source: ### Fproxy Connecting peer nodes with FProxy can be done in several ways. Common for all these are that they are all done under the **Darknet** menu item or using the [http://127.0.0.1:8888/friends/](http://127.0.0.1:8888/friends/) link. Below is the thing that makes it all happen: ![](assets/img/add_peers.png) As you can see, there are three ways of getting a node reference from someone else: * Pasting it "as is", in the top field, * a URL pointing at the reference, or * a file, containing the reference. [http://dark-code.bulix.org/](http://dark-code.bulix.org/) is a so called **paste-bin**, where you can add your node reference, make sure that the **private** box is checked, and press **Paste**. The paste-bin then returns an URL (e.g. http://dark-code.bulix.org/yuf01h-34676?raw), which can be shared with others. Make sure that you add **?raw** to the link. This makes the link point only to the actual pasted data, with no extra design elements. Your own Freenet reference can be found on the [ http://127.0.0.1:8888/friends/](http://127.0.0.1:8888/friends/) page, under the caption **My reference**. It might look something like this (cut for screen purposes):
zh_cn: ### Fproxy 在 FProxy 中与好友节点建立连接有几种方式。最常见的方式是进入“朋友”菜单或直接访问 [http://127.0.0.1:8888/friends/](http://127.0.0.1:8888/friends/) 链接。然后您就可以找到下面的框添加好友了： ![](assets/img/add_peers.png) 如您所见，有三种方式添加好友的节点信息： * 直接将节点信息粘贴到那个大的输入框， * 输入节点信息的 URL，或， * 上传节点信息文件。 [http://dark-code.bulix.org/](http://dark-code.bulix.org/) 网站被称为 **Paste-bin**，您可以将自己的节点信息复制粘贴到那个网站，选中“**private**”框，然后点击 **Paste** 按钮。 Paste-bin 便会返回一个网址 (如：http://dark-code.bulix.org/yuf01h-34676?raw)，您可以将这个网址分享给自己的好友。请记得在网址后添加 **?raw**。添加后这个网址只会原封不动下载您的节点信息，而不会添加其他信息。 您自己的 Freenet 节点信息可以在 [http://127.0.0.1:8888/friends/](http://127.0.0.1:8888/friends/) 朋友页面中“**我的节点信息**”一栏找到，它看上去如下图（因为页面宽度有限，内容做了裁剪）:

source: ### Darknet peers When you have a number of connections, you can visit the Darknet-page. It should look something like this: ![](assets/img/Freenet-darknet_peers.png) There are a number of status messages that can be seen here: * CONNECTED - the node is connected and ready to take your request * BACKED OFF - the node is choked with traffic and unable to respond * DISCONNECTED - the node is not connected to your node, and probably turned off * NEVER CONNECTED - the connection between the nodes has not been established. This can be because of firewall problems/restrictions, one side not adding the other sides node reference or that the nodes has not been online at the same time yet in order to confirm the connection. If the problem persists over a long time and both sides have added each other, try to redo the connection. In the Idle-column, you can see how much time has passed since the last status message.
zh_cn: ### 暗网节点 当您有了一定数量的好友连接时，您可以在“朋友”页面查看他们的状态。如下图： ![](assets/img/Freenet-darknet_peers.png) 这里可能看到几个状态信息。解释如下： * 已连接 - 节点已经连接，准备好接受您的请求 * 暂不接受 - 节点十分繁忙，无法响应 * 已断开 - 节点当前未连接到您的节点，可能已经关闭 * 从未连接 - 两个节点间的连接从未建立。这可能是因为防火墙的限制或配置问题，或是一方没有添加另一方的节点信息，或是那些节点在当时还未上线来确认连接。如果问题持续了较长时间，尝试重新建立连接。 在“空闲”那列，您可以看到自转换到上一个状态以来，经过了多长时间。

source: In addition to its anonymity features, as a content distribution network Freenet has the following strengths: * **Totally decentralized** Information can be inserted into Freenet for download without any reliance on a centralized server. All the inserter needs to do is give the content's "key" to someone else and they will be able to download it. * **Adaptive caching** Many CDN architectures only allow peers which have already downloaded a file to share it with other peers. Freenet will adaptively cache information on peers as necessary to meet demand regardless of what that peer has downloaded. This allows Freenet to "scale-up" much more quickly than most solutions for popular files, and improves load-balancing. * **Strong Security** Freenet has long-supported the concept of "Content Hash Keys" which guarantee the integrity of retrieved data. This approach has since been adopted by other architectures. Freenet also supports "Signed Subspace Keys" which allow content to be digitally signed. This also allows content integrity to be guaranteed, but is more flexible than CHKs. * **Forward Error Correction** In-common with some other CDN architectures, Freenet employs "Forward Error Correction", which allows files to be reconstructed even if some of the parts of that file can't be retrieved. Uniquely, Freenet also supports "healing", which involves the reconstruction and reinsertion of missing file components. This page contains links to freely available content on Freenet. If you would like to add a new link please email it to [us]( https://emu.freenetproject.org/cgi-bin/mailman/listinfo/support) - remember that we will only link to content that can be legally distributed in the United States of America.
zh_cn: 除了匿名功能外，作为一个分布式内容网络，Freenet 还有如下优点： * **完全去中心化** 内容可以插入到 Freenet 以供他人下载，无需中心服务器。插入后，只需要将内容的“键值”提供给他人，他人便可下载该内容。 * **自适应缓存** 许多 CDN 架构只允许已经下载了某个文件的节点将这个文件共享给其他节点。Freenet 节点则会在需要时自适应缓存数据，无论该节点是否已下载该数据。这个特性让 Freenet 可以比常规解决方案更快的传播流行文件，并改善了负载均衡。 * **强健的安全性** Freenet 很久以前就已支持“内容哈希键值（Content Hash Keys）”，保证了接受到的数据的完整性。此方式后来被其他应用程序和架构借用。Freenet 也支持“已签名子空间键值（Signed Subspace Keys）”，可以对内容数字签名。这种方式也能保证数据的完整性，且比 CHK 更加灵活。 * **前向纠错** 与其他 CDN 架构类似，Freenet 引入了“前向纠错（Forward Error Correction）”机制，这样即使在文件的某些部分无法获取时，文件也可以被正确重建。Freenet 还有一个独特的特性：“恢复（healing）”，在需要时可以重建和自动插入丢失的文件数据。 本页包含了一些 Freenet 上广泛可用的内容。如果您想将连接添加进来，可以[发邮件给我们]( https://emu.freenetproject.org/cgi-bin/mailman/listinfo/support) - 请注意我们仅会添加那些符合美国法律的链接。

source: Freenet can be thought of as a large storage device. When you store a file in it, you receive a key which can be used to retrieve the file. When you supply Freenet with a key, it returns the appropriate file (if it is located). The storage space is distributed among all connected nodes on Freenet. Freenet is a Peer-to-peer network, which is both decentralized and anonymized. The nodes that you connect to only knows its nearest neighbours and has no idea about how the network as a whole is structured.
zh_cn: Freenet 可被认为上一个大型的数据存储设备。当您将文件储存其中时，您会得到一个键值。在您将某个键值提供给 Freenet 时，它会下载键值对应的文件（如果文件存在）。这个存储设备的存储空间分布在所有的 Freenet 节点中。 Freenet 是一个点对点的网络，去中心化且匿名。您连接的节点仅会知道其最近的邻居，对整个网络的组成结构是不知道的。

source: ### The datastore All Freenet nodes contribute with a part of their harddrive space to store files. The files are stored encrypted in the **store**-directory in the Freenet installation directory.
zh_cn: ### 数据存储 所有 Freenet 节点都会贡献自己硬盘的一部分空间来储存文件数据。这些文件是加密储存在 Freenet 安装目录下的 **datastore** 目录中。

source: Unlike other peer-to-peer networks, you as a user have little or no control over what is stored in your datastore. Instead, files are kept or deleted depending on how popular they are. This is to ensure that Freenet is censorship resistant. The only possible way to remove something from Freenet is to not search for it, and hope that everybody else does the same.
zh_cn: 与其他点对点网络不同，作为一个用户，您无法控制储存在您的”数据存储“中的内容。事实上，文件是根据它们的流行程度来自动保留或删除的。这是为了保证 Freenet 无法被审查者删除。要从 Freenet 上删除内容的唯一方法是您不要搜索下载它，同时也寄希望于其他人不搜索下载它。

source: It is hard, but not impossible, to determine which files that are stored in your local Freenet Datastore. This is to enable plausible deniability as to what kind of material that lies on your harddrive in the datastore.
zh_cn: 要了解您的本地 Freenet 数据存储中储存的内容非常困难（但并非不可能）。这样在遇到问题时，您便可以借故不知道自己电脑内储存的是什么内容而进行合理的推诿。

source: ### Freenet keys Each file that exists on Freenet has a key associated with it. Freenet 0.7 has various types of keys. Keys are used for everything on freenet, and are a kind of [URI](https://en.wikipedia.org/wiki/Uniform_Resource_Identifier) ( e.g. freenet:=KSK@sample.txt).
zh_cn: ### Freenet 键值 每个 Freenet 网络中的文件都有一个键值。Freenet 0.7 的键值有数种类型。Freenet 网络的一切都在使用键值，键值是 [URI](https://en.wikipedia.org/wiki/Uniform_Resource_Identifier) ( e.g. freenet:=KSK@sample.txt)（统一资源标识符）的一种。

source: ### Accessing data To access a particular piece of data on Freenet, you can use FProxy. You need to know the key to the data, and enter it like this (or click a link containing the key): <pre> http://localhost:8888/[Freenet Key]</pre> There are four types of keys in Freenet: * **CHK** - Content Hash Keys * **SSK** - Signed Subspace Keys * **USK** - Updateable Subspace Keys * **KSK** - Keyword Signed Keys
zh_cn: ### 访问数据 要访问 Freenet 上的数据，您可以使用 FProxy。您需要知道数据的键值，并使用如下网址访问（或者点击包含该键值的链接）： <pre> http://localhost:8888/[Freenet 键值]</pre> Freenet 中有 4 种不同类型的键值： * **CHK** - 内容哈希键值 * **SSK** - 已签名子空间键值 * **USK** - 可更新子空间键值 * **KSK** - 关键词签名键值

source: An Address Resolution Key (ARK) is an Updateable Subspace Key (USK) inserted by the node whenever its IP address changes. It contains the reference for the node - its cryptographic details, and in particular its IP address(es). ARKs are a way to help people connect to Freenet if they have problems caused by firewalls, routers or changing IP addresses. If someone cannot accept incoming traffic it can make it difficult to connect. ARKs are an implementation detail and you don't need to know anything about them to use Freenet.
zh_cn: 地址解析键值 (ARK) 是一个可更新子空间键值 (USK)。节点在其 IP 地址改变后会自动插入该键值。它包含了节点的信息，包括加密细节和新的 IP 地址。在出现防火墙、路由的问题，或 IP 地址改变时，ARK 可以帮助人们连接到 Freenet。如果某人无法接收他人的传入连接，ARK 能帮得上忙。 ARK 是一个实现的细节，日常使用 Freenet 时您不需要了解它。
