Repository: hyphanet/website
Catalog: locale/*/LC_MESSAGES/freenet_site.po
Languages: es, zh_cn

source: Documents initially made public by the Missouri police department describe their efforts on tracking Freenet usage. Using a simple scheme, they claim a near zero false positive rate for tracking the originator of a download. While we applaud all public documentation on attacks, we have to point out that the claimed effectiveness of their attacks is based solely on flawed mathematics. In reality, the false positive rate of their method is at least 83%, and close to 100% in real world scenarios. The claimed effectiveness of their attack is based on a false assumption about the distribution of the HTL of incoming requests. HTL (Hops to Live) is a number embedded in each request that is usually decremented when the request is forwarded, starting at a value of 18 at the originator of the request, and serves to limit the number of hops a request can survive on the network. As a security precaution, the HTL is decremented probabilistically on the first few hops. In their tracking efforts, the Missouri police department assumes that when multiple requests for pieces of a file arrive from a single node, and all these requests have HTL 18 with no requests at HTL 17 or 16, this node must be the originator of the requests, with a false positive probability decreasing with the number of requests received from the node. This would be true if whether the HTL is decremented is decided per request, which has historically been the case in the early days of Freenet. The vulnerability they claim to exploit was however addressed in 2008 (last touched in [this commit][commithtl18]). Whether the HTL is decremented is since decided per connection, so any probability they claim using the aforementioned method is false. For every connection there is a 50% chance that all the HTL 18 requests (not only a single one, as would be the case with per-request probabilistic decrementing) did not originate from the node from which we received them but were forwarded one step. So for 10 connections (the lowest number of peers Freenet uses), there are on average 5 other nodes whose HTL 18 requests are forwarded with HTL 18, so the probability that a given HTL 18 request originated at the node from which we received it is only about 17% (1 in 6). If the node has more connections (close to 30 is common), this probability is even lower. And this probability does not get higher when gathering more requests of chunks from a specific file or a specific kind of files, because they can reasonably all be forwarded from a different node — the one which really sent them. The heterogenity of the network and routing with second-level connections taken into account does not easily yield robust statistical claims without knowing the peers of peers of the node under investigation. Staying connected for a long time might allow for distinguishing between the changing peers of the node and requests originating at the node itself, but with significant cost. If the node which is tracked has friend-to-friend peers (which unlike automatically added peers do not change regularly), even waiting will not allow finding out with the described method whether HTL 18 requests came from the node itself or from the peers connected over friend-to-friend connections. For details, see [the code][codehtl18]. This does not make it impossible to track Freenet users who use only Opennet mode (connecting to strangers), since a network where nodes connect to strangers is inherently susceptible to Sybil attacks, where nodes of typical users are outnumbered by malicious, colluding nodes. The only way to defend against serious attacks is to *use Freenet in Friend-to-Friend mode*, where the precondition to tracking a user is social engineering to get the people to whom he/she is connected to betray the user. The need to defend against this type of attack is the reason why the core of Freenet was rewritten in 2007 to add this Friend-to-Friend mode (called Darknet mode). However the method used by the Missouri police department is using false statistics: despite its flaws, Freenet's Opennet is much harder to track than they claim. The Freenet developers do not condemn these attacks. Police departments try to use every legal venue to catch criminals. This is their job and vocation, but any attack they find could also be used by oppressive governments to suppress dissenting opinions, so we will work to fix attacks as they come to light. We expect law enforcement to get their math right, especially when using it in court. If they can get a warrant with an 83% false positive rate, that's a problem for lawmakers. If they falsely claim a 0% false positive rate, that's eroding the trust of citizens in the legal system. Additional information on this attack is available from the [mailing list discussion][mlhtl18]. The mission of the Freenet Project is to safeguard freedom of the press by providing censorship resistant communication. This requires protecting people against being targeted for what they write or read. To achieve this, Freenet enables users to publish anonymous websites and offers chat, forums, and file-sharing, as well as confidential communication among friends and methods to leverage the capabilities of Freenet from other tools. When the police spread misinformation about the security of Freenet, it directly undermines our mission by driving users to networks which cannot provide a comparable level of security for whistle-blowers and those wishing to publish anonymously.
es: Documentos hechos públicos inicialmente por el departamento de Policía de Missouri, describen sus esfuerzos por rastrear el uso de Freenet. Usando un esquema simple, afirman tener una tasa de falsos positivos de rastreo del originador de una descarga cercano a cero. Aunque aplaudimos toda documentación pública de los ataques, hemos señalado que la proclamada efectividad de sus ataques se basa únicamente en cálculos erróneos. En realidad, la tasa de falsos positivos de su método es de al menos un 83%, y cercana al 100% en escenarios reales. La proclamada efectividad de su ataque se basa en una suposición falsa acerca de la distribución del valor HTL de las peticiones entrantes. HTL (Hops to Live) es un número incrustado en cada petición que normalmente se reduce cuando la petición se reenvía, comenzando con un valor de 18 en el originador de la petición, y sirve para limitar el número de saltos que una petición puede sobrevivir en la red. Como medida de seguridad, el HTL se reduce de forma probabilística en los primeros saltos. En sus esfuerzos de rastreo, el Departamento de Policía de Missouri asume que cuando múltiples peticiones de fragmentos de un fichero llegan de un único nodo, y todas esas peticiones tiene un HTL de 18 sin peticiones con HTL 17 o 16, este nodo debe ser el originador de las peticiones, con una probabilidad de falsos positivos decreciente con el número de peticiones recibidas desde el nodo. Esto sería cierto si tanto si se reduce como si no el HTL se decide por-petición, lo que históricamente ha sido el caso en los primeros días de Freenet. La vulnerabilidad que afirman explotar ha sido sin embargo resuelta en 2008 (se modificó por última vez en [esta consignación/commit][commithtl18]).Tanto si el valor HTL se reduce como si no, desde entonces se decide por-conexión, así que cualquier probabilidad que proclamen usando el método mencionado anteriormente es falsa. Para cada conexión hay un 50% de posibilidades de que todas las peticiones HTL18 (no tan solo una, como sería el caso con un decremento probabilístico por-petición) no se hayan originado desde el nodo desde el que las recibimos sino que fueron reenviadas un paso. Así que por cada 10 conexiones (el número más bajo de pares (peers) que usa Freenet), hay de media 5 nodos extra cuyas peticiones HTL18 se reenvían de nuevo con HTL18, de forma que la probabilidad de que una petición HTL18 dada se haya originado en el nodo desde el que la recibimos es sólo de en torno al 17% (1 de 6). Si el nodo tiene más conexiones (cerca de 30 es común), esta probabilidad es incluso más baja. Y no se acrecienta al reunir más peticiones de fragmentos de un fichero específico o un tipo específico de ficheros, porque razonablemente todas pueden haber sido reenviadas desde un nodo diferente — aquel que realmente las envió. Teniendo en cuenta la heterogeneidad de la red y el enrutamiento con conexiones de segundo-nivel, no se deducen alegaciones estadísticas robustas sin saber quiénes son los pares (peers) de los pares del nodo bajo investigación. Permanecer conectado durante un largo periodo de tiempo podría permitir distinguir entre los pares cambiantes del nodo y las peticiones con origen en el propio nodo, pero con un coste significativo. Si el nodo que se rastrea tiene pares (peers) amigo-a-amigo (que a diferencia de los pares añadidos automáticamente no cambian con regularidad), con el método descrito, incluso esperando, no permitirán averiguar si las peticiones HTL18 vienen del propio nodo o de nodos de pares conectados sobre conexiones amigo-a-amigo. Para más detalles, vea [el código][codehtl18]. Esto no imposibilita rastrear usuarios de Freenet que usen el modo Opennet puro (conectar con extraños), ya que una red donde los nodos se conectan con extraños es inherentemente susceptible a ataques tipo Sybil, donde los nodos de usuarios típicos están sobrepasados en número por nodos maliciosos, en cooperación. La única forma de defenderse contra ataques graves es *usar Freenet en modo amigo-a-amigo*, donde la condición previa para rastrear a un usuario es la ingeniería social para conseguir que la gente a la que el usuario está conectado le traicione. La necesidad de defenderse contra este tipo de ataques es la razón por la que el corazón de Freenet fue rescrito en 2007 para añadir este modo Amigo-a-Amigo (llamado modo Darknet). Sin embargo, el método usado por el Departamento de Policía de Missouri es usar estadísticas falsas: A pesar de sus defectos, el modo Opennet de Freenet es mucho más difícil de rastrear de lo que ellos afirman. Los desarrolladores de Freenet no condenan estos ataques. Los departamentos de Policía tratan de usar cualquier vía legal para atrapar criminales. Este es su trabajo y vocación, pero cualquier ataque que encuentren también podría ser usado por gobiernos para reprimir opiniones discrepantes, por lo que trabajaremos para evitar estos ataques tan pronto como surjan. Esperamos que las fuerzas de la ley hagan bien sus cálculos, especialmente cuando los usen en un tribunal. Si pueden conseguir una orden judicial con una tasa de falsos positivos del 83%, eso es un problema para los legisladores. Si ellos afirman falazmente tener una tasa de falsos positivos del 0%, eso erosiona la confianza de los ciudadanos en el sistema legal. Hay información adicional sobre este ataque disponible desde la [conversación de la lista de correo][mlhtl18]. La misión del Freenet Project es salvaguardar la libertad de prensa proporcionando comunicaciones resistentes a la censura. Esto requiere proteger a la gente contra su selección como objetivos por lo que escriben o leen. Para lograr esto, Freenet habilita a los usuarios para publicar sitios web anónimos y ofrece chats, foros y compartición de ficheros, así como comunicación confidencial entre amigos, y métodos para elevar las capacidades de Freenet desde otras herramientas. Cuando la Policía difunde desinformación sobre la seguridad de Freenet, socava directamente nuestra misión al dirigir a los usuarios hacia redes que no pueden proporcionar un nivel de seguridad comparable para informantes y aquellos que desean publicar de forma anónima.

source: 2016-05-22 - Freenet build 1473 released
es: 2016-05-22 - Freenet build 1473 ha sido publicada

source: Freenet 0.7.5 build 1473 is now available. This is the first build to require Java 7! It upgrades Bouncy Castle to version 1.54, and adds a Traditional Chinese translation to the Windows installer. Plugin updates: * Add Sharesite - a fork of ShareWiki - as an official plugin. Thanks to ArneBab for getting it ready! It includes an earlier version of TextileJ to avoid license problems, and adds syntax help, external activelink support, and a template with div IDs for easier CSS. * Update Freereader with the ability to configure the site title and subtitle, and fix the translation support. User-facing core change highlights: * Improve MP3 filtering. * Add The Filtered Index to the default bookmark list. * Fix handling of filenames with non-ASCII spaces. * Alphabetize language configuration dropdown. * Add Hungarian translation support. The translation was added previously but not actually available. * Fix dropping low-traffic connections. This helps with simulations. * Optimize FProxy CSS load order, and fix bugs which prevented caching static assets. This improves web interface responsiveness.
es: Freenet 0.7.5 build 1473 ahora está disponible. ¡Esta es la primera versión (build) que requiere Java 7! Actualiza la librería Bouncy Castle a la versión 1.54, y añade una traducción al chino tradicional en el instalador para Windows. Actualizaciones de complementos: * Añade Sharesite - un derivado (fork) de ShareWiki - como complemento oficial. ¡Gracias a ArneBab por prepararlo! Incluye una versión temprana de TextileJ para evitar problemas de licencia, y añade ayuda de sintaxis, soporte externo de activelink (enlaces que se precargan), y una plantilla con identificadores div para facilitar la creación de estilos CSS. * Actualiza Freereader con la capacidad de configurar el título y subtítulo del sitio, y repara el soporte de traducción. Cambios troncales destacados de cara al usuario: * Mejora el filtrado de MP3. * Añade el sitio The Filtered Index (el índice filtrado) a la lista de marcadores predeterminada. * Corrige el manejo de nombres de fichero con espacios no-ASCII. * Ordena alfabéticamente el menú desplegable de configuración de idioma. * Añade soporte de traducción al húngaro. La traducción se añadió con anterioridad pero no está disponible actualmente. * Corrige el descarte de conexiones de bajo tráfico. Esto ayuda con simulaciones. * Optimiza el orden de carga del CSS de FProxy, y corrige fallos que evitaban el almacenamiento en caché de elementos estáticos. Esto mejora la respuesta de la interfaz web.

source: 2016-05-03 - DuckDuckGo donated $25,000
es: 2016-05-03 - DuckDuckGo donó $25,000

source: The Freenet Project is very excited to announce that [DuckDuckGo have donated][ddg_url] $25,000 to our project. This new funding will be used to advance our goal of ensuring true freedom of communication on the Internet. The project has always operated in a democratic manner, and we will use an open process to set priorities for how we allocate this funding, which will incorporate the views of Freenet’s users, developers, and supporters.
es: The Freenet Project está muy emocionado de anunciar que [DuckDuckGo ha donado][ddg_url] 25.000 $ a nuestro proyecto Esta nueva financiación se usará para avanzar en nuestro objetivo de asegurar una verdadera libertad de comunicación en Internet. El proyecto siempre ha operado de manera democrática, y usaremos un proceso abierto para establecer prioridades en cuanto a cómo asignamos esta financiación, que incorporará los puntos de vista de los usuarios, desarrolladores, y entusiastas de Freenet.

source: 2016-04-10 - Freenet testing build 1473-pre1 released
es: 2016-04-10 - La versión de prueba de Freenet build 1473-pre1 ha sido publicada

source: Freenet unstable testing prerelease build 1473-pre1 is now available. It's the first build to require Java 7. Highlights: * Add The Filtered Index to the default bookmark list * Improve MP3 filter stability * Fix binary blob download over FCP * Fix handling of filenames with non-ASCII spaces For more details and information on how to test this release see the [development mailing list thread][devl_thread].
es: La pre-versión de prueba inestable de Freenet build 1473-pre1 está ahora disponible. Esta es la primera versión que requiere Java 7. Destacados: * Añade The Filtered Index (el índice filtrado) a la lista de marcadores predeterminada * Mejora la estabilidad del filtro MP3 * Corrige la descarga de blobs binarios (grandes objetos) sobre FCP (protocolo de cliente de Freenet) * Corrige el manejo de nombres de fichero con espacios no-ASCII Para más detalles e información sobre cómo probar esta versión, vea el [hilo de la lista de correo de desarrollo][devl_thread].

source: 2016-03-19 - Freenet 0.7.5 build 1472 released
es: 2016-03-19 - Freenet 0.7.5 build 1472 publicado

source: This is the last build to support Java 6! The next build will require Java 7 or higher. Nodes running Java 7 or higher and using the official update key will now use a new update key. Nodes on Java 6 remain using the old update key and will not be updated to further builds. Thanks to yadevel for fixing the regression this release was blocking on! This version was initially partially released as build 1471 - it was released on GitHub but not offered from the website or auto-update. Build 1472 fixes a bug which when using Java 6 prevented nodes from starting for the first time. It did not break existing installations. Highlights: - Fix uploads stalling when using MAXIMUM physical security. - Fix lots of "setNativePriority(X) has failed!", which was caused by a serious thread priority problem. This might fix nodes unexpectedly losing peers. - Order alerts within a category by time: if you have lots of messages from darknet peers they will remain nicely sorted. - There is now a [caching layer][caching] which should significantly reduce I/O load. - Update WebOfTrust from build 15 to build 18. [Its][wot16] [changelogs][wot17] [are][wot18] separate, but the changes reduce CPU load. Incremental score recomputation requires roughly 3 percent of the time of full recomputation, and queuing trust lists to disk lowers thread usage. Translations: - Add partial Greek translation. - Update German, Bokmål, Brazilian Portuguese, Simplified Chinese, and Traditional Chinese translations. - Fix Bokmål localization loading. Also: - Remove Gantros Index from the default bookmark list because it stopped updating. - Remove Linkageddon from the default bookmark list because it stopped updating. - New version of UPnP to fix some instability and compatibility problems. Thanks to 007pig we have a [new UPnP plugin][upnp2] in development which supports UPnP2, but it is not yet included. - New version of KeyUtils. WebOfTrust now has an updatable testing version built and maintained by xor. To use it, unload WebOfTrust, then load "WebOfTrust Testing Versions" on the Plugins page. Versions built by xor will not work with Java 6. Sites can set favicons with `<link rel="icon" type=... href=...>`. (`type` could be `"image/x-icon"`) Extensive review and improvement of English source strings and French and Spanish translations. Tests for and fixes of value substitution in translations. Thanks Vaughan Woodzell! The default theme is now sky-static instead of clean-dropdown. This looks less outdated, though not modern. Fix default bookmarks missing the "software" category since build 1470. If you don't see this category please re-add the default bookmark set from the bookmark editing page. IpToCountry database is updated. (This allows providing the country flags on the peers pages. It is local to each instance and does not contact an external service.) Add partial CSS3 support, including viewport lengths. Thanks, Ben Green!
es: ¡Esta es la última versión (build) que soporta Java 6! La próxima requerirá Java 7 o superior. Los nodos que ejecuten Java 7 o superior y usen la clave Freenet de actualización oficial, ahora usarán una nueva clave Freenet de actualización. Los nodos sobre Java 6 continuarán usando la antigua clave Freenet de actualización y no serán actualizados a versiones posteriores. ¡Gracias a yadevel por corregir la regresión sobre la que se estaba bloqueando esta versión! Esta versión al principio fue parcialmente publicada como build 1471 - se publico en GitHub pero no se ofrecio desde el sitio web de Freenet o el sistema de auto-actualización. La build 1472 corrige un fallo por el que al usar Java 6 se evitaba que los nodos se iniciaran por primera vez. No estropeaba instalaciones existentes. Destacados: - Corrige subidas que encallaban al usar el nivel de seguridad física MÁXIMO. - Corrige muchos fallos "¡setNativePriority(X) ha fallado!", que estaban causados por un grave problema de prioridad del hilo (subproceso). Esto podría corregir el problema de los nodos que pierden pares (peers) de forma inesperada. - Ordena por tiempo las alertas dentro de una categoría: Si tiene muchos mensajes de pares de la darknet permanecerán convenientemente ordenados. - Ahora hay una [capa de caché][caching] que debería reducir significativamente la carga de E/S. - Actualiza WebOfTrust desde la build 15 a la build 18. [Sus][wot16] [registros de cambios][wot17] [están][wot18] separados, pero los cambios reducen la carga de la CPU. El recalculado incremental de la puntuación apenas requiere el 3 por ciento del tiempo que ocuparía el recalculado completo, y formar las colas de listas de confianza en el disco reduce el uso de hilos. Traducciones: - Añade una traducción parcial al griego. - Actualiza las traducciones al alemán, noruego bokmål, portugués de Brasil, chino simplificado, y chino tradicional. - Repara la carga de la localización noruego bokmål. Además: - Elimina el índice Gantros de la lista de marcadores predeterminada a causa de que dejó de actualizarse. - Elimina Linkageddon de la lista de marcadores predeterminada a causa de que dejó de actualizarse. - Nueva versión de UPnP para corregir algunos problemas de inestabilidad y compatibilidad. Gracias a 007pig tenemos un [nuevo complemento UPnP][upnp2] en desarrollo que soporta UPnP2, pero aún no está incluido. - Nueva versión de KeyUtils. WebOfTrust ahora tiene una versión de prueba actualizable compilada y mantenida por xor (desarrollador). Para usarla, cierre WebOfTrust, y luego cargue las "Versiones de prueba de WebOfTrust" en la página de Complementos. Las versiones compiladas por xor no funcionarán con Java 6. Los sitios pueden establecer favicons con `<link rel="icon" type=... href=...>`. (el tipo `type` podría ser `"image/x-icon"`) Revisión y mejora extensiva de las cadenas de texto fuente en inglés, y las traducciones al francés y español. Pruebas y correcciones de sustitución de valores en traducciones. ¡Gracias a Vaughan Woodzell! El tema decorativo principal ahora es sky-static en lugar de clean-dropdown. Este tiene un aspecto menos anticuado aunque no moderno. Corrige los marcadores predeterminados carentes de la categoría "software" desde la build 1470. Si no ve esta categoría, por favor, vuelva a añadir el juego de marcadores predeterminado desde la página de edición de marcadores. La base de datos IpToCountry se ha actualizado. (Esto permite proporcionar las banderas de los países en las páginas de los pares (peers). Es una consulta local para cada instancia y no contacta con ningún servicio externo). Añade soporte parcial para CSS3, incluyendo los tamaños viewport (vano útil de ventana). ¡Gracias, Ben Green!

source: 2016-01-03 - Testing release build 1471-pre3
es: 2016-01-03 - Probando la versión build 1471-pre3
zh_cn: 2016-01-03 - 测试版本 1471-pre3 已发布
