Repository: hyphanet/website
Catalog: locale/*/LC_MESSAGES/freenet_site.po
Languages: es, zh_cn

source: ([try this if the first link is blocked](https://downloads.freenetproject.org/latest/FreenetInstaller.exe)) ([gpg signature][url_gpg_sig]; [keyring][url_keyring]) It will automatically install Freenet and other required components for you. When done, your default browser will automatically open up to Freenet's web-based user interface. ![](assets/img/install/1-langselect-windows.png) Freenet requires Windows XP or later.
es: ([pruebe este si el primer enlace está bloqueado](https://downloads.freenetproject.org/latest/FreenetInstaller.exe)) ([firma GPG][url_gpg_sig]; [juego de claves][url_keyring]) Instalará Freenet y otros componentes requeridos automáticamente para usted. Cuando acabe, su navegador predeterminado abrirá automáticamente la interfaz de usuario web de Freenet. ![](assets/img/install/1-langselect-windows.png) Freenet requiere Windows XP o posterior.

source: ### OS X Download and run [the installer][url_mac_installer] ([gpg signature][url_gpg_sig]; [keyring][url_keyring]).
es: ### OS X Descargue y ejecute [el instalador][url_mac_installer] ([firma GPG][url_gpg_sig]; [juego de claves][url_keyring]).

source: Download Freenet for OSX
es: Descargar Freenet para OSX

source: It will automatically install Freenet and other required components for you. When done, your default browser will automatically open up to Freenet's web-based user interface. ![](assets/img/mactray/osx_installer_step2_transparent.png) Freenet requires OS X 10.8 or later.
es: Instalará Freenet y otros componentes requeridos automáticamente para usted. Cuando acabe, su navegador predeterminado abrirá automáticamente la interfaz de usuario web de Freenet. ![](assets/img/mactray/osx_installer_step2_transparent.png) Freenet requiere OS X 10.8 o posterior.

source: ### GNU/Linux & POSIX Try the [Java Web Start installer](assets/jnlp/freenet.jnlp).
es: ### GNU/Linux y POSIX Pruebe el [instalador Java Web Start](assets/jnlp/freenet.jnlp).

source: Install Freenet
es: Instalar Freenet

source: Now follow the installer: ![](assets/img/install/1-langselect.png) If it doesn't work: You need to have a recent **Java Runtime Environment** (JRE). We have experienced best results with Oracle's Java Runtime Environment which can be obtained via your [package manager]( https://en.wikipedia.org/wiki/Package_manager) or from [ http://www.java.com/](http://www.java.com/). Java version {java_required} or higher is required, and version {java_recommended} or higher is strongly recommended. You should keep Java up to date to avoid problems and for better performance. Open a terminal and run:
es: Ahora siga los pasos del instalador: ![](assets/img/install/1-langselect.png) Si no funciona: Necesita tener un **Java Runtime Environment** (JRE) reciente. Hemos experimentado los mejores resultados con el JRE de Oracle que se puede obtener a través de su [gestor de paquetes](https://es.wikipedia.org/wiki/Sistema_de_gesti%C3%B3n_de_paquetes) o desde [http://www.java.com/](http://www.java.com/). Se requiere Java versión {java_required} o superior, y está firmemente recomendada la versión {java_recommended} o superior. Debe mantener Java actualizado para evitar problemas y tener un mejor rendimiento. Abra un terminal y ejecute:

source: Alternatively, downloading [the installer](assets/jnlp/freenet_installer.jar) ([gpg signature][jar_sig]; [keyring][url_keyring]) and then clicking on the file may work on some systems, but if there are problems we recommend the above command lines. If wget is not installed, it can be installed with a package manager, such as sudo apt-get install wget on Debian or Ubuntu. If the link above is blocked, you could download it from our server [here](https://downloads.freenetproject.org/latest/new_installer_offline.jar). But please use the other link if you can. **Note**: Many GNU/Linux distributions no longer ship with Java Web Start enabled. We would like to make distribution packages for easier installation, and have an in-development (and not maintained) [Debian package]( https://github.com/freenet/debian), but haven't gotten it stable or made official ones for other distributions. If you are a developer and would like to join us and help it would be much appreciated! If this doesn't work on a headless server, try "java -jar new_installer_offline.jar -console", and follow the prompts to tell it where to install Freenet etc.
es: Como alternativa, descargar [el instalador](assets/jnlp/freenet_installer.jar) ([firma gpg][jar_sig]; [juego de claves][url_keyring]) y luego hacer clic en el fichero, puede funcionar en algunos sistemas, pero si hay problemas recomendamos las líneas de comando de arriba. Si wget no está instalado, se puede instalar con un administrador de paquetes, como p.e. sudo apt-get install wget, en Debian o Ubuntu. Si el enlace anterior está bloqueado, podría bajarlo de nuestro servidor [aquí](https://downloads.freenetproject.org/latest/new_installer_offline.jar). Pero, por favor, use el otro enlace si puede. **Nota**: Muchas distribuciones GNU/Linux ya no incluyen Java Web Start habilitado. Deseamos crear paquetes de distribución para una instalación más fácil, y tener un [paquete Debian](https://github.com/freenet/debian) en-desarrollo (no sólo mantenido), pero aún no es estable ni hemos creado paquetes oficiales para otras distribuciones. ¡Si usted es un desarrollador y desea unirse a nosotros y ayudar, sería muy apreciado! Si esto no funciona en un servidor sólo operable por red (headless), pruebe "java -jar new_installer_offline.jar -console", y siga las indicaciones para señalar dónde instalar Freenet, etc.

source: ### Mirrored installation If you have a working Freenet installation directory that you have mirrored from one Unix machine to another (e.g. via rsync or unison), enabling the mirrored installation is not difficult. Nothing in a Freenet installation cares about its host's IP address; it can't, or Freenet would fail on machines that get IP addresses from a DHCP pool. All you actually need to do is tell the system you've mirrored to that it should start the Freenet proxy daemon for you on boot. Do `crontab -l` on the source machine, find the line that is tagged "FREENET AUTOSTART" and add that to your crontab on the mirrored machine. However: each installation has a unique identity key generated at installation time. If you try to run two instances with the same identity _at the same time_, both proxy demons will become confused and upset. Don't do this!
es: ### Instalación replicada Si tiene un directorio de instalación de Freenet funcional que haya replicado desde una máquina Unix a otra (ej. mediante rsync o unison), habilitar la instalación replicada no es difícil. No hay nada en una instalación de Freenet para lo que importe la dirección IP del nodo; no puede ser así, o Freenet fallaría en máquinas que obtienen direcciones IP de un surtido DHCP. Todo lo que necesita en realidad es decirle al sistema hacia el que ha replicado que debe iniciar el demonio de proxy Freenet para usted en el arranque. Haga `crontab -l` en la máquina de origen, busque la línea que está etiquetada "FREENET AUTOSTART" y añada el resultado al crontab en la máquina réplica. Sin embargo: cada instalación tiene una única clave de identidad generada en el momento de la instalación. Si trata de ejecutar dos instancias con la misma identidad _al mismo tiempo_, ambos demonios proxy pasarán a estar confusos y molestos. ¡No haga esto!

source: Using Freenet
es: Uso de Freenet

source: Please try the [step by step guide][url_freesocial] to setting up Freenet and various Freenet apps, especially if installing on OS X. We are not responsible for unofficial third party apps it recommends (including FMS), but many Freenet users and developers use them.
es: Por favor, pruebe la [guía paso a paso][url_freesocial] para instalar Freenet y distintas aplicaciones de Freenet, especialmente si se instala sobre OS X. No somos responsables por las aplicaciones no oficiales de terceros que esta recomienda (incluyendo FMS), pero muchos usuarios y desarrolladores de Freenet las usan.

source: ### Firewalls and routers Freenet should work fine with most routers, but if you are having problems and you have a firewall or router, click [**here**](help.html#firewall) for some info.
es: ### Firewalls y routers Freenet debería funcionar bien con la mayoría de routers, pero si está teniendo problemas y tiene un cortafuegos (firewall) o un router, haga clic [**aquí**](help.html#firewall) para obtener algo de información.
zh_cn: ### 防火墙和路由 Freenet 应该能在大多数路由器后正常工作，但是如果您遇到问题，并且您的节点在防火墙或路由后，[**点击这里**](help.html#firewall)以了解更多信息。

source: ### So it's running, what do I do? When the installer closes, it should open a browser window pointing to the first-time wizard. Here you can configure basic settings, and then start using Freenet. You can access Freenet later on via the system tray menu ( bottom right on the screen), or use the Browse Freenet shortcut on the desktop and/or start menu. If it doesn't work, open [http://127.0.0.1:8888/](http://127.0.0.1:8888/) in your web browser. For best security you should use a separate browser for Freenet, preferably in privacy mode. On Windows, the system tray menu will try to use Chrome in incognito mode if possible. Internet Explorer does not work well with Freenet, Firefox and Opera are widely used. If you know anyone running Freenet, you can improve your security and help to build a robust network by connecting to their node. First, open the [Add a friend page](http://127.0.0.1:8888/addfriend/). You and your friend should each download their "node reference". Send the file to the other person, and add his node reference using the form at the bottom of the page. When both are added, your friend's node should show up on the Friends page, probably as "CONNECTED" or "BUSY". You can set a name for your node on the config page to make it easier to see who it is. Only add nodes run by people **you actually know**, whether online or offline, as adding total strangers harms performance and does not improve security much (they could be the bad guys!).
es: ### Así que está en marcha, ¿qué hago? Cuando se cierre el instalador debería abrir una ventana de navegador apuntando al asistente de primer inicio. Aquí puede configurar las opciones básicas, y luego comenzar a usar Freenet. Puede acceder a Freenet más tarde a través del menú de la bandeja de sistema (en la parte inferior derecha de la pantalla), o usar atajo Navegar por Freenet en el escritorio y/o menú de inicio. Si no funciona, abra [http://127.0.0.1:8888/](http://127.0.0.1:8888/) en su navegador web. Para lograr la mejor seguridad debe usar un navegador aparte para Freenet, preferiblemente en modo privacidad. En Windows, el menú de la bandeja de sistema tratará de usar Chrome en modo incógnito si es posible. Internet Explorer no funciona bien con Freenet, Firefox y Opera son ampliamente usados. Si conoce alguien ejecutando Freenet, puede mejorar su seguridad y ayudar a construir una red robusta al conectarse al nodo de este. Primero, abra la página [Añadir un amigo](http://127.0.0.1:8888/addfriend/). Usted y su amigo deben cada uno descargar su "referencia de nodo". Envíe el fichero a la otra persona, y añada la referencia de nodo de esta usando el formulario de la parte inferior de la página. Cuando ambos estén añadidos, el nodo de su amigo debería mostrarse en la página Amigos, probablemente como "CONECTADO" u "OCUPADO". Puede establecer un nombre para su nodo en la página de configuración para hacer facilitar que se vea de quién se trata. Añada sólo nodos ejecutados por personas a las que **conozca realmente**, tanto en línea como físicamente, ya que añadir a completos extraños daña el rendimiento y no mejora mucho la seguridad (¡podrían ser los chicos malos!).
zh_cn: ### 运行起来了，接下来该做什么？ 安装程序关闭后，会弹出一个新的浏览器窗口，打开初次运行向导页面。以后您可以通过桌面右下角的系统托盘图标，或是桌面/开始菜单中的“浏览 Freenet”快捷方式访问 Freenet。如果这些无法正常工作，您可以在浏览器里访问网址：[http://127.0.0.1:8888/](http://127.0.0.1:8888/)。 为了保证尽可能的安全，您应当单独使用一个浏览器访问 Freenet，最好使用隐私浏览模式。在 Windows 下，系统托盘图标会尝试使用 Chrome 的 Incognito 模式浏览 Freenet。Freenet 在Internet Explorer 下运行不是特别完美，建议使用 Firefox 或谷歌浏览器。 如果您知道其他人也在使用 Freenet，您可以连接他们的节点以提高安全性并有助于建立坚实的网络。首先，打开[添加朋友](http://127.0.0.1:8888/addfriend/)页面。您和您的朋友应该互相添加他们的“节点信息”。将节点信息文本发送给其他人，并使用页面下方的表单添加对方发送给您的节点信息。双方互相添加后，您的好友节点应当显示在好友页面，状态可能为“已连接”或“繁忙”。您可以在配置页面为您的节点设置一个名称，这样其他好友更容易知道您是谁。请只与您确实认识的人互相添加好友，不管他们在线还是离线。添加陌生人为好友会影响性能，而且并不能提高安全性。（他们可能是坏人！）

source: ### So I'm connected, what do I do? Freenet itself includes anonymous websites ("freesites"), filesharing, searching, and more, but you can also use third party applications for chat, filesharing, to help you upload freesites, etc. The [Freenet Social Networking Guide](http://freesocial.draketo.de/) explains how to set up the main third party tools, including email, forums and micro-blogging (Sone, a bit like twitter).
es: ### Así que estoy conectado, ¿qué hago? El propio Freenet incluye sitios web anónimos ("freesites"), compartición de ficheros, búsqueda, y más, pero también puede usar aplicaciones de terceros para chat, compartición de ficheros, ayudarle a subir freesites, etc. La [Guía de redes sociales de Freenet (Freenet Social Networking Guide)](http://freesocial.draketo.de/) explica cómo instalar las principales herramientas de terceros, incluyendo correo electrónico, foros y micro-blogging (Sone, algo parecido a Twitter).
zh_cn: ### 我连上了，接下来该做什么？ Freenet 自带很多匿名网站（Freesites）、文件分享、搜索等资源，但是您也可以使用第三方应用程序来聊天、分享文件、帮助您上传 Freesite 等。 [Freenet 社交网络指南](http://freesocial.draketo.de/)向您介绍了如何配置主要的第三方工具，包括 Email，论坛和微博（Sone，有点像 Twitter）。

source: ### It doesn't work, now what? If you have problems installing or running Freenet, please see the [knowledge base][kb_url], [FAQ][faq_url], [chat][chat_url], or [mailing list][ml_url].
es: ### No funciona, ¿y ahora qué? Si tiene problemas instalando o ejecutando Freenet, por favor, eche un vistazo a la [base de conocimiento (KB)][kb_url], las [preguntas frecuentes (FAQ)][faq_url], el [chat][chat_url], o la [lista de correo][ml_url].

source: ### Hardware requirements Generally a 1GHz processor and 1GB of RAM should be fine. Freenet will run on smaller systems, but it uses at least 128MB of RAM, so unless the system does nothing else it will struggle in less than 512MB. However, the processor is less of a problem, people have been known to run it on 400MHz Pentium 2's or ATOM's, although downloads and browsing would be slow. Freenet will use a portion of your disk for storing data, you can configure this to any size from 100MB upwards, but we recommend at least 1GB. Freenet also uses disk space for your downloads. Freenet's memory usage is approximately 256MB plus 400kB for every 2GB of datastore. On 64-bit Windows, we will install a 32-bit Java Virtual Machine because of limitations of the [Java Service Wrapper]( http://wrapper.tanukisoftware.org/doc/english/download.jsp).
es: ### Requerimientos de hardware Generalmente un procesador de 1 GHz y 1 GB de RAM debería estar bien. Freenet se podrá ejecutar en sistemas más pequeños, pero usa al menos 128 MB de RAM, así que, a menos que el sistema no haga nada más, le costará ejecutarse en menos de 512 MB. Sin embargo, el procesador es un problema menor, se sabe de gente que ha estado ejecutándolo sobre Pentium II o ATOM de 400 MHz, aunque las descargas y la navegación serían lentas. Freenet usará una porción de su disco para almacenar datos, puede configurar esto a cualquier tamaño desde 100 MB en adelante, pero recomendamos al menos de 1 GB. Freenet también usa espacio de disco para sus descargas. El uso de memoria de Freenet es aproximadamente de 256 MB más 400 KB para cada 2 GB de almacenamiento de datos. En Windows de 64 bits, instalaremos una Java Virtual Machine (máquina virtual de Java) de 32 bits a causa de las limitaciones del [Java Service Wrapper (encapsulador como servicio escrito en Java)](http://wrapper.tanukisoftware.com/doc/spanish/download.jsp).
zh_cn: ### 硬件需求 一般来说 1GHz 的处理器和 1GB 内存就足够了。在配置更低的硬件下 Freenet 也能正常运行，但是它至少需要 128MB 内存，因此除非此硬件是专门运行 Freenet 的，否则内存低于 512MB 后整体运行会很卡。但是，处理器的要求就低多了，我们已知有人在 400MHz 的奔腾2 或 ATOM 处理器下成功运行 Freenet，虽然这种情况下下载和浏览会有些慢。 Freenet 会使用一些磁盘空间来储存数据，您可以配置为 100M 以上的空间。但是我们强烈建议您分配至少 1G 空间给 Freenet。如果您从 Freenet 下载文件，这些文件也会占用磁盘空间。Freenet 的内存占用大概为初始 256MB，每 2GB 磁盘空间占用，会多占用 400kB。 在 64 位 Windows 中，我们会安装 32 位的 Java 虚拟机。这是 [Java Service Wrapper]( http://wrapper.tanukisoftware.org/doc/english/download.jsp) 的限制造成的。

source: ### Upgrading Freenet provides an upgrade-over-Freenet mechanism: It will keep itself up to date automatically from other Freenet nodes, and this will normally work even if it is unable to route to them due to them being too new. This is anonymous and secure, and we recommend people use it. However, if something is severely broken, you can upgrade your node manually from our servers: * Windows users can upgrade to the latest-stable Freenet release by running "update.cmd" in the Freenet directory. * OS X, GNU/Linux, or other POSIX users may upgrade by running the update.sh shell script in the Freenet directory.
es: ### Actualizar Freenet proporciona un mecanismo de actualización sobre la propia red Freenet: Se mantendrá a si misma actualizada desde otros nodos Freenet, y esto habitualmente funcionará incluso si no es capaz de enrutarse hacia tales nodos debido a que sean demasiado recientes. Esto es anónimo y seguro, y recomendamos a la gente que lo use. Sin embargo, si hubiera algo gravemente estropeado, puede actualizar su nodo manualmente desde nuestros servidores: * Los usuarios de Windows pueden actualizar a la última versión estable de Freenet ejecutando "update.cmd" en el directorio de Freenet. * Los usuarios de OS X, GNU/Linux, u otros sistemas POSIX, pueden actualizar ejecutando el script de consola "update.sh" en el directorio de Freenet.

source: Add friends (or connect to strangers)
es: Añadir amigos (o conectar con extraños)

source: If you know other people who also use Freenet, you can [add them as Friends][url_addfriend]. This will make you safer against attacks on Freenet Project infrastructure (the [seednodes][url_seednode_info]).
es: Si conoce a otras personas que también usan Freenet, puede [añadirles como amigos][url_addfriend]. Esto le hará más seguro contra ataques en la infraestructura del Freenet Project (los [nodos semilla][url_seednode_info]).

source: Once you are connected to 5 or more friends, you can enable **high security mode**. In high security mode Freenet will only connect to your friends. This makes your usage of Freenet almost undetectable, but you are still able to access the rest of the network through your friends' friends friends ....
es: Una vez esté conectado a 5 o más amigos, puede habilitar el **modo de alta seguridad**. En el modo de alta seguridad Freenet sólo se conectará a sus amigos. Esto hace su uso de Freenet casi indetectable, pero todavía puede acceder al resto de la red a través de amigos de los amigos de sus amigos.

source: You don't have to add friends right now. If you use a "low" or "normal" security level Freenet will automatically connect to strangers and will work just fine. However, your (or someone else's) government may be able to find out who you are with enough effort. Be careful!
es: No tiene que añadir amigos ahora mismo. Si usa un nivel de seguridad "bajo" o "normal" Freenet se conectará automáticamente con extraños y simplemente funcionará bien. Sin embargo, su Gobierno (o el de algún otro) puede que sea capaz de averiguar quién es usted con el esfuerzo suficiente. ¡Tenga cuidado!

source: Verifying Signatures
es: Verificar firmas

source: Download the [Freenet Project signing keys][url_keyring] and import them into your keyring:
es: Descargue las [claves de firmado del Freenet Project][url_keyring] e impórtelas a su juego de claves:

source: FAQ
es: Preguntas frecuentes (FAQ)
zh_cn: 常见问题

source: Philosophical
es: Filosófico
zh_cn: 哲学

source: Freenet is a platform for censorship-resistant communication and publishing. It is designed to ensure true freedom of communication over the Internet. It allows anybody to publish and read information with complete anonymity. Nobody controls Freenet, not even its creators, meaning that the system is not vulnerable to manipulation or shutdown. Freenet is also very efficient in how it deals with information, adaptively replicating content in response to demand. For more information, see [What is Freenet?](about.html#introduction)
es: Freenet es una plataforma para la comunicación y publicación resistentes a la censura. Está diseñado para asegurar la verdadera libertad de comunicación sobre Internet. Permite a cualquiera publiar y leer información con completo anonimato. Nadie controla Freenet, ni siquiera sus creadores, lo que significa que el sistema no es vulnerable a manipulación o cierre. Freenet también es muy eficiente en el modo en que trata con la información, replicando adaptativamente contenido en respuesta a la demanda. Para más información, vea [¿Qué es Freenet?](about.html#introduction)
zh_cn: Freenet 是一个无法被任何个人或者组织审查的通讯和内容发布平台。它被设计成能够确保通过互联网进行真正自由的沟通。它允许任何人完全匿名的发布和阅读信息。无人控制 Freenet，甚至它的创造者也不能，这意味着这个系统没有被操纵或关闭的风险。Freenet 也能够非常有效率的处理信息，根据需求自适应地复制内容。要了解更多信息，参见《[什么是 Freenet?](about.html#introduction)》一文。

source: How is Freenet different to Tor? Can I access Google/Facebook/etc through Freenet?
es: ¿En qué sentido es diferente Freenet de Tor? ¿Puedo acceder a Google/Facebook/etc. a través de Freenet?
zh_cn: Freenet 与 Tor 有何不同？我可以使用 Freenet 访问 Google、Facebook 等网站吗？
