Repository: hyphanet/website
Catalog: locale/*/LC_MESSAGES/freenet_site.po
Languages: es, zh_cn

source: ### 9\. But how will artists be rewarded for their work without copyright? Firstly, even if copyright were the only way that artists could be rewarded for their work, then I would contend that freedom is more important than having professional artists (those who claim that we would have no art do not understand creativity: people will always create, it is a compulsion, the only question is whether they can do it for a living). Secondly, it could be questioned whether copyright is effective even now. The music industry is one of the most vocally opposed to enhancements in communication technology, yet according to many of the artists who should be rewarded by copyright, it is failing to do so. Rather it has allowed middle-men to gain control over the mechanisms of distribution, to the detriment of both artists and the public.
es: ### 9\. ¿Pero cómo se recompensará a los artistas por su trabajo sin copyright? En primer lugar, incluso si el copyright fuera la única manera de que los artistas pudieran ser recompensados por su trabajo, tendría entonces que defender que la libertad es más importante que tener artistas profesionales (aquellos que proclaman que no tendríamos arte no comprenden la creatividad: las personas siempre crearán es una compulsión, la única cuestión es si pueden hacerlo para ganarse la vida). En segundo lugar, podría cuestionarse si el copyright es efectivo incluso ahora. La industria de la música es una de las que más ha expresado su oposición a las mejoras en la tecnología de comunicación, aunque de acuerdo con muchos de los artistas que deberían ser recompensados por copyright, esto no está funcionando. Más bien ha permitido que los intermediarios ganen control sobre los mecanismos de distribución, en detrimento tanto de artistas como del público.
zh_cn: ### 9\. 但若艺术家的工作没有版权，他们如何得到回报？ 首先，即使版权是艺术家从其作品获得回报的唯一方式，我主张自由比拥有专业艺术家更重要（那些声称我们没有艺术细胞不懂得创新的人：人们总是在创新，这是种冲动，唯一的问题是他们是不是考创新生存的）。 其次，甚至到现在，版权是否起作用也是值得怀疑的。音乐产业就是一个典型的例子。在不断提高的通讯技术下，音乐文件得到广泛自由的传播，但是应当从版权得到丰厚回报的艺术家们，并没有。版权让中间人控制了发行机制，同时损害了艺术家和公众的利益。

source: ### 10\. Alternatives to Copyright Fortunately it won't come to this. There are many alternative ways to reward artists. The simplest is voluntary payment. This is an extension of the patronage system which was frequently used to reward artists prior to copyright, where a wealthy person would fund an artist to allow them to create full-time. The Internet permits an interesting extension of this idea, where rather than having just one wealthy patron, you could have hundreds of thousands, contributing small amounts of money over the Internet. We actually practice what we preach in this regard too, on the 15th of March 2001 the Freenet Project started taking donations, and within a week we had collected over $1000.
es: ### 10\. Alternativas al copyright Afortunadamente no se llegará a esto. Hay muchas formas alternativas de recompensar a los artistas. La más simple es el pago voluntario. Esta es una extensión del sistema de mecenazgo que frecuentemente fue usado para recompensar a los artistas antes del copyright (derechos de copia), donde una persona rica financiaría a un artista para permitirle crear a tiempo completo. Internet permite una extensión interesante de esta idea, donde en lugar de tener sólo a un mecenas rico, podría tener cientos de miles, aportando pequeñas cantidades de dinero por Intenet. De hecho también practicamos lo que predicamos a este respecto, el 15 de marzo de 2001 el Freenet Project comenzó a recibir donaciones, y en una semana habíamos recogido más de 1000 $.

source: People
es: Personas
zh_cn: 参与人员

source: ## Current Contributors
es: ## Contribuidores actuales

source: ### Ian Clarke Freenet is based on Ian's paper "A Distributed Decentralised Information Storage and Retrieval System". Ian started the Freenet Project around July of 1999, and continues to coordinate the project. Learn more about Ian on his [personal website](http://blog.locut.us/).
es: ### Ian Clarke Freenet se basa en el ensayo de Ian "A Distributed Decentralised Information Storage and Retrieval System" (Un sistema de almacenamiento y descarga de información descentralizado y distribuido). Ian comenzó con Freenet Project en torno a julio de 1999, y continúa coordinando el proyecto. Conozca más acerca de Ian en su [sitio web personal](http://blog.locut.us/).
zh_cn: ### Ian Clarke Freenet 基于 Ian 的论文《一个分布式去中心化的信息储存和接收系统》（A Distributed Decentralised Information Storage and Retrieval System）。Ian 在 1999 年 7 月启动了这一项目，并持续协调该项目。您可以在他的[个人网站](http://blog.locut.us/)了解 Ian。

source: ### Matthew Toseland Matthew has been working on Freenet since before the 0.5 release. His work and that of others has resulted in dramatic improvements to the performance and stability of the network.
es: ### Matthew Toseland Matthew ha estado trabajando en Freenet desde antes de la versión 0.5. Su trabajo y el de otros han resultado en tremendas mejoras en el rendimiento y la estabilidad de la red.
zh_cn: ### Matthew Toseland Matthew 在 0.5 版本发布之前就在为 Freenet 工作了。他与其他人的工作显著的提高了整个网络的性能和稳定性。

source: ### Oskar Sandberg Oskar was also one of the earliest contributors to the Freenet Project, and has made some important theoretical breakthroughs that lead to the beginning of Freenet 0.7, see the papers page.
es: ### Oskar Sandberg Oskar además fue uno de los contribuidores más precoces al Freenet Project, y ha realizado algunas innovaciones teóricas importantes que nos condujeron al comienzo de Freenet 0.7, vea la página de documentos técnicos (papers).

source: ### Florent Daignière Since 2003, Florent has improved various aspects of the software and performed the project's system administration. In his day job, he is the Technical Director of [Matta Consulting](https://www.trustmatta.com), a boutique security consultancy firm.
es: ### Florent Daignière Desde 2003, Florent ha mejorado varios aspectos del software y llevado la administración del sistema del proyecto. En su trabajo diario, él es el Director Técnico de [Matta Consulting](https://www.trustmatta.com), una firma de consultoría de seguridad de especializada.
zh_cn: ### Florent Daignière 2003 年以来，Florent 改进了软件的各个方面，同时也是项目的系统管理员。他的日常工作是 [Matta Consulting](https://www.trustmatta.com) 的技术总监。这是一家安全咨询公司。

source: ### Michael Rogers Michael has mostly contributed detailed simulations as part of the Google Summer of Code. He has been helpful in designing the [new transport layer]( https://old-wiki.freenetproject.org/NewTransportLayer).
es: ### Michael Rogers Michael ha contribuido mayoritariamente en simulaciones detalladas como parte del Google Summer of Code. Ha sido de utilidad en el diseño de la [nueva capa de transporte](https://old-wiki.freenetproject.org/NewTransportLayer).
zh_cn: ### Michael Rogers Michael 在 Google Summer of Code 中贡献了详细的模拟实验。他的工作对设计[新的传输层]( https://old-wiki.freenetproject.org/NewTransportLayer)非常有帮助。

source: ### Steve Dougherty The current release manager. He joined in GSoC 2013 and has been a driving force behind tackling long standing issues in Freenet.
es: ### Steve Dougherty El director de la versión actual. Se unió en el GSoC 2013 y ha sido una fuerza impulsora detrás del abordamiento de problemas largo tiempo pendientes en Freenet.

source: ### xor The Developer of the Web of Trust and Freetalk. He worked on the Web of Trust in part-time for one year and is now working as volunteer again.
es: ### xor El desarrollador del Web of Trust y Freetalk. Trabajó en el Web of Trust a tiempo-parcial durante un año y ahora está trabajando de nuevo como voluntario.

source: ### David (Bombe) Roden The developer of the site insertion tool jSite and of Sone, the Social Network over Freenet.
es: ### David (Bombe) Roden El desarrollador de la herramienta de inserción de sitios jSite y de Sone, la red social que marcha sobre Freenet.

source: ### Ximin Luo A debian developer who currently works on packaging Freenet.
es: ### Ximin Luo Un desarrollador de Debian que actualmente trabaja en el empaquetado de Freenet.

source: ### Bert Massop Works on the Freenet core and wherever there is need.
es: ### Bert Massop Trabaja en el motor de Freenet y donde sea necesario.

source: ### TheSeeker A long term contributor who, among other things, helps keep the contact between the core developers and users in active subgroups.
es: ### TheSeeker Un contribuidor de largo recorrido que, entre otras cosas, ayuda a mantener el contacto entre los desarrolladores principales y los usuarios en los subgrupos activos.

source: ### Tommy[D] A Gentoo packager who untangled all the dependencies of Freenet and packaged it cleanly in Gentoo.
es: ### Tommy[D] Un empaquetador de Gentoo que desenmarañó todas las dependencias de Freenet y lo empaquetó limpiamente en Gentoo.

source: ### Arne Babenhauserheide The current maintainer of pyFreenet and infocalypse. He also writes articles and tutorials for Freenet.
es: ### Arne Babenhauserheide La actual mantenedora de pyFreenet e infocalypse. También escribe artículos y tutoriales para Freenet.

source: ### The translators A dilligent team of people from various backgrounds who make it possible to ship Freenet and this website in many different languages.
es: ### Los traductores Un diligente equipo de personas de diferentes bagajes que hacen posible trasladar Freenet y este sitio web en muchos idiomas diferentes.

source: ### Many more great hackers This list is missing many freesite authors, plugin writers, and a host of other people who contributed in various ways.
es: ### Muchos más hackers magníficos En esta lista faltan muchos autores de freesites, desarrolladores de complementos, y un montón de otras personas que han contribuido de diferentes maneras.

source: ## Anonymous Contributors
es: ## Contribuidores anónimos

source: ### Eleriseth Works on Freenet core and communicates via FMS.
es: ### Eleriseth Trabaja en el motor de Freenet y se comunica vía FMS.

source: ### Somedude The developer of the Freenet-based Forum system FMS, of FreenetHG and of FLIP, chat over Freenet.
es: ### Somedude El desarrollador de FMS el sistema de foros basado en Freenet, de FreenetHG y de FLIP, un chat sobre Freenet.

source: ### The folks from Frost A group of users and programmers who use an old spammable Freenet-based forum system which has been abandoned by most of the core developers. They are active, however, and though it takes time for their contributions to reach to core development, they take part in Freenet development.
es: ### La gente de Frost Un grupo de usuarios y programadores que usan un antiguo sistema de foros spameable basado en Freenet que ha sido abandonado por la mayoría de los desarrolladores del motor. Sin embargo, están activos, y aunque lleva tiempo que sus contribuciones alcancen el desarrollo del motor, toman parte en el desarrollo de Freenet.

source: ## Previous Contributors
es: ## Contribuidores anteriores

source: ### Thomas Markus A dutch developer and statistic-enthusiast. He now works at Topicus.Education.
es: ### Thomas Markus Un desarrollador holandés y entusiasta de las estadísticas. Ahora trabaja en Topicus Education.

source: ### Scott Miller Scott is responsible for the implementation of much of the cryptography elements within Freenet.
es: ### Scott Miller Scott es responsable de la implementación de muchos de los elementos de criptografía dentro de Freenet.
zh_cn: ### Scott Miller Scott 负责实现了大部分的 Freenet 加密代码。

source: ### Steven Starr Steven helps with administration of Freenet Project Inc, and is an advisor to the project on business and publicity matters.
es: ### Steven Starr Steven ayuda con la administración de Freenet Project Inc, y es un consejero del proyecto en asuntos de negocios y publicidad.
zh_cn: ### Steven Starr Steven 帮助管理 Freenet Project Inc，同时也是项目的商务和媒体顾问。

source: ### Dave Baker Dave's main contribution has been [Freemail](documentation.html#freemail), his Summer of Code project to build a working email-over-Freenet system, as well as some debugging and core work in various places.
es: ### Dave Baker La principal contribución de Dave ha sido [Freemail](documentation.html#freemail), su proyecto del Summer of Code para construir un sistema de email-sobre-Freenet funcional, además de algo de depuración y trabajos en la aplicación principal en varios puntos.

source: ### Robert Hailey Robert has helped improve the speed and security of Freenet by finding two **major** bugs, and has recently contributed some code.
es: ### Robert Hailey Robert ha ayudado a mejorar la velocidad y seguridad de Freenet al encontrar dos **grandes** fallos, y recientemente ha aportado algo de código.
zh_cn: ### Robert Hailey Robert 发现了两个**重要** Bug，提高了 Freenet 的速度和安全性。最近他也贡献了一些代码。

source: ### David Sowder David (Zothar) has helped the Freenet Project as time permits and interest directs, including configuration, statistics and peer management via FCP, the FProxy stats page and Node 2 Node Messages (N2NM/N2NTMs). And **hundreds of others**, who either haven't asked to be added here, who prefer to remain nameless, or who we just haven't got around to thanking. Not to mention thousands of users, testers, and [donors](donate.html#sponsors)!
es: ### David Sowder David (Zothar) ha colaborado con el Freenet Project lo que le ha permitido el tiempo y le ha guiado el interés, incluyendo la configuración, estadísticas y gestión de pares (peers) vía FCP, la página de estadísticas de FProxy y los mensajes (entre nodos) Node 2 Node (N2NM/N2NTMs). Y **cientos otros**, que o bien no han pedido ser añadidos aquí, o que prefieren permanecer anónimos, o a los que simplemente no hemos podido acceder para agradecérselo. ¡Por no mencionar a los miles de usuarios, probadores, y [donantes](donate.html#sponsors)!

source: Papers
es: Publicaciones
zh_cn: 论文

source: ![][icon_pdf] [Measuring Freenet in the Wild: Censorship-resilience under Observation](assets/papers/roos-pets2014.pdf) (PDF) Observations and measurements on the live Freenet network. Includes suggestions for improvement. This was submitted to PETS 2014.
es: ![][icon_pdf] [Measuring Freenet in the Wild: Censorship-resilience under Observation](assets/papers/roos-pets2014.pdf) (PDF) Observaciones y medidas en vivo sobre la red Freenet. Incluye sugerencias de mejora. Esto fue entregado a PETS 2014.
zh_cn: ![][icon_pdf] [Measuring Freenet in the Wild: Censorship-resilience under Observation](assets/papers/roos-pets2014.pdf) (PDF) 研究观测 Freenet 网络，提供了改进建议。这篇论文被提交到了 PETS 2014。

source: ![][icon_pdf] [The Dark Freenet](assets/papers/freenet-0.7.5-paper.pdf) (PDF) Detailed paper about the Freenet 0.7.5 network, as opposed to its routing algorithm, which is detailed in the below papers. Includes some new simulations. This has been submitted to PET 2010.
es: ![][icon_pdf] [The Dark Freenet](assets/papers/freenet-0.7.5-paper.pdf) (PDF) Publicación detallada acerca de la red Freenet 0.7.5, en contraste a su algoritmo de enrutamiento, que está detallado en los documentos de debajo. Incluye algunas simulaciones nuevas. Esto ha sido entregado a PET 2010.
zh_cn: ![][icon_pdf] [The Dark Freenet](assets/papers/freenet-0.7.5-paper.pdf) (PDF) 关于 Freenet 0.7.5 网络细节的论文，其中不包括它的路由算法（下面的论文中有）。论文包括一些新的模拟实验。这篇论文被提交到了 PET 2010。

source: ![][icon_video] [Video of Small World talk, Berlin, December 2005](http://player.vimeo.com/video/22488244?title=0&byline=0&portrait=0) This is a video of a talk given by Ian Clarke and Oskar Sandberg at the Chaos Computer Congress in Berlin, December 2005, describing the (then) new architecture for Freenet 0.7\. You can also download the [slideshow]( assets/papers/ccc-slideshow.pdf.bz2), and the source for the Java [demo]( assets/papers/ccc-freenet-demo.tar.bz2) (requires Java 1.5).
es: ![][icon_video] [Vídeo de una charla sobre la Small World, Berlín, diciembre de 2005](http://player.vimeo.com/video/22488244?title=0&byline=0&portrait=0) Este es un vídeo de una charla conducida por Ian Clarke y Oskar Sandber en el Chaos Computer Congress en Berlín, en diciembre de 2005, describiendo la (entonces) nueva arquitectura de Freenet 0.7\. También puede descarga la [secuencia de diapositivas](assets/papers/ccc-slideshow.pdf.bz2), y el código fuente para la [demo](assets/papers/ccc-freenet-demo.tar.bz2) en Java (requiere Java 1.5).
zh_cn: ![][icon_video] [Video of Small World talk, Berlin, December 2005](http://player.vimeo.com/video/22488244?title=0&byline=0&portrait=0) 此视频是2005年12月在柏林的 Chaos Computer 大会上，Ian Clarke 和 Oskar Sandberg 发表的演讲。这个演讲描述了（当时）全新的 Freenet 0.7 架构。您也可以下载演讲使用的[幻灯片]( assets/papers/ccc-slideshow.pdf.bz2)，以及[演示]( assets/papers/ccc-freenet-demo.tar.bz2) 的 Java 源代码（需要 Java 1.5）。

source: ![][icon_pdf] [Searching in a Small World](assets/papers/lic.pdf) (PDF) Oskar Sandberg's licentiate thesis describing a simple decentralized mechanism for constructing small world networks that is inspired by Freenet's original design. Part II of the thesis describes the basis for the new Darknet architecture.
es: ![][icon_pdf] [Searching in a Small World](assets/papers/lic.pdf) (PDF) La tesis de licenciatura de Oskar Sandberg describe un mecanismo descentralizado simple para construir redes small world (de mundo pequeño) que se inspiran en el diseño original de Freenet. La Parte II de la tesis describe la base para la nueva arquitectura de la Darknet.
zh_cn: ![][icon_pdf] [Searching in a Small World](assets/papers/lic.pdf) (PDF) Oskar Sandberg 的博士论文描述了一个简单的去中心化的机制，来构建一个小世界网络。此论文给 Freenet 最初的设计带来了灵感。论文的第二部分描述了新的暗网架构的基础。

source: ![][icon_pdf] [Distributed routing in Small World Networks](assets/papers/swroute.pdf) (PDF) A paper by Oskar Sandberg describing the theoretical basis for the new "Darknet" routing mechanism employed by Freenet 0.7.
es: ![][icon_pdf] [Distributed routing in Small World Networks](assets/papers/swroute.pdf) (PDF) Una publicación de Oskar Sandberg describiendo la base teórica para el nuevo mecanismo de enrutamiento de la "Darknet" (red oscura) empleado por Freenet 0.7.
zh_cn: ![][icon_pdf] [Distributed routing in Small World Networks](assets/papers/swroute.pdf) (PDF) Oskar Sandberg 的论文描述了新的“暗网”路由机制的理论基础。Freenet 0.7 采用了它。

source: ![][icon_pdf] Chaos Computer Congress Talk (slideshow) This is a [slideshow](assets/papers/ccc-slideshow.pdf.bz2) for a talk given at the Chaos Computer Congress on 30th Dec 2005 in Berlin, Germany by Ian Clarke and Oskar Sandberg. It described the new "darknet" approach to be employed in Freenet 0.7\. A Java demonstration to accompany the talk is [ also](assets/papers/ccc-freenet-demo.tar.bz2) available.
es: ![][icon_pdf] Charla del Chaos Computer Congress (secuencia de diapositivas) Esta es una [secuencia de diapositivas](assets/papers/ccc-slideshow.pdf.bz2) para una charla realizada en el Chaos Computer Congress el 30 de diciembre de 2005 en Berlín, Alemania, por Ian Clarke y Oskar Sandberg. Describía la nueva aproximación a la "darknet" (red oscura) que se iba a emplear en Freenet 0.7\. Una demostración en Java para acompañar la charla está [también](assets/papers/ccc-freenet-demo.tar.bz2) disponible.
zh_cn: ![][icon_pdf] Chaos Computer Congress Talk (幻灯片) 这是2005年12月30日在德国柏林的 Chaos Computer Congress 大会上 Ian Clarke 和 Oskar Sandberg 演讲所使用的[幻灯片]。它描述了（当时）即将在 Freenet 0.7 中引入的“暗网”模式。演讲配套的 Java 演示程序可以[在这里下载](assets/papers/ccc-freenet-demo.tar.bz2)。

source: ![][icon_pdf] [Switching for a small world](assets/papers/vilhelm_thesis.pdf) (PDF) A thesis by Vilhelm Verendel exploring ways to optimise the swapping algorithm.
es: ![][icon_pdf] [Switching for a small world](assets/papers/vilhelm_thesis.pdf) (PDF) Una tesis de Vilhelm Verendel que explora las formas de optimizar el algoritmo de intercambio.
zh_cn: ![][icon_pdf] [Switching for a small world](assets/papers/vilhelm_thesis.pdf) (PDF) Vilhelm Verendel 的论文探索了优化交换算法的途径。

source: ![][icon_pdf] [Protecting Freedom of Information Online with Freenet](assets/papers/freenet-ieee.pdf) (PDF) An IEEE Internet Computing article describing the Freenet architecture circa 2002 - probably the best introduction to the theory behind Freenet.
es: ![][icon_pdf] [Protecting Freedom of Information Online with Freenet](assets/papers/freenet-ieee.pdf) (PDF) Un artículo del IEEE Internet Computing de alrededor del 2002 describiendo la arquitectura de Freenet - probablemente la mejor introducción a la teoría que hay detrás de Freenet.
zh_cn: ![][icon_pdf] [Protecting Freedom of Information Online with Freenet](assets/papers/freenet-ieee.pdf) (PDF) 这是一篇 2002 年左右《IEEE Internet Computing》的文章，描述了 Freenet 的架构。这可能是对 Freenet 背后理论的最好介绍。

source: ![][icon_pdf] [FreeNet White Paper](assets/papers/ddisrs.pdf) (PDF) Original white paper by Ian Clarke, Division of Informatics, University of Edinburgh 1999.
es: ![][icon_pdf] [FreeNet White Paper](assets/papers/ddisrs.pdf) (PDF) Publicación base original de Ian Clarke, División de Informática, Universidad de Edimburgo 1999.
zh_cn: ![][icon_pdf] [FreeNet White Paper](assets/papers/ddisrs.pdf) (PDF) 这是 Ian Clarke 于 1999 年在英国爱丁堡大学信息学系撰写的白皮书原稿。

source: ![][icon_pdf] [Attack Resistant Network Embeddings for Darknets](http://www.ukp.tu-darmstadt.de/fileadmin/user_upload/Group_P2P/share/publications/Attack_Resistant_Network_Embeddings_for_Darknets.pdf) (PDF) A proposal for changing the darknet swapping algorithm which we are still considering (we have some doubts about long-term performance).
es: ![][icon_pdf] [Attack Resistant Network Embeddings for Darknets](http://www.ukp.tu-darmstadt.de/fileadmin/user_upload/Group_P2P/share/publications/Attack_Resistant_Network_Embeddings_for_Darknets.pdf) (PDF) Una propuesta para cambiar el algoritmo de intercambio de la darknet que aún estamos considerando (tenemos algunas dudas acerca del rendimiento a largo plazo).
zh_cn: ![][icon_pdf] [Attack Resistant Network Embeddings for Darknets](http://www.ukp.tu-darmstadt.de/fileadmin/user_upload/Group_P2P/share/publications/Attack_Resistant_Network_Embeddings_for_Darknets.pdf) (PDF) 我们目前正在考虑的一篇关于修改暗网交换算法的提议（我们有些怀疑该方式长期运行会影响性能）。

source: ![][icon_pdf] [A Contribution to Analyzing and Enhancing Darknet Routing](http://www.p2p.tu-darmstadt.de/publications/details/?no_cache=1&tx_bibtex_pi1%5Bpub_id%5D=TUD-CS-2013-0036) ([PDF](http://www.p2p.tu-darmstadt.de/fileadmin/user_upload/Group_P2P/share/INFOCOM.pdf)) A proposal for changing the routing algorithm which we are still considering (the worst case performance i.e. when a block has been lost may be unacceptable).
es: ![][icon_pdf] [A Contribution to Analyzing and Enhancing Darknet Routing](http://www.p2p.tu-darmstadt.de/publications/details/?no_cache=1&tx_bibtex_pi1%5Bpub_id%5D=TUD-CS-2013-0036) ([PDF](http://www.p2p.tu-darmstadt.de/fileadmin/user_upload/Group_P2P/share/INFOCOM.pdf)) Una propuesta para cambiar el algoritmo de enrutamiento que aún estamos considerando (el peor caso de rendimiento, es decir, cuando un bloque se ha perdido puede ser inaceptable).
zh_cn: ![][icon_pdf] [A Contribution to Analyzing and Enhancing Darknet Routing](http://www.p2p.tu-darmstadt.de/publications/details/?no_cache=1&tx_bibtex_pi1%5Bpub_id%5D=TUD-CS-2013-0036) ([PDF](http://www.p2p.tu-darmstadt.de/fileadmin/user_upload/Group_P2P/share/INFOCOM.pdf)) 我们正在考虑的一篇关于修改路由算法的提议（我们在考虑最坏的情况下的性能问题，也就是某个数据块丢失或无法接受的情况）。
