Repository: hyphanet/website
Catalog: locale/*/LC_MESSAGES/freenet_site.po
Languages: es, zh_cn

source: * **Adaptive search**: If you want to find the author of some content, and you can predict the exact keys which will be inserted, and you are able to connect to new nodes at will, you may be able to listen out for the keys, guess where they must have come from, connect to nodes near there, and if your guess is correct, get more keys which gives you a more accurate fix on the originator, so the attack gets faster and faster and eventually converges on the originator. This attack is most powerful with inserts of big, predictable files, but the "Insert a random, safe key" option will make the keys unpredictable even if the content is guessable, by using random encryption keys. The downside is it produces a different key each time for the same file, and you can never safely reinsert the same file to the same key. Given that Freenet's data persistence is currently relatively poor, this is a problem. Anyway, if you _can_ use the random keys option, the attacker is unable to move towards you until after you announce the file: Most of his samples will come not from the actual content inserts but from chat posts. There are far fewer of these, and changing your pseudonymous identity periodically will help, provided the attacker cannot easily connect the new identity to the old one. Using a dedicated identity for posting sensitive content, which doesn't chat too much, again will help. Another thing which makes a huge difference is connecting only to your friends (i.e. using darknet): This makes it extremely difficult for an attacker to get new connections closer to where he thinks you must be, just as it helps with correlation attacks. So the biggest problems with this attack are 1) Files which are not very popular fall off Freenet relatively quickly, so need to be reinserted, but it is not safe to reinsert to the same key (this is why we have the "Insert a canonical key" option, for those who don't care about attacks), and 2) Chat can still be attacked. Tunnels will help to deal with both problems, and by default will only be used for predictable keys so can be relatively slow without this causing problems in practice. Also there is work going on on various techniques to allow users to do reinserts safely via for example preventing the attacker from seeing requests started before he connected. Another important point is this only works if the source is uploading new content, or chatting, regularly; creating and bootstrapping a new pseudonymous identity over a short period, doing a single insert (of any size) with the safe random key option, and announcing it, should be relatively safe from this attack, even on opennet - but see the section above on bootstrapping attacks.
es: * **Búsqueda adaptativa**: Si quiere encontrar al autor de algún contenido, y puede predecir las claves exactas que serán insertadas, y puede conectarse a nuevos nodos a voluntad, puede que sea capaz de escuchar para captar las claves, estimar de dónde deben haber venido, conectarse a nodos cerca de allí, y si su estimación es correcta, obtener más claves que le proporcionen una posición más precisa del originador, así que el ataque se vuelve más y más rápido y eventualmente converge sobre el originador. Este ataque es el más potente con inserciones de ficheros grandes y predecibles, pero la opción "Insertar una clave aleatoria segura" hará las claves impredecibles incluso si el contenido es pronosticable, por el uso de claves de cifrado aleatorias. La desventaja es que produce una clave distinta cada vez para el mismo fichero, y nunca puede reinsertar con seguridad el mismo fichero en la misma clave. Dado que la persistencia de datos de Freenet actualmente es relativamente pobre, esto es un problema. De todas formas, si _puede_ usar la opción de claves aleatorias, el atacante no es capaz de moverse hacia usted hasta después de que anuncie el fichero: La mayoría de su muestreo provendrá, no de las inserciones de contenido actuales sino de mensajes de chat. Hay muchos menos de estos, y cambiar su identidad pseudónima con periodicidad ayudará, dado que el atacante no puede asociar fácilmente la nueva identidad con la antigua. Usar una identidad dedicada para publicar contenido sensible, que no se use demasiado para chatear, de nuevo, ayudará. Otra cosa que supone una enorme diferencia es conectarse sólo a sus amigos (usar la darknet): Esto le pone extremadamente difícil a un atacante obtener nuevas conexiones más cercanas a donde él piensa que usted debe estar, de igual manera que esto también ayuda con los ataques de correlación. Así que los mayores problemas con este ataque son que 1) Los ficheros que no son muy populares desaparecen de Freenet de forma relativamente rápida, por lo que tienen que reinsertarse, pero no es seguro reinsertar en la misma clave (este es el porqué tenemos la opción "Insertar una clave canónica", para aquellos que no se preocupan por lo ataques), y 2) El chat aún puede ser atacado. Los túneles le ayudarán a ocuparse de ambos problemas, y de forma predeterminada sólo se usarán para claves predecibles, así que pueden ser relativamente lentos sin esto causando problemas en la práctica. Además hay trabajo en marcha sobre distintas técnicas para permitir a los usuarios efectuar reinserciones de forma segura mediante, por ejemplo, evitar que el atacante vea las peticiones iniciadas antes de que él conectase. Otro detalle importante es que esto sólo funciona si regularmente la fuente está subiendo contenido nuevo, o está chateando; crear e inicializar una nueva identidad pseudónima durante un periodo corto de tiempo, hacer una única inserción (de cualquier tamaño) con la opción de clave aleatoria segura, y anunciarla, debería ser relativamente seguro contra este ataque, incluso en la opennet - pero eche un vistazo a la sección previa de ataques de inicialización.

source: * **Traffic analysis**: Freenet provides minimal protection against global traffic analysis (basic message padding etc); if the attacker also has nodes on the network, the extra data will likely be helpful. We certainly do not guarantee that it is impossible to trace data transfers from one node to the next with detailed traffic data, however it is hoped that this will fall down on the busier nodes. One day we will implement steganographic transports and/or constant bitrate links as an option for more paranoid users. Note that on Tor-style networks, global traffic analysis will defeat the network completely: all that is needed is to observe both the entry and exit points.
es: * **Análisis de tráfico**: Freenet proporciona una protección mínima contra el análisis de tráfico global (rellenado básico de mensajes, etc.); si el atacante también tiene nodos en la red, los datos extra probablemente serán útiles. Ciertamente no garantizamos que sea imposible rastrear transferencias de datos de un nodo al siguiente si se tienen datos de tráfico detallados, sin embargo se espera que esto se venga abajo en los nodos más ocupados. Un día, para los usuarios más paranoicos, implementaremos como opción transportes esteganográficos y/o enlaces de tasa de transferencia constante. Observe que en redes estilo-Tor, el análisis de tráfico global derrotará a la red por completo: todo lo que se necesita es observar tanto el punto de entrada como el de salida.

source: * **Swapping attacks**: It is possible to attack the location swapping algorithm, and thereby disrupt routing on friend-to-friend networks. This has been demonstrated by the authors of the Pitch Black paper. We are working on a solution, but sadly at the moment most users use opennet.
es: * **Ataques de intercambio**: Es posible atacar el algoritmo de intercambio de ubicaciones, y por tanto interrumpir el enrutamiento en redes amigo-a-amigo. Esto ha sido evidenciado por los autores del ensayo Pitch Black. Estamos trabajando en una solución, pero tristemente en este momento la mayoría de los usuarios usa la opennet.

source: More information on the current practical state of Freenet security is available [here](https://wiki.freenetproject.org/Security_summary).
es: Más información sobre el estado práctico actual de la seguridad de Freenet está disponible [aquí](https://wiki.freenetproject.org/Security_summary).

source: Is Freenet vulnerable to flooding attacks?
es: ¿Es Freenet vulnerable a ataques de inundación (flood)?
zh_cn: Freenet 易遭受洪泛攻击？

source: Short answer: no. Long answer: We don't think so. Aside from protecting freedom of speech, Freenet is also designed to be an efficient dynamic caching system. If information is requested a lot from a limited number of nodes, the nodes that the requests pass through will cache the information, lowering the load on the network. If information is inserted on a limited set of nodes and then subsequently requested a lot from a separate set of nodes, with repetition, the sets will close in on one another in the network topology until they are "neighbors" and only the originally targeted nodes are suffering from the attack. In other words, in order to harm Freenet with a flood you need to consistently change your point of entry into the network and continually insert and request new data, and you will still only increase the workload for the network that is linear to your own. Given an immense will and capacity greater than the total of the entire network, it is possible to cripple any public network (including the Internet itself) with floods, but it is our intention to always keep Freenet as resistant to this as theoretically possible. Curiously enough, the above analysis only applies to [Opennet]( https://wiki.freenetproject.org/Opennet). On Darknet, you might have a little more success, although it would be much harder to change your entry point in any significant way. Nonetheless, you have a reasonably low bandwidth multiplier (the total number of nodes visited, around 20 on average), and you are severely limited by the number of nodes you can connect to, which will be low on a darknet.
es: Respuesta corta: No. Respuesta larga: No lo creemos. Además de proteger la libertad de expresión, Freenet también está diseñado para ser un sistema de almacenamiento caché dinámico eficiente. Si la información se solicita mucho desde un número limitado de nodos, los nodos que atraviesan las peticiones almacenarán en caché la información, reduciendo la carga en la red. Si la información se inserta en un grupo limitado de nodos y luego posteriormente es muy solicitada desde un grupo aparte de nodos, de forma repetida, los grupos se acercarán el uno al otro en la topología de la red hasta que se conviertan en "vecinos" y sólo los nodos que originalmente eran el objetivo están sufriendo el ataque en el grupo ampliado. En otras palabras, para causar daño a Freenet con una inundación, un atacante necesita cambiar consistentemente su punto de entrada en la red, e insertar y pedir continuamente nuevos datos, y aún así sólo incrementará la carga de trabajo para la red que forme línea consigo mismo. Si se da una inmensa voluntad y una capacidad más grande que la del total de la red al completo, es posible incapacitar cualquier red pública (incluyendo la propia Internet) con inundaciones, pero nuestra intención es mantener siempre Freenet tan resistente a esto como teóricamente sea posible. Es bastante curioso, el análisis descrito sólo se aplica a la [Opennet](https://wiki.freenetproject.org/Opennet). En la Darknet, un atacante puede que tenga un poco más de éxito, sin embargo sería mucho más difícil cambiar su punto de entrada de cualquier forma significativa. A pesar de todo, tiene un multiplicador de ancho de banda razonablemente bajo (el número total de nodos visitados, en torno a 20 de media), y está severamente limitado por el número de nodos a los que puede conectarse, que será bajo en una darknet.

source: Why hash keys and encrypt data when a node operator could identify them (the data) anyway if he tried?
es: ¿Por qué transformar en hash las claves y cifrar los datos cuando un operador de nodo podría identificarlos (los datos) de todos modos si lo intenta?

source: Hashing the key and encrypting the data is not meant a method to keep Freenet Node operators from being able to figure out what type of information is in their nodes if they really want to (after all, they can just find the key in the same way as someone who requests the information would) but rather to keep operators from having to know what information is in their nodes if they don't want to. This distinction is more a legal one than a technical one. It is not realistic to expect a node operator to try to continually collect and/ or guess possible keys and then check them against the information in his node (even if such an attack is viable from a security perspective), so a sane society is less likely to hold an operator liable for such information on the network.
es: Transformar en hash la clave y cifrar los datos no pretende ser un método para evitar que los operadores de nodo Freenet sean capaces de averiguar qué tipo de información hay en sus nodos si de verdad lo desean (después de todo, simplemente pueden buscar la clave de la misma forma que lo haría alguien que pide la información) sino más bien evitar que los operadores tengan que conocer qué información hay en sus nodos si no lo desean. Esta distinción es más una distinción legal que técnica. No es realista esperar que un operador de nodo trate continuamente de recopilar y/o adivinar claves posibles y luego las compruebe contra la información en su nodo (incluso si tal ataque es viable desde una perspectiva de seguridad), así que una sociedad sana es menos probable que responsabilice a un operador por la presencia de tal información en la red.

source: What about hostile "cancer" nodes within the network?
es: ¿Qué pasa con los hostiles nodos "cáncer" en el interior de la red?
zh_cn: 什么是网络内的恶意节点？

source: The existence of malicious nodes within the network is the most difficult problem that a distributed network must face, and has been the bane of many previous ideas. Many systems (such as multiplayer gaming networks) try to avoid malicious nodes by keeping the protocol and code closed, but we have yet to see an example of that working in the long run. And anyway it is opposed to Freenet's philosophy. Freenet is based on a balance of positive and negative feedback loops that bring requests for information to a node when it is functioning well, and keep requests away from it when it is not. The key to avoiding "cancers" is (as in the body) to make sure these loops can correctly identify even the most carefully designed malicious node and not keep sending requests to it. This issue is not fully dealt with by the current test code, but you can rest assured that a number of possible solutions have been on the table and discussed for some time now. Several have been implemented (enforcing hashes or signatures on content, per node failure tables, backing off from a node that causes timeouts ...)
es: La existencia de nodos maliciosos en el interior de la red es el problema más difícil que una red distribuida debe afrontar, y ha sido la maldición de muchas ideas previas. Muchos sistemas (como las redes de juego multijugador) tratan de evitar nodos maliciosos manteniendo cerrado el protocolo y el código, pero aún tenemos que ver un ejemplo de eso funcionando a largo plazo. Y de todos modos es lo opuesto a la filosofía de Freenet. Freenet se basa en un equilibro de ciclos de realimentación positivos y negativos que traen peticiones de información a un nodo cuando está funcionando bien, y mantienen las peticiones apartadas de él cuando no lo está. La clave para evitar "cánceres" es (como en el cuerpo) asegurarse de que estos ciclos puedan identificar correctamente incluso al nodo malicioso más cuidadosamente diseñado, y no seguir enviándole peticiones. Este asunto no está plenamente resuelto por el actual código de prueba, pero puede tener la tranquilidad de que varias soluciones posibles han estado sobre la mesa y se han estado discutiendo durante un tiempo. Varias se han implementado (aplicar hashes o firmas sobre el contenido, tablas de fallo por nodo, desasistir al nodo que cause agotamiento de los tiempos de espera...).

source: What about attack Y?
es: ¿Qué pasa con el ataque Y?

source: Freenet is still in testing and there are bound to be attacks found that we have not dealt with yet. So if you do manage to figure out a truly new kind of attack, we are interested in hearing about it. Please keep in mind what Freenet is and what it is not, however. No single network can offer everybody everything, and there are security issues that Freenet, by its nature, may not deal with to extent you might wish. If this upsets you, all of our code is freely available, so you are free to take as much of it as you like and write your own distributed network that suits your desires.
es: Freenet aún está en pruebas y hay ataques que se van a encontrar de los que aún no nos hemos encargado. Así que si consigue resolver un verdadero nuevo tipo de ataque, estamos interesados en escucharle sobre ello. Sin embargo, por favor, tenga en cuenta lo que es Freenet y lo que no es. No hay una sola red que pueda ofrecer todo a todos, y hay problemas de seguridad de los que Freenet, por su naturaleza, puede que no se ocupe en la medida en la que podría usted desear. Si esto le molesta, todo nuestro código está libremente disponible, así que es libre de tomar de él tanto como quiera y escribir su propia red distribuida que satisfaga sus deseos.

source: What private data does Freenet store? How do I get rid of it? How can I secure my computer so I am safe when running Freenet?
es: ¿Qué datos privados almacena Freenet? ¿Cómo me libro de ellos? ¿Cómo puedo asegurar mi computadora de forma que esté seguro cuando ejecuto Freenet?
zh_cn: Freenet 会存储什么隐私数据？我该如何摆脱它？如何保护我的计算机，保证我在运行 Freenet 的时候足够安全？

source: First of all, we **strongly** suggest that you install Freenet inside an encrypted drive using, for example, [Truecrypt](http://www.truecrypt.org/). It is not possible for Freenet to prevent all leaks of private data, especially if you download media files etc. Even if you only browse freesites and use the chat plugins, there will still be potentially incriminating data in your swapfile, which needs to be encrypted (on recent versions of Windows you could try the command "fsutil behavior set encryptpagingfile 1", but really the solution is to encrypt your whole system including swap). It is also essential that you use your web browser in privacy mode, or with cache and history turned off; we try to do this if you launch Freenet via the rabbit icon, but there are no guarantees as unfortunately this functionality seems buggy in current web browsers. Browser plugins could also be a problem, and you should use a separate browser for Freenet if in any doubt. Be careful with the files you download from Freenet - not only could anyone seizing your computer see you have them (media files are likely to be written to disk even if you open them directly in your web browser and never save them), but also they could contain threats to anonymity themselves, such as calling back to a malicious website etc; this is possible in for instance PDFs and some video formats. Freenet tries to warn you about this when it can't filter out such malicious content: Currently it can only filter HTML pages, GIF/PNG/JPEG images and CSS, and MP3s, but we will add support for Ogg soon and other formats later. And of course there are many other threats - you should take standard security precautions, such as not running operating systems that are no longer updated, not running software not from a trustworthy source, using appropriate security software etc (if you have a firewall make sure it allows the two UDP ports Freenet needs through). Because not all users will have installed encrypted drives at the time when they first install Freenet, Freenet itself attempts to encrypt all the potentially incriminating data that it stores on disk. Details are below but as explained, leaks are inevitable: you really should [encrypt your disks!]( http://www.truecrypt.org/)
es: Lo primero de todo, sugerimos **firmemente** que instale Freenet dentro de una unidad cifrada usando, por ejemplo, [Truecrypt](http://www.truecrypt.org/). No es posible para Freenet evitar todas las filtraciones de datos privados, especialmente si descarga ficheros audiovisuales etc. Incluso si sólo navega por freesites y usa los complementos de chat, todavía habrá datos potencialmente incriminantes en su fichero de intercambio (swap), que necesita ser cifrado (podría probar el comando "fsutil behavior set encryptpagingfile 1" en versiones recientes de Windows, pero la verdadera solución es cifrar el sistema por completo incluyendo el fichero de intercambio). También es esencial que use su navegador web en modo privacidad, o con la caché de navegación y el historial apagados; intentamos hacer esto cuando inicia Freenet mediante el icono del conejo, pero no hay garantías ya que desafortunadamente esta funcionalidad parece tener fallos en los navegadores web actuales. Los complementos de navegador también podrían ser un problema, y debe usar un navegador aparte para Freenet si hay alguna duda. Tenga cuidado con los ficheros que descargue de Freenet - no sólo cualquiera que se apoderara de su computadora vería que los tiene (los ficheros audiovisuales es probable que se escriban a disco incluso si los abre directamente en su navegador web y nunca los guarda), pero también podrían por si mismos contener amenazas al anonimato, como llamar a un sitio web malicioso, etc.; esto por ejemplo es posible en PDFs y algunos formatos de vídeo. Freenet trata de advertirle acerca de esto cuando no puede apartar tales contenidos maliciosos: Actualmente sólo puede filtrar páginas HTML, imágenes GIF/PNG/JPEG, CSS y MP3, pero pronto añadiremos soporte para Ogg y más tarde para otros formatos. Y por supuesto hay muchas otras amenazas - debería tomar medidas de seguridad estándar, como no ejecutar sistemas operativos que hayan dejado de actualizarse, no ejecutar software proveniente de una fuente no confiable, usar un software de seguridad apropiado, etc. (aunque si tiene un cortafuegos (firewall) asegúrese de que permite los dos puertos UDP que Freenet necesita). A causa de que no todos los usuarios tendrán instaladas unidades cifradas en el momento en que instalan Freenet por primera vez, el propio Freenet trata de cifrar todos los datos potencialmente incriminantes que almacena en disco. Los detalles están debajo pero tal como se explica, las filtraciones son inevitables: ¡verdaderamente debería [cifrar sus discos]( http://www.truecrypt.org/)!
