Repository: hyphanet/website
Catalog: locale/*/LC_MESSAGES/freenet_site.po
Languages: es, zh_cn

source: <div style="float: right"><img src="assets/img/suma2015_badge_transparent_3.png" alt="SUMA Award 2014/15"/></div> At this year's [congress](http://searchstudies.org/de/suma2015.html) of [SUMA-EV](http://suma-ev.de/en/index.html), association for free access to knowledge, the [SUMA award](http://suma-awards.de/en/index.html) was awarded in the venerable Karl-H.-Ditze lecture hall of the Hamburg University of Applied Sciences. The topic of the award, was the surveillance scandal, revealed by whistleblower Edward Snowden: 'protection against total surveillance'. From submissions of about 50 projects for the SUMA award 2014/15 the panel of SUMA-EV selected the Freenet Project as the winner. The prize money of 2500 euro will be used like regular [donations](donate.html) to fund our one paid developer. > ![](assets/img/news/suma_award_2015_handover.jpg) > Wolfgang Sander-Beuermann with Arne Babenhauserheide, long-term Freenet contributor, as representative of the award winner. Photo: Michael Christen in Hamburg, Lizenz: CC0.
es: <div style="float: right"><img src="assets/img/suma2015_badge_transparent_3.png" alt="Premio SUMA 2014/15"/></div> En el [congreso](http://searchstudies.org/de/suma2015.html) de este año del [SUMA-EV](http://suma-ev.de/en/index.html), una asociación para el acceso al libre conocimiento, el [premio SUMA](http://suma-awards.de/en/index.html) fue otorgado en el pabellón de lectura del venerable Karl-H.-Ditze de la Universidad de Hamburgo de Ciencias Aplicadas. El tema de este premio fue el escándalo de vigilancia, revelado por el informante Edward Snowden: 'protección contra la vigilancia total'. Entre las entregas de alrededor de 50 proyectos para el premio SUMA 2014/15 el panel del SUMA-EV seleccionó el proyecto Freenet como el ganador. Los 2500 euros del premio se usarán como [donaciones](donate.html) regulares para financiar a nuestro único desarrollador pagado. > ![](assets/img/news/suma_award_2015_handover.jpg) > Wolfgang Sander-Beuermann con Arne Babenhauserheide, contribuidor a Freenet de larga-trayectoria, como representante del galardonado. Foto: Michael Christen en Hamburgo, Licencia: CC0.

source: 1st January 2015 - apt-get over Freenet
es: 1 de enero de 2015 - apt-get sobre Freenet
zh_cn: 2015年1月1日 - 基于 Freenet 的 apt-get

source: Developers of the privacy-focused Debian derivative Mempo report that it can download updates over Freenet! For details, see their page on [Apt over Freenet](http://deb.mempo.org/#install_apt_freenet). Key Points: * use Freenet to distribute online updates * most secure hosting option That means it is now possible to get reproducibly built kernels checked by anonymous (and therefore hard to pressure) contributors and update them over Freenet without disclosing that you use them. This applies to the packages provided by Mempo - other apt-get activity like installing GIMP is still public. It would be possible to host the entire Debian repository in Freenet, but this is not yet on the agenda for Mempo because this other activity does not disclose the potentially sensitive information that you want additional privacy. > The practical cool result now, is that Mempo repository can not be censored, DDoSed or taken offline, despite having just 1 tiny server (or no server at all) - rfreeman (one of the mempo developers)
es: ¡Los desarrolladores de la derivada de Debian orientada hacia la privacidad, Mempo, informan de que esta puede descargar sus actualizaciones sobre Freenet! Para más detalles, vea su página acerca de [Apt sobre Freenet](http://deb.mempo.org/#install_apt_freenet). Puntos clave: * usa Freenet para distribuir actualizaciones en línea * es una opción de alojamiento más segura Eso significa que ahora es posible obtener kernels compilados de forma reproducible comprobados por contribuidores anónimos (y por tanto difíciles de presionar) y actualizarlos sobre Freenet sin revelar que los usa. Esto se aplica a los paquetes proporcionados por Mempo - otras actividades de apt-get como instalar GIMP todavía son públicas. Sería posible alojar el repositorio Debian completo en Freenet, pero eso aún no está en la agenda para Mempo porque esta otra actividad no revela información potencialmente sensible para la que quiera privacidad adicional. > El elegante resultado práctico ahora, es que el repositorio Mempo no puede ser censurado, atacado mediante DDoS o desconectado, a pesar de tener sólo 1 pequeño servidor (o ningún servidor en absoluto) - rfreeman (uno de los desarrolladores de Mempo)

source: 2014-11-23 - Freenet 0.7.5 build 1467 released
es: 2014-11-23 - Freenet 0.7.5 build 1467 publicada
zh_cn: 2014-11-23 - Freenet 0.7.5 build 1467 发布

source: This release fixes a bug introduced in build 1466 which can erase the list of plugins to load when Freenet starts if it crashes. If you are affected by this bug and can no longer connect, try adding the UPnP or JSTUN plugins again. This release also has updated Finnish, French, Dutch, and Brazilian Portuguese translations thanks to [volunteers on Transifex][url_transifex]. The Windows installer is updated: * It now disables the Java installer's sponsor offers. Thanks artart78! * It gained a Finnish translation. Thanks oselotti! Thank you for using Freenet! - Steve Dougherty
es: Esta versión corrige un fallo introducido en la build 1466 que puede borrar la lista de complementos a cargar cuando Freenet falla en el momento de iniciarse. Si está afectado por este fallo y ya no puede conectar, pruebe a añadir de nuevo los complementos UPnP o JSTUN. Esta versión también ha actualizado las traducciones al finlandés, francés, holandés, y portugués de Brasil, gracias a los [voluntarios en Transifex][url_transifex]. El instalador de Windows se actualizó: * Ahora deshabilita las ofertas de patrocinadores del instalador de Java. ¡Gracias artart78! * Adquirió una traducción al finlandés. ¡Gracias oselotti! ¡Gracias por usar Freenet! - Steve Dougherty

source: 2014-11-09 - Freenet 0.7.5 build 1466 released
es: 2014-11-09 - Freenet 0.7.5 build 1466 publicada
zh_cn: 2014-11-09 - Freenet 0.7.5 build 1466 发布

source: This release is planned to be the second-to-last version of Freenet to support Java 6\. The version after this one will refuse to upgrade unless running on Java 7 or later. Support for this behavior is part of a larger effort to allow separate official update channels - stable, testing, and unstable - as well as make it easier to publish unofficial update channels and further improve deployment security. Highlights for this build: * Add Hungarian Windows installer translation. Thanks drezzium!* Allow hiding the Java version End Of Life alert. (I'm sorry for the excessive annoyingness. Still - please upgrade Java!) * Upgrades to the next version (that is, when running this build's upgrade code) should no longer get [stuck in an upgrade loop][url_bug3208]. * Increase opennet peer limit to 142 peers. This now has [more math behind it][url_peermath] and will change when network parameters are adjusted. * Add more opennet seed nodes. Thanks saces and juiceman! * This build will be mandatory starting 2014-11-16, because old nodes will reject new nodes with more than 110 peers. Updates only take a few hours to spread, so this should only cause short term disruption. Additionally Matthew's (toad_'s) summer work on a custom on-disk format is done. This release lays the groundwork to include the results of that work [in the next release][url_toad]. This is designed for less disk activity and better behavior when corrupted. This release coincides with the 25th anniversary of the demolition of the Berlin wall (Mauerfall), which marked the beginning of the end of a large censorship and surveillance regime. May censorship be demolished everywhere! Thank you for using Freenet! - Steve Dougherty and Arne Babenhauserheide The link to http://127.0.0.1:8888 works for default Freenet nodes, but will not work for some setups. If you have a nonstandard setup, you should know the correct URL to use.
es: Esta versión se planea que sea la segunda hasta la última versión de Freenet en soportar Java 6\. La versión posterior a esta rechazará actualizarse a menos que esté ejecutando Java 7 o superior. El motivo para este comportamiento es que es parte de un esfuerzo de mayor envergadura para permitir separar los canales de actualización - estable, pruebas, e inestable - además de facilitar la publicación de canales de actualización no oficiales y mejorar la seguridad del despliegue de forma adicional. Destacados para esta versión (build): * Añade traducción al húngaro para el instalador de Windows. ¡Gracias drezzium!* Permite ocultar la alerta de fin de vida (EOL) de la versión de Java. (Lo siento por las molestias excesivas. Pero de todos modos - por favor, ¡actualice Java!) * Las actualizaciones a la siguiente versión (esto es, al ejecutar el código de actualización de esta versión (build)) ya no deben quedarse [estancadas en un bucle de actualización][url_bug3208]. * Incrementa el límite de pares (peers) de la opennet a 142. Esto ahora está [más calculado][url_peermath] y cambiará cuando se ajusten los parámetros de red. * Añade más nodos semilla a la opennet. ¡Gracias saces y juiceman! * Esta versión (build) será obligatoria comenzando el 2014-11-16, porque los nodos antiguos con más de 110 pares rechazarán los nuevos nodos. Las actualizaciones ahora tardan unas pocas horas en distribuirse, así que esto sólo debería causar perturbación a corto plazo. Además, el trabajo veraniego de Matthew (toad) sobre un formato de almacenamiento en-disco personalizado, se ha completado. Esta versión dispone unas bases para incluir los resultados de ese trabajo [en la próxima versión][url_toad]. Esto está diseñado para conseguir una menor actividad de disco y un mejor comportamiento cuando los datos estén corruptos. Esta versión coincide con el 25º aniversario de la demolición del muro de Berlín (Mauerfall), que marcó el principio del fin de un gran régimen de censura y vigilancia. ¡La censura puede ser derribada en todas partes! ¡Gracias por usar Freenet! - Steve Dougherty y Arne Babenhauserheide El enlace a http://127.0.0.1:8888 funciona para los nodos predeterminados, pero no funcionará para algunas configuraciones. Si tiene una configuración no estándar, debe conocer la URL correcta a usar.

source: 2013-08-05 - Statement on the recent Freedom Hosting (Tor) bust
es: 2013-08-05 - Declaración sobre la reciente aprehensión de Freedom Hosting (Tor)
zh_cn: 2013-08-05 - 有关最近自由托管 (Tor) 受损的声明

source: According to [the press](http://arstechnica.com/tech-policy/2013/08/alleged-tor-hidden-service-operator-busted-for-child-porn-distribution/), half of the hidden sites on Tor are now down, apparently connected to the arrest of a man allegedly behind Freedom Hosting, a hosting service for Tor hidden services. Some of these sites were said to offer illegal content and were apparently run by the FBI for two weeks, using a Javascript-based browser exploit to try to find their users. This has had no effect on Freenet and could not happen on Freenet. Tor hidden services are centralised: A hidden service on Tor is run by a single server somewhere, and if this server is found, the whole site can be shut down, or compromised. In this case half the hidden sites on Tor were run on the same group of servers! See the [Tor blog](https://blog.torproject.org/blog/hidden-services-current-events-and-freedom-hosting) and [mailing list](https://lists.torproject.org/pipermail/tor-announce/2013-August/000089.html). On Freenet, anything you upload is distributed across the network across thousands of separate nodes all over the world, and will remain available for as long as it remains sufficiently popular: Freenet is a distributed data storage network designed to prevent censorship, provide anonymity and be hard to block. To see more information on the difference between Freenet and Tor, see [our explanation in the FAQ](https://freenetproject.org/faq.html#tor). Also, the Javascript exploit mentioned would not have worked on Freenet because Freenet removes Javascript by default. The Tor Browser Bundle has an option to block Javascript. We recommend that you enable this if you use Tor. Furthermore, there was no attack against Tor itself: As far as we know, no users of the major "darknets" (Freenet, Tor and I2P) has been traced by attacking the networks, by law enforcement or anyone else. In this case, it appears to have been user error, not a problem with Tor itself. Similarly on Freenet, users need to be careful, and Freenet will often tell you when you are about to do something risky. Having said that, Freenet's security is not perfect, and there are some known (but theoretical) weaknesses, so it might be possible for an attacker with relatively limited resources to trace individual Freenet contributors. Most of Freenet's weaknesses can be addressed by making long-lived connections with people that you trust, i.e. building a friend-to-friend "darknet". This functionality is already a part of the regular Freenet software, but we need more users who use Freenet in friend-to-friend mode to improve anonymity. We have planned further improvements, which should greatly improve security (censorship resistance, anonymity and resistance to blocking), speed and usability. The expanding online surveillance from both governments (e.g. PRISM) and private corporations clearly show that tools such as Freenet, TOR and I2P are essential for a healthy democracy. Please help us secure freedom of access to information by contributing to the Freenet-project with code, donations, translations, or just by running a node or creating content (anonymously)! Volunteers - especially developers - are always very welcome. Feel free to contact us, through [IRC online chat](help.html#irc), [the mailing lists](help.html#mailing-lists), or on Freenet itself in the "freenet" board on FMS. For press enquiries please contact [Ian Clarke](mailto:ian@freenetproject.org).
es: De acuerdo con [la prensa](http://arstechnica.com/tech-policy/2013/08/alleged-tor-hidden-service-operator-busted-for-child-porn-distribution/), la mitad de los sitios ocultos en Tor ahora están caídos, lo que aparentemente está conectado con el arresto de un hombre presuntamente detrás de Freedom Hosting, un servicio de alojamiento para servicios ocultos de Tor. Se decía que algunos de estos sitios ofrecían contenido ilegal y aparentemente fueron operados por el FBI durante dos semanas, usando un exploit de navegador basado en Javascript para tratar de encontrar a sus usuarios. Esto no ha tenido ningún efecto en Freenet, tampoco podría ocurrir ahí. Los servicios ocultos de Tor son centralizados. Un servicio oculto en Tor está operado por un único servidor en alguna parte, y si se encuentra este servidor, todo el sitio puede ser clausurado, o comprometido. ¡En este caso la mitad de los sitios ocultos en Tor estaban operados en el mismo grupo de servidores! Vea el [blog de Tor](https://blog.torproject.org/blog/hidden-services-current-events-and-freedom-hosting) y la [lista de correo](https://lists.torproject.org/pipermail/tor-announce/2013-August/000089.html). En Freenet, cualquier cosa que suba se distribuye por toda la red entre miles de nodos distintos por todo el mundo, y permanecerá disponible en tanto siga siendo suficientemente popular: Freenet es una red de almacenamiento de datos distribuida diseñada para evitar la censura, proporcionar anonimato y ser difícil de bloquear. Para ver más información sobre la diferencia entre Freenet y Tor, vea [nuestra explicación en las preguntas frecuentes (FAQ)](https://freenetproject.org/faq.html#tor). Además, el exploit Javascript mencionado no habría funcionado en Freenet porque Freenet elimina el Javascript de forma predeterminada. El Paquete de Navegador Tor tiene una opción para bloquear el Javascript. Recomendamos que la habilite si usa Tor. Más aún, no hubo un ataque contra el propio Tor: Por lo que sabemos, ningún usuario de las principales "darknets" (Freenet, Tor e I2P) ha sido rastreado atacando las redes, ni por agentes de la ley ni por cualquier otro. En este caso, parece haber sido un error del usuario, no un problema con el propio Tor. De modo similar, en Freenet los usuarios han de tener cuidado, y a menudo Freenet le dirá cuándo está a punto de hacer algo arriesgado. Dicho eso, la seguridad de Freenet no es perfecta, y hay algunas debilidades conocidas (pero teóricas), así que podría ser posible para un atacante con recursos relativamente limitados rastrear a contribuidores individuales de Freenet. La mayoría de las debilidades de Freenet se pueden afrontar estableciendo conexiones longevas con personas en las que confíe, es decir, construyendo una "darknet" amigo-a-amigo. Esta funcionalidad ya es una parte del software regular de Freenet, pero necesitamos más usuarios que usen Freenet en modo amigo-a-amigo para mejorar el anonimato. Hemos planeado mejoras adicionales que deberían mejorar enormemente la seguridad (resistencia a la censura, anonimato, y resistencia al bloqueo), la velocidad y la usabilidad. La expansiva vigilancia en línea tanto por parte de gobiernos (ej. PRISM) como de corporaciones privadas, muestra claramente que herramientas como Freenet, TOR e I2P son esenciales para una democracia saludable. ¡Por favor, ayúdenos a asegurar la libertad de acceso a la información contribuyendo al proyecto Freenet con código, donaciones, traducciones, o simplemente ejecutando un nodo o creando contenidos (anónimamente)! Los voluntarios - especialmente los desarrolladores - siempre son bienvenidos. Tómese la libertad de contactar con nosotros a través del [chat IRC en línea](help.html#irc), [las listas de correo](help.html#mailing-lists), o en la propia Freenet mediante el foro "freenet" en FMS. Para cuestionarios periódisticos, por favor, contacte con [Ian Clarke](mailto:ian@freenetproject.org).

source: 2013-06-26 - Freenet gets a second paid developer to fix the Web of Trust!
es: 2013-06-26 - ¡Freenet consigue un segundo desarrollador pagado para reparar Web of Trust!
zh_cn: 2013-06-26 - Freenet 得到了第二名付费开发者来修复 Web of Trust！

source: Long time coder xor (also known as p0s) has agreed to work, in a paid role, for us on fixing the Web of Trust plugin. This is a crucial component of many Freenet plugins: * **Sone**, an anonymous social network / microblogging tool. * **Freemail**, a private and untraceable email over Freenet system. * A filesharing system as yet unnamed which a student is working on. * Extensions to Infocalypse, being worked on by another student, a tool for managing source code which is vital to developing software over Freenet. See the Freenet Social Networking Guide for how to load the first 2 plugins. xor is well qualified for the role as he wrote most of the current code in the Web of Trust. The immediate priority will be to improve stability and performance by implementing a new more efficient FCP API. After that further optimisations are planned. Freenet relies on unpaid volunteer developers as well as a few key paid developers. Toad (Matthew Toseland) is returning to full time work for Freenet after a study break, although he is off to university in October, and xor is just starting working for Freenet. Improving the Web of Trust should substantially improve the performance of the key tools mentioned above and may be used by more in the future. Thanks to all our developers and donors!
es: El programador de larga trayectoria xor (también conocido como p0s) ha accedido a trabajar, de forma remunerada, para nosotros reparando el complemento Web of Trust. Este es un componente crucial para muchos complementos de Freenet. * **Sone**, una red social / herramienta de microblogging anónima. * **Freemail**, un sistema privado y no rastreable de correo electrónico sobre Freenet. * Un sistema de ficheros aún sin denominación sobre el que está trabajando un estudiante. * Extensiones a Infocalypse, sobre las que está trabajando otro estudiante, una herramienta para gestionar código fuente que es vital para desarrollar software sobre Freenet. Vea la Guía de Redes Sociales de Freenet para conocer cómo cargar los 2 primeros complementos. xor está bien cualificado para el puesto ya que escribió la mayoría del actual código en el complemento Web of Trust. La inmediata prioridad será mejorar la estabilidad y el rendimiento implementando una nueva y más eficiente API de FCP (protocolo de cliente de Freenet). Tras esta están planeadas optimizaciones adicionales. Freenet se basa en desarrolladores voluntarios no remunerados, así como unos pocos desarrolladores clave remunerados. Toad (Matthew Toseland) está volviendo al trabajo a tiempo completo para Freenet tras una pausa por estudios, aunque ha salido para ir a la universidad en octubre; y xor tan solo está comenzando a trabajar para Freenet. Mejorar el complemento Web of Trust debe mejorar sustancialmente el rendimiento de las herramientas clave mencionadas arriba, y se puede que se use para más cosas en el futuro. ¡Gracias a todos nuestros desarrolladores y donantes!

source: 2012-09-11 - Response to the University of Hawaii's "Experimental Study of Accountability in Existing Anonymous Networks"
es: 2012-09-11 - Respuesta al "Estudio experimental sobre responsabilidad en las redes anónimas existentes" de la Universidad de Hawaii.
zh_cn: 2012-09-11 - 响应夏威夷大学的 "Experimental Study of Accountability in Existing Anonymous Networks"
