Repository: hyphanet/website
Catalog: locale/*/LC_MESSAGES/freenet_site.po
Languages: es, zh_cn

source: The main datastore does not store data you request or insert (or that is requested or inserted by nearby nodes), because it can be probed by other nodes: This was introduced to fix [this attack]( http://www.theregister.co.uk/2005/05/13/freener_not_so_anonymous/) publicised by The Register. Freenet has a separate client-cache, which stores data which you have recently requested to avoid having to go back to the network every time (which would not only reduce speed but also security, by giving attackers more opportunities to see your requests). Also, Freenet stores the list of your downloads and uploads (which you can see on the Filesharing menu), their current progress, and various other data, in the file node.db4o (or node.db4o.crypt). The actual data is kept in the persistent-temp-* directory. Unless you set the physical security level to LOW, this data is encrypted. At MAXIMUM, the encryption keys are never written to disk, so the data is effectively wiped on restarting the node; otherwise the encryption keys are stored in a file called master.keys (on HIGH this is passworded). You can wipe the data by either using the panic button on the downloads/uploads page or by securely deleting master.keys. Freenet also creates temporary files for other requests, which are also encrypted unless physical seclevel is LOW, which are in temp-*. Also, some plugins may create their own data files, which may contain for instance messages you have posted or downloaded from chat forums, and currently bookmarks and recently completed files are stored in plain text. It is our intention to move these into node.db4o or store them in separate encrypted databases, as soon as we have automatic backups for node.db4o. See [here]( https://wiki.freenetproject.org/Program_files) for details on some of the files.
es: El almacenamiento de datos principal no guarda datos que usted pide o inserta (o que están pedidos o insertados por nodos cercanos), porque pueden ser sondeados por otros nodos: Esto fue introducido para corregir [este ataque](http://www.theregister.co.uk/2005/05/13/freener_not_so_anonymous/) hecho público por The Register. Freenet tiene una caché de cliente aparte, que almacena datos que ha solicitado recientemente para evitar tener que regresar a la red cada vez (lo que no sólo reduciría la velocidad sino también la seguridad, al proporcionar a los atacantes más oportunidades para ver sus peticiones). Además, Freenet almacena la lista de sus descargas y subidas (que puede ver en el menú de Compartición de Ficheros), el progreso actual, y varios otros datos, en el fichero node.db4o (o node.db4o.crypt). Los datos reales se conservan en el directorio persistent-temp-*. A menos que establezca el nivel de seguridad física a BAJO, estos datos se cifran. A nivel MÁXIMO, las claves de cifrado nunca se escriben a disco, así que los datos se limpian de forma efectiva al reiniciar el nodo; de otro modo las claves de cifrado se almacenan en un fichero llamado master.keys (a nivel ALTO este está protegido con contraseña). Puede limpiar los datos bien usando el botón de pánico en la página descargas/subidas o borrando de forma segura el fichero master.keys. Freenet también crea ficheros temporales para otras peticiones, que también se cifran, a menos que el nivel de seguridad física sea BAJO, que se ubican en temp-*. Además, algunos complementos pueden crear sus propios ficheros de datos, que pueden contener, por ejemplo, mensajes que ha publicado o descargado de foros de chat, y actualmente los marcadores y los ficheros completados recientemente se guardan en texto sin cifrar. Es nuestra intención mover a estos a node.db4o o guardarlos en bases de datos cifradas aparte, tan pronto como tengamos copias de seguridad automáticas para node.db4o. Mire [aquí](https://wiki.freenetproject.org/Program_files) para ver detalles de algunos de los ficheros.

source: Windows SmartScreen filter warns the Freenet installer might put my PC at risk. What's going on?
es: El filtro Windows SmartScreen advierte que el instalador de Freenet podría poner mi PC en riesgo. ¿Qué está pasando?
zh_cn: Windows SmartScreen 过滤器警告 Freenet 安装程序可能使我的计算机陷入危险。这是怎么回事？

source: [SmartScreen][url_smartscreen] is sometimes incorrect in classifying a file as dangerous. We believe our installer is not infected with malicious software, and if you are a developer you can check the installer source code [here][url_installer].
es: [SmartScreen][url_smartscreen] a veces clasifica incorrectamente un fichero como peligroso. Creemos que nuestro instalador no está infectado con software malicioso, y si usted es un desarrollador puede comprobar el código fuente del instalador [aquí][url_installer].

source: Has anyone ever faced legal trouble for their anonymous activities conducted on Freenet?
es: ¿Alguien ha afrontado alguna vez problemas legales por sus actividades anónimas desarrolladas en Freenet?

source: Yes. There is one such instance that we know of. United States law enforcement can identify anonymous users of [Freenet][f] and [Tor][t]. Without further information we do not know how they did this, but we suspect it affects people using the network security level "normal" or lower. It is reasonable to assume that other governments have access to the same technology, which is provided by private contractors. If you are concerned about governments, you should use Freenet's capacity to connect only to users you trust, ("high" network security level or higher) and bear in mind that no anonymity technology provides perfect protection. While we applaud law enforcement's apparent success in apprehending suspects allegedly sharing child abuse images, any security flaws they may have used are not limited to such noble usage. Many governments persecute and prosecute political dissidents for legitimate speech published online. Therefore we hope to discover and fix these flaws to protect those who fight for human rights, against corruption, for a peaceful future, and for other legitimate goals.
es: Sí. Hay una caso así del que tenemos conocimiento. Los agentes de la ley de Estados Unidos pueden identificar usuarios anónimos de [Freenet][f] and [Tor][t]. Sin información adicional no sabemos como hicieron esto, pero sospechamos que afecta a personas que usan el nivel de seguridad de red "normal" o inferior a este. Es razonable asumir que otros gobiernos tienen acceso a la misma tecnología que es proporcionada por contratistas privados. Si está preocupado en cuanto a los gobiernos, debe usar la capacidad de Freenet para conectar sólo a los usuarios en los que confíe (nivel de seguridad de red "alto" o superior), y tener en cuenta que ninguna tecnología de anonimato proporciona una protección perfecta. Aunque aplaudimos el aparente éxito de los agentes de la ley en arrestar sospechosos que presuntamente comparten imágenes de abusos a niños, cualquier fallo de seguridad que puedan haber usado no está limitado a tan noble uso. Muchos gobiernos persiguen y encausan a disidentes políticos por su expresión legítima publicada en línea. Por tanto esperamos descubrir y corregir estos fallos para proteger a aquellos que luchan por los derechos humanos, contra la corrupción, para un futuro pacífico, y para otros fines legítimos. Without further information we do not know how they did this, but we suspect it affects people using the network security level "normal" or lower. It is reasonable to assume that other governments have access to the same technology, which is provided by private contractors. If you are concerned about governments, you should use Freenet's capacity to connect only to users you trust, ("high" network security level or higher) and bear in mind that no anonymity technology provides perfect protection. While we applaud law enforcement's apparent success in apprehending suspects allegedly sharing child abuse images, any security flaws they may have used are not limited to such noble usage. Many governments persecute and prosecute political dissidents for legitimate speech published online. Therefore we hope to discover and fix these flaws to protect those who fight for human rights, against corruption, for a peaceful future, and for other legitimate goals.

source: ### Additional information sources * [Wiki FAQ page][url_wiki] * [Security summary][url_security] * [High quality copy of the rabbit icon][url_rabbit_icon]
es: ### Fuentes de información adicional * [Página wiki de preguntas frecuentes (FAQ)][url_wiki] * [Resumen de seguridad][url_security] * [Copia de alta calidad del icono del conejo][url_rabbit_icon]

source: Mailing lists
es: Listas de correo
zh_cn: 邮件列表

source: These are the mailing lists that can be used for support or general information about Freenet.
es: Estas son las listas de correo que pueden ser usadas para soporte o información general acerca del Freenet.

source: ### Subscribing To subscribe to one of the lists, click the list name and give your email address in the field below the **Subscribing to < mailinglist >** header. To enter a password is optional, and if you do not enter one, one will be automatically generated for you. Then press the **Subscribe** button. You will receive a confirmation email, and when that is answered, you will receive mails from the list.
es: ### Suscribirse Para suscribirse a una de las listas, haga clic en el nombre de la lista y proporcione su dirección de correo electrónico en el campo bajo el encabezamiento que dice **Se está suscribiendo a < mailinglist >** . Introducir una contraseña es opcional, y si no introduce una, se generará una automáticamente para usted. Luego pulse el botón **Suscribir**. Recibirá un correo de confirmación, y cuando sea respondido, recibirá correos desde la lista.

source: ### Unsubscribing To unsubscribe to one of the lists you are subscribed to, click the list name and give your subscription email address under the heading **< mailinglist > Subscribers** and press the button **Unsubscribe or edit options**. _**Note**: We constantly get requests of people who want to become unsubscribed._ **YOU** _have to do that yourself! Just click on the www link provided at the bottom of every mail, enter your e-mail address in the text field in section "Subscribers" and provide your password under the unsubscribe option. (You can get your password there as well, in case you forgot it.)_
es: ### Desuscribirse Para desuscribirse de una de la listas a las que está suscrito, haga clic en el nombre de la lista y proporcione el correo electrónico de su suscripción bajo la cabecera **Suscriptores de la < mailinglist >** y pulse el botón **Opciones de desuscripción o edición**. _**Nota**: Constantemente recibimos solicitudes de personas que quieren desuscribirse. ¡Tiene que hacer eso _ **USTED** _ mismo! Tan solo haga clic en el enlace www proporcionado al final de cada correo, introduzca su dirección de correo electrónico en el campo de texto de la sección "Suscriptores", y proporcione su contraseña bajo la opción desuscribir (también puede obtener su contraseña allí, en caso de que la olvidara)._

source: ### The lists * [Support](https://emu.freenetproject.org/cgi-bin/mailman/listinfo/support/) ([archive](https://emu.freenetproject.org/pipermail/support/))<br/> Asking for or giving advice relating to getting Freenet working, bug reports, and suggestions on improving the user experience. Requests for help are more likely to be heard here than in the other mailing lists. **Note**: Emails sent to this mailing list from those not subscribed to the list must be manually approved, and this can impose a delay of several days. To avoid this delay, please [subscribe](https://emu.freenetproject.org/cgi-bin/mailman/listinfo/support/). * [Development](https://emu.freenetproject.org/cgi-bin/mailman/listinfo/devl/) ([archive](https://emu.freenetproject.org/pipermail/devl/))<br/> This list is for active developers to discuss bugs, and the implementation of near-term new features. _**Third party tools**: We are hosting some other mailing lists on our server. Here is the [full list][url_listinfo]._
es: ### Las listas de correo * [Soporte](https://emu.freenetproject.org/cgi-bin/mailman/listinfo/support/) ([archivo](https://emu.freenetproject.org/pipermail/support/))<br/> Preguntas y consejos en relación a poner Freenet en funcionamiento, informes de fallos, y sugerencias de mejora de la experiencia del usuario. Las peticiones de ayuda es más probable que sean escuchadas aquí que en las otras listas de correo. **Nota**: Los correos enviados a esta lista por parte de aquellos no suscritos deben ser aprobados manualmente, y esto puede suponer un retardo de varios días. Para evitar este retraso, por favor, [suscríbase](https://emu.freenetproject.org/cgi-bin/mailman/listinfo/support/). * [Desarrollo](https://emu.freenetproject.org/cgi-bin/mailman/listinfo/devl/) ([archivo](https://emu.freenetproject.org/pipermail/devl/))<br/> Esta lista es para que los desarrolladores activos discutan fallos, y la implementación de nuevas características a corto-plazo. _**Herramientas de terceros**: Estamos alojando algunas otras listas de correo en nuestro servidor. Aquí tiene la [lista completa][url_listinfo]._

source: Suggestions
es: Sugerencias
zh_cn: 建议

source: Get Support
es: Obtenga soporte

source: If you need help installing Freenet for the first time, or have trouble using Freenet and can't find an answer to your problem in the [FAQ][faq_link] above or in the [Knowledge Base][kb_link], please create a new discussion on our support forum. When writing your support request, please make sure you include a full description of the problem, your current version of Java, your operating system and current Freenet version.
es: Si necesita ayuda para instalar Freenet por primera vez, o si tiene problemas usando Freenet y no puede encontrar una respuesta a su problema en las [Preguntas Frecuentes (FAQ)][faq_link] de arriba, o en la [Base de Conocimiento (KB)][kb_link], por favor, cree una nueva discusión en nuestro foro de soporte. Cuando escriba su petición de soporte, por favor, asegúrese de incluir una descripción completa del problema, la versión actual de su Java, su sistema operativo y su versión actual de Freenet.

source: Create a support discussion
es: Crear una discusión de soporte

source: Chat with us
es: Charle con nosotros
zh_cn: 与我们聊聊

source: Many of the developers and users of Freenet are on the [IRC]( https://en.wikipedia.org/wiki/IRC) channel #freenet on chat.freenode.net.
es: Algunos de los desarrolladores y usuarios de Freener estan en el canal [IRC](https://en.wikipedia.org/wiki/IRC) #freenet en chat.freenode.net.
zh_cn: 许多 Freenet 的开发者和用户在这个 [IRC]( https://en.wikipedia.org/wiki/IRC) 频道: chat.freenode.net 上的 #freenet 频道。

source: Setup
es: Instalar
zh_cn: 安装

source: Help
es: Ayuda
zh_cn: 帮助

source: Leap over censorship<br> Escape total surveillance
es: Supere la censura<br> Escape a la vigilancia total

source: Freenet is a peer-to-peer platform for censorship-resistant communication and publishing. Browse websites, post on forums, and publish files within Freenet with strong privacy protections.
es: Freenet es una plataforma entre pares (P2P) para comunicación y publicación resistente a la censura. Navegue por sitios web, converse en foros, y publique ficheros dentro de Freenet con protecciones de privacidad fuertes.

source: read more…
es: lea más...
zh_cn: 了解更多…

source: Help keep Internet freedom alive and expand human liberty! Support another year of paid development. [Learn more about our fundraiser.][url_fundraiser]
es: ¡Ayude a mantener viva la libertad en Internet y expanda la libertad humana! Apoye otro año de desarrollo pagado. [Conozca más acerca de nuestro sistema de recogida de fondos.][url_fundraiser]
zh_cn: 帮助捍卫互联网自由和人类自由！支持下一年的有偿开发。[了解我们的投资人。][url_fundraiser]

source: Donate!
es: Donar!
zh_cn: 捐款！

source: The Freenet Project Inc is a non-profit 501(c)(3) organization.
es: The Freenet Project Inc es una organización sin animo de lucro 501(c)(3).
zh_cn: The Freenet Project Inc 是一个 501(c)(3) 非盈利组织。

source: Donations are tax-deductible.
es: Las donaciones (generalmente) son deducibles fiscalmente.
zh_cn: 捐款可以免税。

source: Secret Identity
es: Identidad secreta
zh_cn: 秘密身份

source: Create a secret identity so nobody knows who you are.
es: Cree una identidad secreta para que nadie sepa quien es usted.
zh_cn: 创建一个秘密身份，没人知道您是谁。

source: Browse Websites
es: Navegación por sitios web
zh_cn: 浏览网站

source: Freenet is home to sites ranging from programming to sustainable living.
es: Freenet es el hogar de sitios que van desde programación hasta vida sostenible.
zh_cn: 从编程网站到绿色生活网站，Freenet 都是您的家。

source: Forums
es: Foros
zh_cn: 论坛

source: Ask questions and exchange ideas.
es: Haga preguntas e intercambie ideas.
zh_cn: 提出问题和交换想法。

source: Publish
es: Publicación
zh_cn: 发布

source: Publish anonymously without need for a server.
es: Publíque anónimamente sin necesidad de un servidor.
zh_cn: 发布匿名信息，无需服务器。

source: Share Files
es: Compartir Archivos
zh_cn: 分享文件

source: Easy upload & download.
es: Fácil carga & descarga.
zh_cn: 轻松上传和下载。

source: Platform
es: Plataforma
zh_cn: 平台

source: Write your own applications on the Freenet platform.
es: Escriba sus propias aplicaciones en la platafrma Freenet.
zh_cn: 在 Freenet 平台上编写您自己的应用程序。

source: Resistant
es: Resistente
zh_cn: 坚实

source: Freenet has been designed to be resistant to attacks and censorship.
es: Freenet ha sido diseñada para ser resistente a ataques y cesura.
zh_cn: Freenet 专为抵御攻击和网络审查而设计。

source: Distributed
es: Distribuida
zh_cn: 去中心化

source: No central points of failure, efficient caching of popular content.
es: No hay puntos centrales de falla, eficiente almacenamiento en caché del contenido popular.
zh_cn: 无中心故障点，流行内容高效缓存。

source: Proven
es: Probado
zh_cn: 成熟

source: Based on solid research and in practical use for 15 years.
es: Basado en una investigación solida y en un uso práctico por 15 años.
zh_cn: 基于扎实研究，并已实际使用15年。

source: Share, Chat, Browse. Anonymously.
es: Comparta, Converse, Navegue. Anonimamente.
zh_cn: 分享，聊天，浏览。不露踪迹

source: Latest News
es: Últimas noticias
zh_cn: 最新消息

source: Overview
es: Información general
zh_cn: 概述

source: Donate today.
es: Done hoy.
zh_cn: 今天就捐款吧！

source: 2016-06-25 - Freenet build 1475 released
es: 2016-06-25 - Se publicó Freenet build 1475

source: (This news item was not published until July 16th. Sorry for the delay.) Freenet 0.7.5 build 1475 is now available. Build 1474 was an emergency release which [fixed a denial of service attack][announcement1474] which prevented the node from processing other requests after processing a malicious request. This build contains the months of work which were not included in the emergency release. It will become mandatory on July 15th. Highlights: - Warn that Java 7 is End of Life. (Please update!) - Improve load balancing. - Add support for HTML5 audio tags. - Fix a major bug that might explain the poor connectivity since 1473. For more details see the [announcement email][announcement1475].
es: (Este elemento de noticias no fue publicado hasta el 16 de julio, lo sentimos por el retraso) Freenet 0.7.5 build 1475 ahora está disponible. La build 1474 fue una versión de emergencia que [remediaba un ataque de denegación de servicio][announcement1474] que evitaba que el nodo procesara otras peticiones tras procesar una petición maliciosa. Esta build contiene el trabajo de meses que no estaba incluido en la versión de emergencia. Será obligatoria el 15 de julio. Destacados: - Advierte que Java 7 está en el final de su vida (¡Por favor, actualice!) - Mejora el balance de carga. - Añade soporte para etiquetas de audio HTML5. - Corrige un fallo principal que podría explicar la pobre conectividad desde la 1473. Para más detalles vea el [correo anunciándola][announcement1475].

source: 2016-05-26 - Police department's tracking efforts based on false statistics
es: 2016-05-26 - Los esfuerzos de rastreo del departamento de Policía están basados en estadísticas falsas
