Repository: hyphanet/website
Catalog: locale/*/LC_MESSAGES/freenet_site.po
Languages: es, zh_cn

source: Freenet is a self-contained network, while Tor allows accessing the web anonymously, as well as using "hidden services" (anonymous web servers). Freenet is not a proxy: You cannot connect to services like Google or Facebook using Freenet. However, Freenet has websites, filesharing, forums, chat, microblogging, email etc, all anonymous and hosted within Freenet. Freenet is a distributed datastore, so once content is uploaded to Freenet, it will remain on Freenet forever, as long as it remains popular, without fear of censorship or denial of service attacks, and without needing to run your own web server and keep it online constantly. The other big difference is that Freenet has the "darknet" or Friend to Friend mode, where your Freenet node (software on your computer) only connects to the Freenet nodes run by your friends, i.e. people you know (and maybe to their friends, to speed things up). This makes blocking Freenet, e.g. on a national firewall, extremely difficult.
es: Freenet es una red auto-contenida, mientras Tor permite acceder a la web de forma anónima además de usar "servicios ocultos" (servidores web anónimos). Freenet no es un proxy (interpuesto): No puede conectar a servicios como Google o Facebook usando Freenet. Sin embargo, Freenet tiene sitios web, compartición de ficheros, foros, chat, microblogging, correo electrónico, etc, todos anónimos y alojados en el interior de Freenet. Freenet es un almacenamiento de datos distribuido, así que una vez que el contenido se sube a Freenet, permanecerá en Freenet para siempre, mientras continúe siendo popular, sin temor a la censura o a ataques de denegación de servicio (DoS), y sin necesidad de ejecutar su propio servidor web y mantenerlo en línea constantemente. La otra gran diferencia es que Freenet tiene la "darknet" (red oscura) o el modo Amigo a Amigo, donde su nodo Freenet (software en una computadora) sólo conecta a los nodos Freenet ejecutados por sus amigos, es decir, con personas que conoce (y quizá con los amigos de estos, para acelerar las cosas). Esto hace el bloqueo de Freenet, ej. mediante un cortafuegos (firewall) nacional, extremadamente difícil.
zh_cn: Freenet 是一个独立封闭的网络，而 Tor 允许匿名访问 Web，以及使用“隐藏服务”（匿名 Web 服务器）。Freenet 不是一个代理服务器：您不能使用 Freenet 连接到 Google 或 Facebook 等服务。但是，Freenet 有自己的网站、文件分享、论坛、聊天、微博、Email 系统等。所有这些服务都是匿名的存在于 Freenet 网络中。 Freenet 是一个分布式数据存储，因此一旦内容上传到 Freenet，只要它有人访问，就会永远存在于 Freenet 中，不怕内容审查或拒绝服务攻击，也不需要自己搭建服务器并保持在线。 另一个很大的不同是 Freenet 有自己的“暗网”，也称为好友对好友模式。在这个模式下，您的 Freenet 节点（安装在您电脑中的 Freenet 软件）只会连接到您的好友的 Freenet 节点，也就是连接到您认识的人（根据设置，还可以连接到他们的好友节点，以提高速度）。这使得封锁 Freenet（比如通过国家防火墙封锁）几乎是不可能的。

source: However, most people currently use Freenet in "opennet" mode (that is, connecting automatically to whoever the network assigns, rather than connecting only to their friends). This is much less secure than using Freenet in "darknet" mode, and is relatively easy to block, as it does have some central servers ("seed nodes"). Freenet has many unsolved problems, and is still experimental. Our objective for Freenet is to build a global friend-to-friend darknet, which would be extremely difficult to block, and would provide very strong anonymity and censorship resistance. This will require further work on Freenet, on usability, speed and security, but above all it is a techno-social experiment: Will people know enough friends who are willing to use Freenet to make such an anonymous friend-to-friend network possible? This is why Freenet supports "opennet" mode: to let people try it out before they ask their friends to connect. Tor is a little less experimental, and arguably is an easier problem; it may provide better anonymity today, provided that it isn't blocked, and of course, Tor lets you access the internet as a whole, whereas on Freenet you can only access Freenet content. However if you can use a large enough darknet, Freenet already provides an interesting level of censorship resistance, DoS resistance and anonymity.
es: Sin embargo, la mayoría de la gente usa Freenet en modo "opennet" (red abierta, conectando automáticamente con quien quiera que asigne la red, en lugar de conectar sólo con sus amigos). Esto es mucho menos seguro que usar Freenet en modo "darknet" (red oscura), y es relativamente fácil de bloquear, ya que tiene algunos servidores centrales ("seed nodes"). Freenet tiene muchos problemas no resueltos, y aún es experimental. Nuestro objetivo para Freenet es construir una darknet global amigo-a-amigo, que sería extremadamente difícil de bloquear, y proporcionaría un anonimato y resistencia a la censura muy fuertes. Esto requerirá trabajo adicional en Freenet, en usabilidad, velocidad y seguridad, pero por encima de todo es un experimento tecno-social: ¿Conocerá la gente suficientes amigos que estén dispuestos a usar Freenet para hacer posible una red anonima amigo-a-amigo tal? Este es el porqué Freenet soporta el modo "opennet": para permitir a la gente probarlo antes de que pidan a sus amigos que se conecten. Tor es un poco menos experimental, y se puede argumentar que es un problema más fácil; puede proporcionar un mejor anonimato hoy, dado que no está bloqueado, y por supuesto, Tor le permite acceder a Internet al completo, mientras en Freenet sólo puede acceder al contenido de Freenet. Sin embargo, si puede usar una darknet suficientemente grande, Freenet ya proporciona un nivel interesante de resistencia a la censura, resistencia a ataques DoS, y anonimato.
zh_cn: 但是，目前大多数人都在“Opennet”模式下使用 Freenet（他们的 Freenet 连接到网络自动分配的节点，而不是他们的好友）。这种方式远没有 Freenet 的“暗网”模式安全，很容易被封禁，并且也需要一些中心化的服务器（“种子节点”）。 Freenet 还有许多未解决的问题，仍然处于试验阶段。我们对 Freenet 的目标是建立一个全球的好友对好友的暗网，很难被封禁，有着极强的匿名能力，能够抵御内容审查。这需要更多的工作来完善 Freenet 的易用性、性能和安全性。但是更重要的是，这是一个科技社会的试验：人们是否认识足够的好友，愿意使用 Freenet 来建立这个好友对好友的网络？这就是为什么 Freenet 也同时支持“Opennet”模式：让更多的人在推荐其好友连接之前自己先试试看。 Tor 没有那么多的试验性质，是一个相对容易论证的问题。只要它不被封，它在今日能够提供更好的匿名性（相对于 Freenet 的“Opennet”模式）。另外 Tor 还可以让您访问整个互联网，而使用 Freenet 您只能访问 Freenet 网络的内容。但是如果您可以访问整个 Freenet 暗网，现阶段的 Freenet 已经能够提供非常出色的反内容审核、抵御拒绝服务攻击和匿名的能力。

source: Using the internet "anonymously" is not necessarily easy: Connecting to Facebook through Tor doesn't prevent Facebook from knowing pretty much everything about you, and connecting to your (non-HTTPS) webmail account through Tor may mean the person running the proxy ("exit node") can steal your webmail account password. Freenet is a separate network, which does things differently, because there are no central servers. This is why we don't support Javascript, server-side scripting etc on freesites: Everything must be rewritten to work on a distributed network. But the advantage is there is no single server which can be compelled to hand over your private communications or which can be shut down. There are still risks, for example, talking about your home town or internet provider on an anonymous forum, or downloading files which Freenet can't make safe such as PDFs or word processor documents (Freenet will warn you about this). Also, for web content in particular, it may be easier to upload it to Freenet than set up a hidden server on Tor; you don't need to keep your node online for your content to be available, you don't need to figure out how to configure it safely, and most important, if you go away your site will still be available.
es: Usar Internet "anónimamente" no es necesariamente fácil: Conectar a Facebook a través de Tor no evita que Facebook conozca casi todo sobre usted, y conectar a su cuenta de correo web (no-HTTPS) a través de Tor puede significar que la persona que ejecuta el proxy ("nodo de salida") puede robar la contraseña de su cuenta de correo web. Freenet es una red aparte, que hace las cosas de modo diferente, por no hay servidores centrales. Esta es la razón por la que no soportamos Javascript, scripting en el lado del servidor, etc, en los freesites: Todo debe ser reescrito para que funcione en un red distribuida. Pero la ventaja es que no hay un único servidor que pueda ser empujado a ceder sus comunicaciones privadas o que pueda ser cerrado. Todavía hay riesgos, por ejemplo, hablar acerca de su ciudad de residencia o de un proveedor de servicios de Internet en un foro anónimo, o descargar ficheros que Freenet no puede hacer seguros, como PDFs o documentos de procesador de texto (Freenet le advertirá acerca de esto). Además, para el contenido web en particular, puede ser más fácil subirlo a Freenet que establecer un servidor oculto en Tor; no tiene que mantener su nodo en línea para que su contenido esté disponible, no necesita averiguar cómo configurarlo de forma segura, y lo más importante, si se ausenta su sitio aún estará disponible.
zh_cn: 在互联网上实现绝对的“匿名性”并不是那么容易：您可以通过 Tor 连接到 Facebook，但是这并不能阻止 Facebook 了解您的一切。如果您通过 Tor 访问您的（非 HTTPS）Web 邮箱，那么运行 Tor 代理服务器（“出口节点”）的人就可以截取您 Web 邮箱的帐号和密码。 Freenet 则是一个独立的网络，做着完全不同的事情，因为它没有中心化的服务器。这就是为什么对 Freesite 我们不支持 Javascript、服务器端脚本等：一切都必须重写以使其工作在分布式网络。但优点是，没有任何一台服务器可以泄露您的隐私通讯，也无法被关闭。 当然即使有这些保护，危险仍然是存在的。例如，在匿名的论坛谈论您的家乡或 ISP，或者下载那些染毒的 PDF 或 Word 文档（Freenet 会警告您下载它们存在风险）。 另外，对于普通网页，上传到 Freenet 比在 Tor 设置一个隐藏服务器更容易。您不需要保持自己的节点始终在线，也不需要担心网站被攻击，更重要的是，即使您离开，您的网站仍然可以访问。

source: ### Summary: Tor (or I2P): * Lets you access the Internet (but be careful!). * Lets you access anonymous web servers and other services. * Lets you host anonymous web servers, which need to be kept online, and can be DoS'ed, but can run any dynamic or server-side content you want. * Provides reasonable anonymity * Has been blocked by several countries, with varying success. Even its hidden bridges can be harvested and blocked with moderate effort. * Is somewhat centralised * Is more mature and has more users and developers
es: ### Resumen: Tor (o I2P): * Le permite acceder a Internet (¡pero tenga cuidado!). * Le permite acceder a servidores web anónimos y otros servicios. * Le permite alojar servidores web anónimos, que necesitan mantenerse en línea, y pueden ser objeto de ataques DoS, pero que pueden ejecutar cualquier contenido dinámico o del lado-del-servidor que quiera. * Proporciona un anonimato razonable. * Ha sido bloqueado por varios países, con efectividades dispares. Incluso sus repetidores puente (bridges) ocultos pueden ser recopilados y bloqueados con un esfuerzo moderado. * Está centralizado de alguna manera. * Está más maduro y tiene más usuarios y desarrolladores.
zh_cn: ### 总结： Tor（或者 I2P）： * 让你可以访问互联网（但要小心）。 * 让你访问匿名的网页服务器和其他服务。 * 让你匿名托管网页服务器，但服务器必须保持在线，并且可能被 DoS 攻击。但服务器可以运行您需要的任何动态或者服务端的内容。 * 提供合理的匿名性 * 已被数个国家封禁，有着不同的连接成功率。它们的网桥也可以通过一定的努力被抓取并封禁。 * 部分中心化 * 更成熟，有更多的用户和开发者

source: Freenet in general: * Only lets you access content uploaded to Freenet, including (static) websites, email, filesharing, forums, microblogging, etc. All of which are anonymous (or pseudonymous i.e. you create an untraceable identity). * Hosts content in a distributed way: You don't know what your node is storing, any given content is distributed across many nodes. * Ensures that popular content will be available forever. * Is older than Tor, but more experimental (arguably it's a harder task).
es: Freenet en general: * Sólo le permite acceder a contenido subido a Freenet, incluyendo sitios web (estáticos), correo electrónico, compartición de ficheros, foros, microblogging, etc. Todos los cuales son anónimos (o pseudónimos, es decir, puede crear una identidad no rastreable). * Aloja contenidos de forma distribuida: Usted no sabe lo que su nodo está almacenando, cualquier contenido dado se distribuye por muchos nodos. * Garantiza que el contenido popular estará disponible para siempre. * Es más antiguo que Tor, pero más experimental (se puede argumentar que es una tarea más dura).
zh_cn: Freenet 在两种模式下都： * 只允许您访问已上传到 Freenet 的内容，包括（静态的）网站、电子邮件、文件共享、论坛、微博等，所有一切都是匿名的（或者笔名，即创建一个难以追踪的身份）。 * 托管内容是分布式的：您不知道你的存储节点在哪，任何内容均分布在多个节点。 * 确保了流行的内容可以永远存在。 * 早于 Tor，但带有更多的实验性质（可以说这是一个更艰巨的任务）。

source: Freenet in darknet mode: (friend to friend: connects only to your friends' nodes) * Is very hard to block, and this can be improved further with transport plugins. * Provides good anonymity, and with a bit more work it could provide very strong anonymity (PISCES tunnels). * Is fully decentralised: No central servers at all.
es: Freenet en modo darknet (amigo a amigo, conecta sólo con los nodos de sus amigos): * Es muy difícil de bloquear, y esto se puede mejorar más aún con complementos de transportes. * Proporciona un buen anonimato, y con un poco más de trabajo podría proporcionar un anonimato más fuerte (túneles con protocolo PISCES). * Está totalmente descentralizado: No hay servidores centrales en absoluto.
zh_cn: Freenet 在暗网模式：（好友到好友，只连接您好友的节点） * 非常难以封禁，并且这可以通过 Transport 插件进一步提高。 * 提供不错的匿名性，并且未来可以实现非常强的匿名性（PISCES 隧道）。 * 完全分布式：没有任何中心化服务器。

source: Freenet in opennet mode: (connect automatically even if you don't know anyone on Freenet) * Is relatively easy to block. * Provides limited anonymity * Is somewhat centralised
es: Freenet en modo opennet: (conecta automáticamente incluso si no conoce a nadie en Freenet). * Es relativamente fácil de bloquear. * Proporciona un anonimato limitado. * Está centralizado de alguna manera.
zh_cn: Freenet 在 Opennet 模式（即使您不认识使用 Freenet 的人仍可自动连接） * 比较容易被封禁 * 提供有限的匿名性 * 部分中心化

source: Unfortunately most people use Freenet in opennet mode currently. The big question is can we build a global friend-to-friend darknet? Join us and find out!
es: Desafortunadamente la mayoría de la gente usa actualmente Freenet en modo opennet. La gran pregunta es ¿podemos construir una darknet global amigo-a-amigo? ¡Únase a nosotros y averígüelo!
zh_cn: 遗憾的是，大多数使用 Freenet 的人目前运行在 Opennet 模式。一个重大的问题是，我们能否建立一个全球最大的好友到好友的暗网吗？加入我们并找出方法吧！

source: PS for an example of how dependant Tor is on centralised hidden services, see [this](http://www.twitlonger.com/show/n_1rlo0uu) [bust](http://arstechnica.com/tech-policy/2013/08/alleged-tor-hidden-service-operator-busted-for-child-porn-distribution/). Half the hidden services on Tor were using a single hosting service, whose owner has now been arrested. While we don't approve of these sites, it does illustrate the point: A centralised network is a vulnerable network. Unfortunately, decentralised networks are hard, but in the long run they are more secure.
es: P.D. para un ejemplo de cómo de dependiente es Tor de servicios ocultos centralizados, vea [este](http://www.twitlonger.com/show/n_1rlo0uu) [fiasco](http://arstechnica.com/tech-policy/2013/08/alleged-tor-hidden-service-operator-busted-for-child-porn-distribution/). La mitad de los servicios ocultos en Tor estaban usando un único servicio de alojamiento, cuyo propietario ha sido ahora arrestado. Aunque no aprobamos estos sitios, ilustra el argumento: Una red centralizada es una red vulnerable. Desafortunadamente, las redes descentralizadas son difíciles, pero en el largo plazo son más seguras.
zh_cn: 顺带提一下，Tor 依赖于集中式的隐藏服务的例子参见[这个](http://www.twitlonger.com/show/n_1rlo0uu) [事件](http://arstechnica.com/tech-policy/2013/08/alleged-tor-hidden-service-operator-busted-for-child-porn-distribution/)。Tor 上一半的隐藏服务使用单一的托管服务，它们的主人现在已经被捕。虽然我们不赞同这些网站，但它确实说明了一点：一个中心化的网络是脆弱的网络。遗憾的是，分布式网络是艰难的。但从长远来看，它们更加安全。

source: Who is behind Freenet?
es: ¿Quién está detrás de Freenet?
zh_cn: 谁是 Freenet 的幕后人员？

source: Freenet grew out of a design for an anonymous publication system created by Ian Clarke while a student at the University of Edinburgh, Scotland. Since then many other people have contributed towards making Ian's proposal a reality.
es: Freenet surge de un diseño para un sistema de publicación anónimo creado por Ian Clarke mientras era un estudiante en la Universidad de Edimburgo, Escocia. Desde entonces muchas otras personas han contribuido para convertir en realidad las propuestas de Ian.
zh_cn: Freenet 的前身是一个匿名发布系统，由一名学生 Ian Clarke 在爱丁堡大学创造。然后很多人都朝着他的贡献来使其成为现实。

source: If authors are anonymous how can you trust information?
es: ¿Si los autores son anónimos cómo puedo confiar en la información?
zh_cn: 如果作者是匿名的，我该怎么信任信息？

source: Cryptographic signing of information allows people to prove authorship, this technique is frequently used to authenticate authorship of emails. Moreover, you can actually sign information while remaining anonymous, thus having an anonymous persona. You can prove that you wrote different pieces of information on Freenet, without revealing your identity. In this way you can build up an anonymous reputation for reliability.
es: La firma criptográfica de información permite a la gente probar la autoría, esta técnica se usa frecuentemente para autentificar autorías de correos electrónicos. Además, en realidad puede firmar información mientras permanece anónimo, teniendo así un personaje anónimo. Puede probar que usted escribió distintas piezas de información en Freenet sin revelar su identidad. De esta manera puede desarrollar una reputación anónima para fiabilidad.

source: Do I have to donate disk space and bandwidth?
es: ¿Tengo que ceder espacio de disco y ancho de banda?
zh_cn: 我必须贡献磁盘空间和带宽出来？

source: You aren't really donating in the sense that you lose the disk space and the bandwidth; but you aren't really sharing either (at least not the same way as with filesharing programs). It is more like pitching in to the common Freenet resource pool.
es: Realmente no está donando en el sentido de perder el espacio de disco y el ancho de banda; pero tampoco está compartiendo realmente (al menos no de la misma forma que con los programas de compartición de ficheros). Es más como aportar al reservorio común de recursos de Freenet.
zh_cn: 你并没有真正的捐出什么，你的磁盘空间和带宽没有丢失；你也并不是真正的在分享什么（至少与其他文件共享软件不同）。它更像是为公用的 Freenet 资源池铺路。

source: I don't have to donate anything when using filesharing application X and I get to leech more.
es: No tengo que ceder nada cuando uso la aplicación de compartición de ficheros X y consigo sacar mas.
zh_cn: 我使用某某文件共享软件时没有贡献什么，并且得到了更多实惠。

source: Do you get to do that anonymously? Freenet is designed with anonymity in mind, performance comes second.
es: ¿Consigue hacer eso de forma anónima? Freenet está diseñado con el anonimato en mente, el rendimiento en segundo lugar.
zh_cn: 你知道吗，这是为了匿名性。Freenet 的首要设计目标是匿名性，性能屈居第二。

source: All my friends donate very little space and bandwidth. Should I donate more?
es: Todos mis amigos conceden muy poco espacio y ancho de banda. ¿Debería conceder más?

source: If you are happy with what you are getting then no. But if you want more you should consider donating more and running your node as close to 24x7 as possible, and you should ask your friends to do the same.
es: Si está contento con lo que está obteniendo entonces no. Pero si quiere más debe considerar donar más y ejecutar su nodo lo más próximo a 24x7 que sea posible, y debe pedir a sus amigos que hagan lo mismo.

source: If I donate a lot will my experience improve significantly?
es: ¿Si cedo mucho mejorará mi experiencia significativamente?
zh_cn: 如果我贡献很多，能显著改善我的体验吗？

source: Your experience will definitely get better, but for a really great improvement we need more people to start thinking like you. Bandwidth counts more than diskspace.
es: Su experiencia definitivamente mejorará, pero para una mejora realmente grande necesitamos que más gente comience a pensar como usted. El ancho de banda cuenta más que el espacio de disco.
zh_cn: 你的体验肯定会更好，但对于一个显著的改善，我们需要更多人开始这样做。带宽比磁盘空间更重要。

source: Is Freenet legal?
es: ¿Es legal Freenet?
zh_cn: Freenet 合法吗？

source: We don't currently know of any prosecutions for merely using Freenet. Some people claim that the [DADVSI](https://en.wikipedia.org/wiki/DADVSI) makes Freenet illegal in France; the German data retention law might have required logging, but [was struck down](http://en.wikipedia.org/wiki/Telecommunications_data_retention#Germany). Also, the German supreme court has found that [not securing your wifi properly](http://merlin.obs.coe.int/iris/2010/7/article13.en.html) makes you responsible for other people's downloads over it; this might or might not be extended to prohibiting anonymous peer to peer filesharing such as Freenet. [ACTA](http://en.wikipedia.org/wiki/ACTA) might have wide-ranging effects, including on Freenet, should it pass, and similar laws such as IPRED2 have been tried in the past. There have also been attempts to force peer to peer systems to provide wiretapping capabilities in the USA, and there are [worrying developments](http://www.bbc.co.uk/news/uk-politics-19968068) in the UK that might result in it being blocked, but not being made illegal per se. As far as we know none of these things - apart from the first two - have passed. Many of these are arguable either way (depending on how broadly the legislation is applied) and will have to be decided in caselaw. The law can be an ass sometimes. You can read the EFF's (US-centric) advice to peer to peer developers [here]( https://www.eff.org/wp/iaal-what-peer-peer-developers-need-know-about-copyright-law). If you need legal advice, talk to a lawyer. Also read the next section especially if you are in China; blocking the protocol may suggest the authorities don't like us!
es: Actualmente no sabemos de ninguna persecución por el mero hecho de usar Freenet. Algunas personas afirman que la ley [DADVSI](https://en.wikipedia.org/wiki/DADVSI) hace que Freenet sea ilegal en Francia; la ley de retención de datos alemana podría haber requerido llevar registros, pero [fue tumbada](http://en.wikipedia.org/wiki/Telecommunications_data_retention#Germany). Además, la corte suprema alemana ha fallado que [no asegurar su wifi adecuadamente](http://merlin.obs.coe.int/iris/2010/7/article13.en.html) le hace responsable de las descargas que otras personas realicen sobre él; esto podría o no extenderse a la prohibición de la compartición de ficheros entre pares (P2P) anónima, como la de Freenet. [ACTA](http://en.wikipedia.org/wiki/ACTA) podría tener efectos de más amplio rango, incluyendo Freenet, si es aprobada, y leyes similares tales como IPRED2 se han propuesto en el pasado. También ha habido intentos de forzar que los sistemas entre pares proporcionaran capaciades de escucha en EEUU, y hay [desarrollos preocupantes](http://www.bbc.co.uk/news/uk-politics-19968068) en Reino Unido que podrían resultar en que sean bloqueados, pero sin ilegalizarlos per se. Hasta donde conocemos, ninguna de estas cosas - aparte de las dos primeras - se han aprobado. Muchas de estas son discutibles de todos modos (dependiendo de cómo de ampliamente se aplique la legislación) y tendrán que decidirse en base a jurisprudencia. La ley a veces apesta. Puede leer el consejo a los desarrolladores de software P2P desde la EFF (EEUU-céntrica) [aquí](https://www.eff.org/wp/iaal-what-peer-peer-developers-need-know-about-copyright-law). Si necesita consejo legal, hable con un abogado. Lea también la siguiente sección, especialmente si está en China; ¡que bloqueen el protocolo puede sugerir que no gustamos a las autoridades!

source: Is Freenet blocked by national firewalls?
es: ¿Está Freenet bloqueado por cortafuegos (firewalls) nacionales?
zh_cn: Freenet 被国家防火墙封锁吗？
