Repository: hyphanet/website
Catalog: locale/*/LC_MESSAGES/freenet_site.po
Languages: es, zh_cn

source: The Chinese national firewall (Golden Shield) has blocked our website for many years, and was observed in 2005 to block the 0.5 protocol as well. This suggests China doesn't like us, so be careful if you run Freenet in China. Some other countries (e.g. France) are known to be hostile to peer to peer, and may eventually force ISPs to block peer to peer networks (but right now Freenet works fine in France and we have many French users!). Technically, Freenet 0.7 has some minimal defences against blocking; the protocol is relatively hard to identify (we are working on ["transport plugins"](https://wiki.freenetproject.org/Transport_plugins), which would [make it much harder to detect Freenet](http://en.wikipedia.org/wiki/Steganography). Freenet supports a [darknet](https://wiki.freenetproject.org/Darknet) mode (i.e. only connecting to your friends) which makes automated harvesting and blocking of nodes very difficult. Note that many mobile internet providers block all peer to peer networks along with other content, and many corporate or academic networks may block Freenet (but even if they don't, see [you shouldn't run Freenet at work](#trouble) for non-work purposes!).
es: El cortafuegos (firewall) nacional chino (Escudo Dorado) ha bloqueado nuestro sitio web durante muchos años, y además en 2005 se observó que bloqueó el protocolo 0.5. Esto sugiere que no le gustamos a China, así que tenga cuidado si ejecuta Freenet en China. Algunos otros países (ej. Francia) son conocidos por ser hostiles con el software de intercambio entre pares, y puede que eventualmente fuercen a los ISPs a bloquear las redes P2P (¡pero por ahora Freenet funciona bien en Francia y tenemos muchos usuarios franceses!). Técnicamente, Freenet 0.7 tiene algunas defensas mínimas contra el bloqueo; el protocolo es relativamente difícil de identificar (estamos trabajando en ["complementos de transporte"](https://wiki.freenetproject.org/Transport_plugins), que [harían Freenet mucho más difícil de detectar](https://es.wikipedia.org/wiki/Esteganografía). Freenet soporta un modo [darknet](https://wiki.freenetproject.org/Darknet) (es decir, conecta sólo con sus amigos) lo que hace muy difícil la recopilación y bloqueo de nodos automática. Observe que muchos proveedores de Internet móvil bloquean todas las redes entre pares (P2P) junto con otros contenidos, y muchas redes corporativas o académicas pueden bloquear Freenet (pero incluso si no lo hacen, ¡[no debería ejecutar Freenet en el trabajo](#trouble) para propósitos no laborales!).

source: There has been discussion in the US and UK of legislation to require backdoors and presumably blocking of anything that can't be backdoored. This is unlikely to pass, especially in the US, where similar laws have been proposed periodically and are probably unconstitutional. However, even if the government came to us and demanded a back door, we would be legally unable to secretly distribute a trojan'ed build, because Freenet is open source, numerous people have contributed code to it, so legally we have to give you the source code, including that for any government mandated back doors - which wouldn't be secret for long! If this happened it is likely that [ Freenet Project Incorporated](donate.html), the non-profit organisation that runs this website and handles donations, would shut down, but the Freenet network itself would live on just fine, the only difference being not being able to pay full time developers as easily. See [net neutrality](http://en.wikipedia.org/wiki/Network_neutrality) and [the EFF](https://www.eff.org/) or equivalent organisations in your country for the politics of all this and how you can stop such laws.
es: Ha habido debate en EEUU y Reino Unido acerca de legislación que requiera puertas traseras (backdoors) y presumiblemente bloquee cualquier cosa en la que no pueda incorporar una puerta trasera. Esto es improbable que se apruebe, especialmente en EEUU, donde leyes similares han sido propuestas periódicamente y son probablemente inconstitucionales. Sin embargo, incluso si el gobierno se dirigió a nosotros y nos exigió una puerta trasera, legalmente no podríamos distribuir en secreto una versión (build) con un troyano, porque Freenet es de código abierto, numerosas personas han aportado código a él, así que legalmente tenemos que darles el código fuente, incluyendo aquel para cualquier gobierno que ordenara puertas traseras - ¡que no serían un secreto durante mucho tiempo! Si esto ocurrió es probable que [Freenet Project Incorporated](donate.html), la organización sin ánimo de lucro que lleva este sitio web y maneja las donaciones, cerraría, pero la propia red Freenet continuaría viva como si nada, la única diferencia sería no poder pagar desarrolladores a tiempo completo con tanta facilidad. Vea [neutralidad en la red](http://en.wikipedia.org/wiki/Network_neutrality) y [la EFF](https://www.eff.org/), u organizaciones equivalentes en su país, para informarse sobre la política al respecto de todo esto y sobre cómo se pueden detener tales leyes.

source: Can I get trouble if I run a node?
es: ¿Puedo meterme en problemas si ejecuto un nodo?
zh_cn: 我运行一个节点是否会带来麻烦？

source: This is related to ["Is Freenet legal?"](#legal). We have done everything we can to make it extremely difficult for any sane legal system to justify punishing someone for running a Freenet node, and there is little precedent for such action in today's developed countries. Many legal systems recognize the importance of freedom of speech, which is Freenet's core goal. Having said that, there is risk in doing anything that your government might not agree with; you should make an informed decision as to whether to take that risk. Furthermore, your ISP or hosting provider may have a problem with Freenet. At least one French hosting provider has been known to ban Freenet ( along with Tor and others) from their servers; please read your terms and conditions to make sure you are allowed to run Freenet. Note also that Freenet can use rather a lot of bandwidth, at least 20GB/month, and this may be a problem on a cheap or shared connection. And of course running it at work could get you into trouble too, unless it's for work purposes!
es: Esto es relativo a ["¿Es legal Freenet?"](#legal). Hemos hecho todo lo que pudimos para hacer extremadamente difícil para cualquier sistema legal sano justificar el castigar a alguien por ejecutar un nodo Freenet, y hay pocos precedentes para tal acción en los países desarrollados de hoy en día. Muchos sistemas legales reconocen la importancia de la libertad de expresión, que es el principal objetivo de Freenet. Dicho esto, hay riesgo en hacer cualquier cosa con la que su gobierno podría no estar de acuerdo; debería tomar una decisión informada en cuanto tomar o no riesgos. Más aún, su ISP o proveedor de alojamiento puede tener un problema con Freenet. Se ha sabido de al menos un proveedor de alojamiento francés que prohibe Freenet (junto con Tor y otros) en sus servidores; por favor lea sus términos y condiciones para asegurarse de que tiene permiso para ejecutar Freenet. Observe también que Freenet puede usar más bien mucho ancho de banda, al menos 20 GB/mes, y esto puede ser un problema para una conexión barata o compartida. Y por supuesto, ¡ejecutarlo en el trabajo podría también meterle en problemas, a menos que sea por motivos laborales!

source: What about copyright?
es: ¿Qué pasa con el copyright?
zh_cn: 怎么对待版权？

source: There are some excellent thoughts on this subject on the [Philosophy]( about.html#philosophy) page. Specific copyright-related laws may be a problem, please read [Is Freenet legal?](#legal) and [Is Freenet blocked by national firewalls?](#blocked).
es: Hay algunos razonamientos excelentes sobre este asunto en la página [Filosofía](about.html#philosophy). Las leyes específicas relativas al copyright pueden ser un problema, por favor, lea [¿Es legal Freenet?](#legal) y [¿Está Freenet bloqueado por firewalls nacionales?](#blocked)

source: What about child porn, offensive content or terrorism?
es: ¿Qué pasa con la pornografía infantil, el contenido ofensivo o el terrorismo?
zh_cn: 如何面对儿童色情、攻击性内容，或者恐怖主义？

source: While most people wish that child pornography and terrorism did not exist, humanity should not be deprived of their freedom to communicate just because of how a very small number of people might use that freedom.
es: Aunque la mayoría de la gente desea que la pornografía infantil y el terrorismo no existan, la humanidad no debe ser privada de su libertad de comunicarse sólo a causa del modo en que un grupo de personas muy reducido podrían usar esa libertad.

source: I don't want my node to be used to harbor child porn, offensive content, or terrorism. What can I do?
es: No quiero que mi nodo se use para albergar pornografía infantil, contenido ofensivo, o terrorismo. ¿Qué puedo hacer?

source: This is a problem that sadly any censorship-resistance tool faces. If the capacity to remove content existed, it might only be used to remove things one finds offensive, but it could be used to remove anything. From a technological point of view one cannot have censorship-resistance with exceptions. Freenet is merely a tool that by itself doesn't do anything to promote offensive content. How people choose to use the tool is their sole responsibility. As a communication medium, Freenet cannot be considered responsible for what people use it for — just like Internet Service Providers, telecoms, or postal services cannot be held responsible for their users either. Note that files are encrypted and split into pieces. They are not stored on your machine in their entirety. Your instance of Freenet will likely have very few encrypted pieces of a given file, if any. These pieces cannot be used as parts of the file they were made from without additional information. Reassembling a file requires knowing both what pieces to use and the key to decrypt them, neither of which is included with each piece.
es: Este es un problema al que tristemente se enfrenta cualquier herramienta de resistencia a la censura. Si la capacidad de eliminar contenido existiera, sólo se podría usar para eliminar cosas que uno encuentra ofensivas, pero podría usarse para eliminar cualquier cosa. Desde un punto de vista tecnológico uno no puede tener resistencia a la censura con excepciones. Freenet es meramente una herramienta que por si misma no hace nada para promover el contenido ofensivo. Como use la gente la herramienta es su exclusiva responsabilidad. Como un medio de comunicación, Freenet no puede ser considerado responsable según el fin para el que lo use la gente — del mismo modo que los proveedores de servicios de Internet (ISPs), las compañías de telecomunicaciones, o los servicios postales, tampoco pueden ser considerados responsables por sus usuarios. Observe que los ficheros están cifrados y divididos en fragmentos. No se almacenan por completo en su máquina. Su instancia de Freenet probablemente tendrá muy pocos fragmentos cifrados de un determinado fichero, si tiene alguno. Estos fragmentos no se pueden usar como partes del fichero del que se formaron sin información adicional. Reensamblar un fichero requiere conocer tanto qué fragmentos usar como la clave para descifrarlos, ninguno de estos datos está incluido con cada fragmento.

source: How about encryption export restrictions?
es: ¿Qué pasa con las restricciones de exportación?
zh_cn: 如何面对加密出口限制？

source: The Freenet Project has notified the US authorities that it will be exporting crypto. As long as your country doesn't prohibit the use of encryption you are fine. Further, there is now an exception in the export laws for software doing exactly what Freenet does! However, Oracle limits the encryption strength available on the JVM that runs Freenet; you should install the Unlimited Strength Policy Files for Java if possible to improve performance. Freenet will however work even without this, by using its built-in encryption code.
es: El proyecto Freenet ha notificado a las autoridades de EEUU que va a exportar criptografía. En tanto su país no prohiba el uso de cifrado usted lo hace bien. Más aún, ¡ahora hay una excepción en las leyes de exportación para software que haga exactamente lo que hace Freenet! Sin embargo, Oracle limita la fortaleza del cifrado disponible en la JVM (máquina virtual Java) que ejecuta Freenet; debería instalar los Unlimited Strength Policy Files (ficheros de política de fortaleza ilimitada), si es posible, para mejorar su rendimiento. Sin embargo Freenet funcionará incluso sin esto, mediante el uso de su código de cifrado integrado.
zh_cn: Freenet 项目已通知美国政府，本软件将出口加密算法。只要你的国家没有禁止使用加密，那么就应该没什么问题。以及，现在对软件的出口法律有一个例外，所以 Freenet 就在这么做！但是，Oracle 限制了 JVM 中可用的加密强度，而 Freenet 使用它运行；如果可能，你应该安装对 Java 的无限强度策略文件，以改善性能。如果没有这个，Freenet 仍将使用内置的加密代码正常工作。

source: I have nothing to hide and don't need anonymity. Is there anything else Freenet can offer?
es: No tengo nada que ocultar y no necesito anonimato. ¿Hay algo más que Freenet pueda ofrecer?
zh_cn: 我没什么可隐瞒的，并不需要匿名。Freenet 还能提供什么？

source: Yes, in fact even without the anonymity feature Freenet is very useful because of the unique way it handles content distribution and information load. In simple terms that means you can publish a website without worrying about how big the site will be and without having to put someone else's ad banners on it. While it is unlikely that freesites will ever load faster than regular websites, they do adapt to sudden surges of visitors better ( which often happen when relatively unknown sites get linked to from a big site), and reasonable download speeds for big files are feasible too. Just don't expect very low latency.
es: Sí, de hecho, incluso sin la característica de anonimato, Freenet es muy útil a causa de la manera única en que maneja la distribución de contenido y la carga de información. En términos simples eso significa que puede publicar un sitio web sin preocuparse de lo grande que será el sitio y sin tener que colocar rótulos de publicidad de algún otro en él. Aunque es improbable que los freesites lleguen alguna vez a cargar más rápido que los sitios web regulares, se adaptan mejor a cambios repentinos del flujo de visitantes (lo que a menudo ocurre cuando sitios relativamente desconocidos se enlazan desde un gran sitio), y también son factibles velocidades razonables de descarga para grandes ficheros. Simplemente no espere una latencia muy baja.

source: Technical
es: Técnico
zh_cn: 技术

source: How do I use this software? I downloaded it, but when I run it there's no GUI.
es: ¿Cómo uso este software? Lo he descargado, pero cuando lo ejecuto no hay interfaz gráfica (GUI).
zh_cn: 我该如何使用此软件？我下载了它，但我运行它时没有界面。

source: Fred (the Freenet REference Daemon) runs as a daemon, or service, in the background. You normally talk to it through a Freenet client. One built-in client is fproxy, which lets you talk to Freenet with a web browser. Freenet should have installed a Browse Freenet shortcut on the desktop and/or the start menu, or a system tray icon (rabbit) with an Open Freenet menu item. Failing that, point your web browser to [http://127.0.0.1:8888/]( http://127.0.0.1:8888/) for the gateway page. Try clicking the various links in the bookmark list to reach an initial set of sites.
es: Fred (Freenet REference Daemon - demonio de referencia de Freenet) se ejecuta como un demonio o servicio, en segundo plano. Normalmente se comunica con este a través de un cliente Freenet. Un cliente Freenet integrado es fproxy, que le permite hablar a Freenet con un navegador web. Freenet debe tener instalado un atajo Navegar por Freenet en el escritorio y/o el menú de inicio, o un icono (conejo) de bandeja de sistema con un elemento de menú Abrir Freenet. Si eso falla, dirija su navegador hacia [http://127.0.0.1:8888/](http://127.0.0.1:8888/) para acceder a la página de la pasarela (gateway). Pruebe a hacer clic en los distintos enlaces de la lista de marcadores para alcanzar una batería inicial de sitios.

source: Why is Freenet so slow?
es: ¿Por qué Freenet es tan lento?
zh_cn: 为什么 Freenet 那么慢？

source: When you first install Freenet, it will be slow, and you may see Data Not Found or Route Not Found errors for freesites. This is normal, and Freenet will speed up significantly over time. For best performance you should try to run Freenet as close to 24 hours a day as possible. This is why we install Freenet as a service. Please bear in mind that Freenet is inherently high latency: it can take a while to (for example) load a page for the first time, even if it is capable of reasonable speeds (as anonymous systems go!) for large popular files. You can also improve performance for freesite browsing by using a separate browser and [increasing its connection limit](#connections). You should also set the datastore size and bandwidth limit as high as possible. But protecting your anonymity does cost a certain amount of performance. You can configure how much to a degree by changing the security levels on the page under Configuration.
es: Cuando instale Freenet por primera vez, será lento, y puede que vea errores de 'Datos no encontrados' o 'Ruta no encontrada' para freesites. Esto es normal, y Freenet se acelerará significativamente con el tiempo. Para lograr el mejor rendimiento debe tratar de correr Freenet lo más próximo a las 24 horas al día que sea posible. Esta es la razón por la que instalamos Freenet como un servicio. Por favor, tenga en cuenta que Freenet es inherentemente de alta latencia (tiempo de respuesta): puede llevar un rato (por ejemplo) cargar una página por primera vez, incluso si es capaz de velocidades razonables (¡según marchan los sistemas anónimos!) para grandes ficheros populares. También puede mejorar el rendimiento para la navegación por freesites usando un navegador aparte e [incrementando su límite de conexiones](#connections). También debe establecer el tamaño del almacenamiento de datos y el límite de ancho de banda tan alto como sea posible. Pero proteger su anonimato tiene un cierto coste en cuanto a rendimiento. Puede configurar hasta qué grado al cambiar los niveles de seguridad en la página bajo Configuración.

source: Is Freenet searchable?
es: ¿Se puede buscar en Freenet?
zh_cn: Freenet 可以搜索吗？

source: Yes, there are a few different search mechanisms. To search the Freenet web (freesites), you should be able to just use the search box on the homepage, or go to Search Freenet on the Browse submenu. If it's not there, go to the Plugins page under Configuration, and load the Library plugin. Alternatively, Frost and Thaw also provide searching for messages and files. Note that searching on Freenet is a good deal more difficult than on other networks because of Freenet's different architecture and design goals.
es: Sí, hay unos pocos mecanismos de búsqueda distintos. Para buscar la web de Freenet (freesites), debería simplemente poder usar el recuadro de búsqueda en la página principal, o ir a Buscar en Freenet en el submenú Navegar. Si no está allí, vaya a la página Complementos bajo Configuración, y cargue el complemento Library (biblioteca). Como alternativa Frost y Thaw también proporcionan búsqueda por mensajes y ficheros. Observe que buscar en Freenet es bastante más difícil que en otras redes a causa de la diferente arquitectura y objetivos de diseño de Freenet.

source: How do I get Freenet working with a Firewall/NAT?
es: ¿Cómo consigo poner a funcionar Freenet con un cortafuegos (firewall) o con NAT?

source: Mostly, Freenet should just work with a NAT. However, you should forward the ports manually if you can. Click on the [Connectivity]( http://127.0.0.1:8888/connectivity/) page. At the top you will see a list of ports used by the node. You should forward (for UDP) the Darknet FNP and Opennet FNP ports. You may need to look up your router's documentation to figure out how to do this. Freenet should have forwarded them itself through [Universal Plug and Play]( https://en.wikipedia.org/wiki/Universal_Plug_and_Play), but this doesn't always work (and it never works if you don't have the UPnP plugin loaded, or have one router behind another). If you have a dyndns address or other domain name pointing to the computer you run your Freenet node on, tell the node about it. Go to [the core settings config page](http://127.0.0.1:8888/config/node?mode=2) (in advanced mode), and find the option "IP address override". Put your domain name in that box, and apply the settings.
es: En la mayoría de los casos, Freenet simplemente debería funcionar con NAT. Sin embargo, si puede, debe redirigir los puertos manualmente. Haga clic en la página [Conectividad](http://127.0.0.1:8888/connectivity/). En la parte superior verá una lista de puertos usada por el nodo. Debe redirigir (por UDP) el FNP (protocolo de nodo de Freenet) de la Darknet y los puertos FNP de la Opennet. Puede que necesite revisar la documentación de su router para averiguar cómo hacer esto. Freenet debería haberlos redirigido él mismo mediante [Universal Plug and Play](https://es.wikipedia.org/wiki/Universal_Plug_and_Play), pero esto no siempre funciona (y nunca funciona si no tiene cargado el complemento UPnP, o tiene un router detrás del otro). Si tiene una dirección dyndns u otro nombre de dominio apuntando a la computadora en la que ejecuta su nodo Freenet, hágaselo saber al nodo. Vaya a [la página de configuración de preferencias principales](http://127.0.0.1:8888/config/node?mode=2) (en modo avanzado), y buscar la opción "Dirección IP introducida manualmente". Ponga su nombre de dominio en ese recuadro, y aplique las preferencias.

source: Do I need a permanent Internet connection to run a node?
es: ¿Necesito una conexión a Internet permanente para ejecutar un nodo?

source: No, but it is preferred. You can run the software and test it from a "transient" connection (e.g. dial up/mobile modem), but for the network as a whole to be most useful, we will need as many permanent nodes as possible ( most cable modem or DSL setups are sufficiently "permanent" for this). A later version of Freenet may take better advantage of transient nodes.
es: No, pero es preferible. Puede ejecutar el software y probarlo desde una conexión "transitoria" (ej. modem telefónico/móvil), pero para que el conjunto de la red sea lo más útil posible, necesitaremos tantos nodos permanentes como sea posible (la mayoría de instalaciones de cable modem o DSL son suficientemente "permanentes" para esto). Una versión posterior de Freenet podría sacar provecho de los nodos transitorios.

source: Why does Freenet only download 1 or 2 files at a time?
es: ¿Por qué Freenet sólo descarga 1 o 2 ficheros a la vez?
zh_cn: 为什么 Freenet 只同时下载 1 或 2 个文件？

source: Many browsers limit the number of simultaneous connections to something far too low for efficiently browsing Freenet (since Freenet pages often have much higher latency than web pages). This can usually be reconfigured. For example, for Mozilla Firefox, type **about:config** in the address field of the browser and replace the value of the following settings to the one stated. Filter on **"connections"** to get only the relevant settings:
es: Muchos navegadores limitan el número de conexiones simultáneas a algo demasiado bajo para navegar por Freenet de forma eficiente (ya que las páginas de Freenet a menudo tienen una latencia (tiempo de respuesta) más alta que las páginas web regulares). Esto normalmente se puede reconfigurar. Por ejemplo, para Mozilla Firefox, escriba **about:config** en la barra de direcciones del navegador, y reemplace el valor de las siguientes configuraciones por el indicado. Busque por **"connections"** para obtener sólo las configuraciones relevantes:
