Repository: hyphanet/website
Catalog: locale/*/LC_MESSAGES/freenet_site.po
Languages: es, zh_cn

source: ### Creating a Freesite To create a new Freesite, you click the **Add project**-button. You then need to fill in the details of the project. Under the Project information-section: * **Name** - this is just a name for you to know the project, so anything will do. It may contain spaces. * **Description** - again, just a slightly longer description of the project for your own convenience. * **Local Path** - This is a directory where you will store all the pages of the freesite you are creating. Put in the full path. You can click the Browse button to select a directory graphically or just type it in.
es: ### Crear un freesite Para crear un nuevo freesite pulse el botón **Añadir proyecto**. Luego tiene que rellenar los detalles del proyecto bajo la sección Información del Proyecto: * **Nombre** - Esto sólo es un nombre para que reconozca el proyecto, de forma que cualquiera lo hará. Puede contener espacios. * **Descripción** - De nuevo, es sólo una descripción ligeramente más larga del proyecto para su propia conveniencia. * **Ruta local** - Esto es un directorio donde almacenará todas las páginas del freesite que está creando. Introduzca la ruta completa. Puede hacer clic en el botón Examinar para seleccionar gráficamente un directorio, o simplemente escríba la ruta.
zh_cn: ### 创建一个 Freesite 要创建一个新的 Freesite，您可以点击“**Add project**”按钮。然后您需要输入项目的详细信息。在项目信息栏目： * **Name** - 这里您可以输入项目的名称，无限制。可以包含空格。 * **Description** - 这里您可以输入项目的描述。仅供您自己参考。 * **Local Path** - 这里您需要选择您的 Freesite 页面所在的目录。

source: Under the Address-section, there are some automatically generated entries, and the human readable name for the site, as seen in the address-field of the browser: * **Request URI** - this is filled in automatically and should be a long string of seemingly random characters. * **Insert URI** - this is also filled in automatically and will look similar to the Request URI. * **Path** - You need to enter a single word here without spaces. This will appear at the end of the address of your site. You can't leave this blank. Below is an example of how it might look: ![](assets/img/jsite/project-details.png) When everything is filled in correctly, you may press **Next**.
es: Bajo la sección Dirección, hay algunas entradas generadas automáticamente, y el nombre legible por humanos para el sitio, tal como se ve en la barra de direcciones del navegador: * **Solicitar URI** - Esto se rellena automáticamente y debe ser una cadena larga y fluida de caracteres aleatorios. * **Insertar URI** - Esto también se rellena automáticamente y se parecerá a la URI solicitada. * **Ruta** - Aquí tiene que introducir una única palabra sin espacios. Esta aparecerá al final de la dirección de su sitio. No puede dejar esto en blanco. Debajo tiene un ejemplo del aspecto que podría tener: ![](assets/img/jsite/project-details.png) Cuando todo esté rellenado correctamente, puede pulsar **Siguiente**.
zh_cn: 在 Address 栏，有自动生成的地址，以及便于人记忆的网站名称。您在浏览器的地址栏会看到相同的网址： * **Request URI** - 此栏目会自动填充，是一个长随机字符串。 * **Insert URI** - 此栏目会自动填充，看上去和上面的 Request URI 类似。 * **Path** - 您需要在这里输入一个单词，不能有空格。它会附在您网站的网址最后。此栏目必填。 下面的截图是一个示例： ![](assets/img/jsite/project-details.png) When everything is filled in correctly, you may press **Next**.

source: The next step is to add files to your Freenet site (or Freesite). This is done in the dialog called **Project Files**. Since we have no files in the current directory, yet, the dialog is pretty much empty. ![](assets/img/jsite/project-files.png) To add files, we put some files in the local directory we specified earlier, **/home/test**, and press **Re-scan**. Then, presto, the files appear. ![](assets/img/jsite/default-file.png) We then highlight one of these files that will be the default page (e.g. index.html might be a good choice) and check the **Default file** checkbox. It should recognise the MIME type as text/html, so leave everything else as they are and click the **Insert now** button.
es: El siguiente paso es añadir ficheros a su sitio Freenet (o freesite). Esto se hace en el cuadro de diálogo llamado **Ficheros del proyecto**. Como aún no tenemos ficheros en el directorio actual, el cuadro de diálogo está bastante vacío. ![](assets/img/jsite/project-files.png) Para añadir ficheros, pondremos algunos ficheros en el directorio local que especificamos con anterioridad, **/home/test**, y pulsamos **Reescanear**. Entonces, aparecerán los ficheros rápidamente. ![](assets/img/jsite/default-file.png) Luego señalamos uno de estos ficheros que pasará a ser la página predeterminada (ej. index.html puede ser una buena elección) y marcamos la casilla **Fichero predeterminado**. Debería reconocer el tipo MIME como text/html, así que deje todo lo demás como está y pulse el botón **Insertar ahora**.
zh_cn: 下一步是添加您的 Freenet 网站（Freesite）文件。您可以在 **Project Files** 对话框添加文件。因为我们在当前目录还没用文件，此对话框是空的。 ![](assets/img/jsite/project-files.png) 要添加文件，我们可以将一些文件放到我们之前指定的目录“**/home/test**”，然后点击“**Re-scan**”按钮。然后文件就会出现。 ![](assets/img/jsite/default-file.png) 之后我们选中其中一个文件作为页面（例如，您可以选择 index.html），并选中“**Default file**”复选框。它的 MIME 类型应当被识别为 text/html。您可以暂时不用了解其他的选项，直接点击“**Insert now**”按钮。

source: If all goes well, a window like the one below should appear. It may take quite a while to insert the Freesite, several minutes in fact. ![](assets/img/jsite/project-insert.png) When all is finished, you will get a message pop-up that tells you that the site has been inserted successfully. You can copy the URI to the clip-board by clicking the **Copy URI to Clipboard** -button.
es: Si todo va bien, debe aparecer una ventana como la de debajo. Puede llevar un buen rato insertar el freesite, de hecho varios minutos. ![](assets/img/jsite/project-insert.png) Cuando todo haya finalizado, obtendrá un mensaje emergente que le dirá que el sitio ha sido insertado correctamente. Puede copiar la URI al portapapeles pulsando el botón **Copiar URI al portapapeles**.
zh_cn: 如果一切正常，下面的窗口会出现。插入一个 Freesite 可能需要数分钟的时间。 ![](assets/img/jsite/project-insert.png) 当一切完成时，您会看到一个弹出消息，告诉您网站已经被成功插入。您可以点击“**Copy URI to Clipboard**”按钮将网址复制到剪贴板。

source: Then you can use FProxy to surf to your newly created Freesite. Just paste the URI after the [http://localhost:8888/](http://localhost:8888/) in the browser address bar, like this (cut for screen purposes): <pre> http://localhost:8888/freenet:USK@cJNO6G0[..]joM,AQACAAE/watergate2/1/</pre> If it works, congratulations, you have just created your first Freesite!
es: Luego puede usar FProxy para navegar por su freesite recientemente creado. Simplemente pegue la URI detrás de [http://localhost:8888/](http://localhost:8888/) en la barra de direcciones del navegador, del modo siguiente (cortado para ajustarlo a la pantalla): <pre> http://localhost:8888/freenet:USK@cJNO6G0[..]joM,AQACAAE/watergate2/1/</pre> If it works, congratulations, you have just created your first Freesite!
zh_cn: 接下来您可以使用 FProxy 浏览您刚刚插入的 Freesite。只要在浏览器地址栏中将网址粘贴到 [http://localhost:8888/](http://localhost:8888/) 之后，如下（截短以适配页面宽度）： <pre> http://localhost:8888/freenet:USK@cJNO6G0[..]joM,AQACAAE/watergate2/1/</pre> 如果您可以访问网站，那么祝贺您成功创建了您的第一个 Freesite！

source: Donate
es: Donar
zh_cn: 捐款

source: Become a member
es: Conviertase en miembro
zh_cn: 成为成员

source: Make a donation
es: Haga una donación
zh_cn: 捐款

source: Choose your monthly donation:
es: Escoja su donación mensual:
zh_cn: 选择你要每月捐款：

source: Choose your one-time donation:
es: Escoja su donación única:
zh_cn: 选择你要一次性捐款：

source: Or set your own amount:
es: O establezca su propia cantidad:
zh_cn: 或者自己设置金额：

source: Custom amount
es: Cantidad personalizada
zh_cn: 自定义金额

source: #### How can I donate? * You can donate using PayPal. For a recurring payment of $5 or more per month you can become a Freenet "member" (this requires a [PayPal][url_paypal] account). Recurring donations give the project a more stable and dependable income which makes it easier to make long-term commitments to potential developers. Alternatively you can make a one-time donation.
es: #### ¿Cómo puedo donar? * Puede donar usando PayPal. Por un pago recurrente de 5 $ al mes o más, puede convertirse en un "miembro" de Freenet (esto requiere una cuenta de [PayPal][url_paypal]). Las donaciones recurrentes dan al proyecto unos ingresos más estables y consistentes que facilitan establecer compromisos a largo plazo con desarrolladores potenciales. Como alternativa puede hacer una donación de una vez.

source: * ![][logo_bitcoin] You can donate using [Bitcoin][url_bitcoin]. Send your donations to {bitcoin_address}. * You can also donate by purchasing items from the Freenet [store][url_zazzle_store]. * Or support us via [Salt at Bountysource][url_salt_bountysource]. * Alternatively, please contact us at {donate_email} if you cannot use any of these payment methods.
es: * ![][logo_bitcoin] Puede donar usando [Bitcoin][url_bitcoin]. Envíe sus donaciones a {bitcoin_address}. * También puede donar comprando artículos en la [tienda][url_zazzle_store] de Freenet. * O darnos apoyo económico vía [Salt en Bountysource][url_salt_bountysource]. * Como alternativa, por favor, contacte con nostros en {donate_email} si no puede usar ninguno de estos métodos de pago.

source: The Freenet Non-Profit
es: La organización Freenet sin ánimo de lucro
zh_cn: Freenet 非营利

source: All donations go to The Freenet Project Inc, a 501(c)(3) non-profit organization with the following mission statement: > The specific purpose of this corporation is to assist in developing and > disseminating technological solutions to further the open and democratic > distribution of information over the Internet or its successor electronic > communication networks or organizations. It is also the purpose of this > organization to guarantee consenting individuals the free, unmediated, > and unimpeded reception and impartation of all intellectual, scientific, > literary, social, artistic, creative, human rights, and cultural > expressions, opinions and ideas without interference or limitation by or > service to state, private, or special interests. It is also the purpose of > this organization to educate the world community and be an advocate of > these purposes. All funds received will only be utilized to advance our Mission Statement, and are administered at the direction of the Freenet Project Board. The Freenet Project Inc is registered under EIN `95-4864038`
es: Todas las donaciones van a The Freenet Project Inc, una organización sin ánimo de lucro bajo la sección 501(c)(3) del Internal Revenue Code de EEUU, con la siguiente misión declarada: > El propósito específico de esta corporación es asistir en el desarrollo y > diseminación de soluciones tecnológicas para llevar más allá la distribución > abierta y democrática de información sobre Internet, o sus redes de > comunicación electrónica u organizaciones sucesoras. También es el > propósito de esta organización garantizar a los individuos que consientan > la recepción e impartición libre, sin intermediarios, sin obstáculos, de todas > las expresiones, opiniones e ideas intelectuales, científicas, literarias, > sociales, artísticas, creativas, sobre derechos humanos, y culturales, sin > interferencia o limitación, por o al servicio de intereses estatales, privados, > o especiales. También es el propósito de esta organización educar a la > comunidad mundial y ser un defensor de estos propósitos. Todos los fondos recibidos sólo serán utilizados para avanzar en nuestra Misión Declarada, y son administrados con la supervisión del Freenet Project Board (panel directivo del proyecto Freenet). The Freenet Project Inc está registrado bajo el (número de identificación de empleador) EIN `95-4864038`

source: Why donate
es: Por qué donar

source: Although countless people have given their time and skill to the project since its inception, The Freenet Project relies on your donations to cover hosting and administrative costs (i.e. domain registrations and certificates). If we have enough funds, we can hire developers to work on Freenet. Freenet is a platform for censorship-resistant communication and publishing. For the past 15 years the project has built tools to fight for freedom of speech and information. Our software provides a decentralized peer-to-peer network designed to hide who publishes or accesses potentially controversial information - or even that it exists - especially useful for those living in oppressive political regimes. While development is primarily driven by volunteers, the project has also employed paid developers to provide more focused work. Over the past 2 years, the project's paid developer has made great progress improving “Web of Trust” functionality to combat spam, which is a central problem in any anonymous system. Unfortunately, the Freenet Project no longer has enough money to retain his services, so he is now a volunteer. This greatly reduces his capacity to continue this important work. We are excited for the future of Freenet and the projects built on top of it. There is so much more work to do, and full-time developers greatly benefit the project. Help us keep Internet freedom alive and expand human liberty. [Learn more about our fundraiser.][url_fundraiser] All support is very much appreciated.
es: Aunque incontables personas han cedido su tiempo y destrezas para el proyecto desde su origen, The Freenet Project (el proyecto Freenet) se apoya en sus donaciones para cubrir los costes de alojamiento y administrativos (ej. registros de dominio y certificados). Si tenemos suficientes fondos, podremos contratar desarrolladores para que trabajen sobre Freenet. Freenet es una plataforma para la comunicación y publicación resistente a la censura. Durante los pasados 15 años el proyecto ha desarrollado herramientas para luchar por la libertad de expresión e información. Nuestro software proporciona una red entre pares (P2P) descentralizada diseñada para ocultar quien publica o accede a información potencialmente controvertida - o incluso la existencia de esta - lo cual es especialmente útil para aquellos que viven en regímenes políticos opresivos. Aunque el desarrollo es llevado principalmente por voluntarios, el proyecto también ha empleado desarrolladores pagados para proveer un desarrollo más-focalizado. Durante los últimos 2 años, el desarrollador pagado del proyecto ha hecho grandes progresos mejorando la funcionalidad "Web of Trust" para combatir el spam, que es un problema central en un sistema anónimo. Desafortunadamente, el proyecto Freenet ya no tiene suficiente dinero para retener sus servicios, así que él ahora es voluntario. Esto reduce enormemente su capacidad para continuar con este importante trabajo. Estamos entusiasmados por el futuro de Freenet y los proyectos desarrollados sobre este. Hay mucho más trabajo que hacer, y los desarrolladores a tiempo-completo benefician tremendamente al proyecto. Ayúdenos a mantener viva la libertad en Internet y expandir la libertad humana. [Conozca más sobre nuestro colector de fondos (fundraiser).][url_fundraiser] Todo apoyo es enormemente apreciado.

source: Sponsors
es: Patrocinadores
zh_cn: 赞助者

source: The following persons, organisations and companies have generously sponsored this project through donations or discounts on hardware and services:
es: Las siguientes personas, organizaciones y compañías han patrocinado generosamente este proyecto mediante donaciones o descuentos en equipos y servicios:

source: * [John Pozadzides][url_john_pozadzides] John is the founder of HTMLHelp.com and former Vice President of Sales for SAVVIS Communications. John has donated $10,000 to the Freenet Project to fund ongoing development of the Freenet software.
es: * [John Pozadzides][url_john_pozadzides] John es el fundador de HTMLHelp.com y anterior Vicepresidente de ventas para SAVVIS Communications. John ha donado 10.000$ al Freenet Project para financiar el desarrollo continuado del software Freenet.

source: * [Web Hosting Search][url_web_hosting_search] WebHostingSearch is a top rated guide to various world wide web hosting companies. Mr Chris Reynolds and the friendly team behind this company have become one of our proud promoters.
es: * [Web Hosting Search][url_web_hosting_search] WebHostingSearch es una guía entre las mejor valoradas para varias compañías de alojamiento en la world wide web. El Sr. Chris Reynolds y el cordial equipo detrás de esta compañía se han convertido en uno de nuestros orgullosos promotores.

source: * [John Gilmore][url_john_gilmore] John Gilmore is one of the founders of the Electronic Frontier Foundation, the Cypherpunks mailing list, and Cygnus Solutions. He created the alt.* hierarchy in Usenet and is a major contributor to the GNU project. He has donated $10,000.
es: * [John Gilmore][url_john_gilmore] John Gilmore es uno de los fundadores de la Electronic Frontier Foundation, la lista de correo Cypherpunks, y Cygnus Solutions. Creó la jerarquía alt.* en Usenet y es uno de los contribuidores principales al proyecto GNU. Ha donado 10.000$.

source: * [Bytemark Hosting][url_bytemark_hosting] Bytemark provides discounted hosting facilities to Freenet and comes with our highest recommendation.
es: * [Bytemark Hosting][url_bytemark_hosting] Bytemark proporciona instalaciones de alojamiento de bajo coste para Freenet y tiene nuestra más alta recomendación.

source: * [zoozle Torrent Search][url_zoozle] zoozle is a search engine for BitTorrent and P2P networks. It is also available in [german][url_zoozle_german] and [french][url_zoozle_french]. They have donated $1,500.
es: * [zoozle Torrent Search][url_zoozle] zoozle es un motor de búsqueda para BitTorrent y redes P2P. También está disponible en [alemán][url_zoozle_german] y [francés][url_zoozle_french]. Han donado 1.500$.

source: * [YourKit, LLC][url_yourkit] YourKit is kindly supporting Freenet by providing us a free of charge license of its full-featured Java Profiler. YourKit, LLC is the creator of innovative and intelligent tools for profiling Java applications. You can learn more about [YourKit Java Profiler][url_yourkit_profiler] following the link.
es: * [YourKit, LLC][url_yourkit] YourKit está apoyando amablemente a Freenet proporcionándonos una licencia libre de cargos de su Java Profiler repleto de características. YourKit, LLC es la creadora de herramientas innovativas e inteligentes para el diagnóstico (profiling) de aplicaciones Java. Puede conocer más acerca de [YourKit Java Profiler][url_yourkit_profiler] siguiendo el enlace.

source: * [Google][url_google] Google [open source][url_google_opensource] have three times donated $18,000, as well as paying for students to work with us over summer since 2006 through the [Google Summer of Code][url_google_soc] program.
es: * [Google][url_google] Google [open source][url_google_opensource] (código abierto) ha donado 18.000$ en tres ocasiones, además de pagar a estudiantes para que trabajen con nosotros durante el verano desde 2006 a través del programa [Google Summer of Code][url_google_soc] (verano de código).

source: * [Finanzvergleich][url_finanzvergleich] Finanzvergleich is a German financial services comparison site, who have contributed $1,500.
es: * [Finanzvergleich][url_finanzvergleich] Finanzvergleich es un sitio alemán de comparación de servicios financieros, que ha contribuido con 1.500$.

source: * [TopDir][url_topdir] TopDir is a human edited web directory with informations about interesting topics and websites in the German language.
es: * [TopDir][url_topdir] TopDir es un directorio web editado por humanos con informaciones acerca de temas de interés y sitios web en lengua alemana.

source: * [All Filters][url_allfilters] - another generous sponsor.
es: * [All Filters][url_allfilters] - otro patrocinador generoso.

source: * [A German Site for Gardening and Plants][url_gartenheinz] - another generous sponsor.
es: * [Un sitio alemán para jardinería y plantas][url_gartenheinz] - otro patrocinador generoso.

source: * [Simple Car Rentals][url_simple_carrentals] Simple Car Rentals has generously supported Freenet by helping us with some of our administrative expenses over the years.
es: * [Simple Car Rentals][url_simple_carrentals] Simple Car Rentals ha apoyado generosamente a Freenet ayudándonos con algunos de nuestros gastos administrativos durante años.

source: * [The Sports Den][url_sportsden] The Sports Den has a wide variety of outdoor sports equipment, they are based in Ireland but can ship to the UK, Europe, and the United States.
es: * [The Sports Den][url_sportsden] The Sports Den tiene una amplia variedad de equipamientos deportivos de exterior, tienen su base en Irlanda pero realizan envíos a Reino Unido, Europa, y los EEUU.

source: * ![][logo_intellij_idea] [JetBrains][url_jetbrains] has kindly provided a license for the Ultimate edition of [IntelliJ IDEA][url_intellij_idea].
es: * ![][logo_intellij_idea] [JetBrains][url_jetbrains] ha proporcionado amablemente una licencia para la edición Ultimate de [IntelliJ IDEA][url_intellij_idea].

source: Freenet Project Inc does not necessarily endorse the business activities of all of the companies listed on this page. Donation inquiries please contact Ian Clarke: {donate_email}
es: Freenet Project Inc no respalda necesariamente las actividades de negocio de todas las compañías listadas en esta página. Para preguntas sobre donación, por favor, contacte con Ian Clarke: {donate_email}

source: Store
es: Almacenamiento
zh_cn: 存储

source: Thanks for your donation!
es: ¡Gracias por su donación!
zh_cn: 感谢您的捐款！

source: We have received your generous donation. It will be used at the direction of the Freenet Board to advance the interests of the Freenet Project. If you have any questions about how your donation will be used please contact Ian Clarke: {donate_email}.
es: Hemos recibido su generosa donación. Se usará bajo la orientación del Freenet Board (panel de dirección de Freenet) para avanzar en los intereses del Freenet Project. Si tiene alguna pregunta acerca de cómo se usará su donación, por favor, contacte con Ian Clarke: {donate_email}.

source: Thanks
es: Gracias
zh_cn: 感谢

source: Download
es: Descargar
zh_cn: 下载

source: To access Freenet, you first need to install the main application. Freenet will run in the background and you can use your browser to change settings and access content. There are other applications that you can install at a later time to add more functionality. Steps: * [Download and install Freenet][autostart] * [Add friends (or connect to strangers)][add_friends] * [Start using Freenet!][usage]
es: Para acceder a Freenet, primero necesita instalar la aplicación principal. Freenet se ejecutará en segundo plano y puede usar su navegador para cambiar la configuración y acceder al contenido. Hay otras aplicaciones que puede instalar con posterioridad para añadir más funcionalidades. Pasos . * [Descargue e instale Freenet][autostart] * [Añada amigos (o conecte con extraños)][add_friends] * [¡Comience a usar Freenet!][usage]

source: Show installation instructions for:
es: Mostrar instrucciones de instalación para:

source: *Freenet is free and open source software available under GPLv2+. The source code is on [GitHub][github_freenet].*
es: *Freenet es software libre y de código abierto disponible bajo la licencia GPLv2+. El código fuente está en [GitHub][github_freenet].*

source: ### Windows Download and run [the installer](assets/jnlp/FreenetInstaller.exe)
es: ### Windows Descargue e instale [el instalador](assets/jnlp/FreenetInstaller.exe)

source: Download Freenet
es: Descargar Freenet
zh_cn: 下载 Freenet
