Repository: hyphanet/website
Catalog: locale/*/LC_MESSAGES/freenet_site.po
Languages: es, zh_cn

source: Note that these settings will cause mozilla to use more connections for all your browsing, which may not be desirable from a network congestion point of view. But you should ideally be using a separate browser for Freenet anyway, for best security.
es: Observe que estas configuraciones causarán que Mozilla Firefox use más conexiones para toda su navegación, lo cual puede no ser deseable desde el punto de vista de la congestión de red. Pero de todos modos lo ideal sería que usara un navegador aparte para Freenet, para lograr la mejor seguridad.

source: Why can't Freenet store data permanently?
es: ¿Por qué no puede Freenet almacenar datos permanentemente?
zh_cn: 为什么 Freenet 永久存储数据？

source: Because we can't find a way to do this without compromising Freenet's other goals. For example, people often suggest that someone's node could just never drop data they want to cache permanently. This, however, won't work because even if the data is still available on their node, there is no way to ensure that requests for that data will be routed to that node. We have considered many other ways that Freenet could store data permanently, but they either won't work, or compromise Freenet's core goals of anonymity, and scalability. Content which is popular should persist indefinitely, for example most freesites linked from the main indexes are still retrievable years later (at least their front pages are). If the content isn't very popular the best way to keep it available is to regularly re-insert (re-upload) it. An interesting option is the "Keepalive" plugin, which will do this for you - even if you didn't upload the file/site in the first place. Improvements are planned, such as a special kind of request that allows us to probe whether a file is available from a random point on the network.
es: Porque no podemos encontrar una forma de hacer esto sin comprometer el resto de los objetivos de Freenet. Por ejemplo, la gente a menudo sugiere que el nodo de alguien simplemente nunca pudiera descartar los datos que quiere tener en caché permanentemente. Esto, sin embargo, no funcionará porque incluso si los datos todavía están disponibles en su nodo, no hay manera de asegurar que las peticiones para esos datos se enrutarán hacia ese nodo. Hemos considerado muchas otras formas de que Freenet pudiera almacenar datos permanentemente, pero o bien no funcionarán, o comprometen los objetivos principales de anonimato y escalabilidad de Freenet. El contenido que es popular debe persistir indefinidamente, por ejemplo, la mayoría de freesites enlazados desde los índices principales son todavía descargables años después (al menos sus páginas principales lo son). Si el contenido no es muy popular la mejor manera de mantenerlo disponible es reinsertarlo (resubirlo). Una opción interesante es el complemento "Keepalive", que hará esto por usted - incluso si no fue usted quien subió el fichero/sitio en primer término. Hay mejoras planeadas, como un tipo especial de petición que nos permita sondear si un fichero está disponible desde un punto aleatorio de la red.

source: Why is Freenet implemented in Java?
es: ¿Por qué está Freenet implementado en Java?
zh_cn: 为什么 Freenet 用 Java 实现？

source: Opinions differ about the choice of Java for the reference implementation of Freenet (even among the core developers). [Ian Clarke](about.html#people) and several other developers are Java proponents and the choice for Java was made. Even if everybody could be convinced to switch to a different language reimplementing the current Freenet protocol would be quite a big task, and take up a significant amount of time, while there is only a limited amount of developer-time available. Flame wars on the development list about the language choice aren't welcome, people willing to implement Freenet in other languages however are very much encouraged to try. Don't underestimate the amount of work however.
es: Las opiniones difieren acerca de la elección de Java para la implementación de referencia de Freenet (incluso entre los desarrolladores principales). [Ian Clarke] (about.html#people) y varios otros desarrolladores son proponentes de Java y la elección se inclinó por Java. Aunque se pudiera convencer a todos de cambiar a un lenguaje distinto reimplementando el protocolo actual de Freenet, sería una tarea bastante grande y ocuparía una cantidad de tiempo significativa, mientras que sólo hay una cantidad limitada de tiempo-de-desarrollador disponible. Las discusiones encendidas en la lista de desarrollo acerca de la elección de lenguajes no son bienvenidas, sin embargo, a la gente deseosa de implementar Freenet en otros lenguajes, les animamos muchísimo a intentarlo. No infravalore, no obstante, la cantidad de trabajo necesaria.

source: How do I allow connections to FProxy from other computers?
es: ¿Cómo permito las conexiones a FProxy desde otras computadoras?
zh_cn: 我该如何允许其他电脑连接 FProxy？

source: If you want everyone to be able to use your node you have the following options: * Go to the [web interface configuration page](http://127.0.0.1:8888/config/fproxy) and enable advanced mode * Stop your node and edit freenet.ini manually In both cases change the following parameters: `fproxy.bindTo=0.0.0.0 fproxy.allowedHosts=* ` Of course, this leaves your node wide open, unless you control access with a firewall of some sort. If you'd prefer to use access controls within Freenet, then you can use lines like this: `fproxy.bindTo=0.0.0.0 fproxy.allowedHosts=127.0.0.1,192.168.1.0/24 ` Or even (find your IP address from ipconfig/ifconfig/winipcfg and substitute it for 192.168.1.1): `fproxy.bindTo=127.0.0.1,192.168.1.1 fproxy.allowedHosts=127.0.0.1,192.168.1.0/24 ` And if you want to grant full access (i.e. change config settings, restart, etc) to the node (WARNING: Be very careful who you give full fproxy access to!): `fproxy.allowedHostsFullAccess=127.0.0.1,192.168.1.0/24 `
es: Si quiere que todos puedan usar su nodo, tiene las siguientes opciones: * Vaya a la [página de configuración de la interfaz web](http://127.0.0.1:8888/config/fproxy) y habilite el modo avanzado * Detenga su nodo y edite freenet.ini manualmente En ambos casos cambie los siguientes parámetros: `fproxy.bindTo=0.0.0.0 fproxy.allowedHosts=* ` Por supuesto, esto deja su nodo completamente abierto, a menos que controle el acceso con un cortafuegos (firewall) de algún tipo. Si prefiere usar controles de acceso internos de Freenet, puede usar líneas como estas: `fproxy.bindTo=0.0.0.0 fproxy.allowedHosts=127.0.0.1,192.168.1.0/24 ` O incluso (buscar su dirección IP en ipconfig/ifconfig/winipcfg y sustituirla por 192.168.1.1): `fproxy.bindTo=127.0.0.1,192.168.1.1 fproxy.allowedHosts=127.0.0.1,192.168.1.0/24 ` Y si quiere conceder acceso completo (es decir, a cambiar los valores de configuración, reiniciar, etc.) al nodo (ADVERTENCIA: ¡Tenga mucho cuidado a quien le da acceso completo a fproxy!): `fproxy.allowedHostsFullAccess=127.0.0.1,192.168.1.0/24 `

source: What's new? Is there a changelog?
es: ¿Qué novedades hay? ¿Hay un registro de cambios?
zh_cn: 有什么新的？有没有更新日志？

source: On every new build, a brief summary of all the main changes is posted to the support and devl lists and the eng.freenet board on Freetalk. This is usually relayed to FMS and Frost too. Alternatively, for a much more detailed view, check out the [git repositories](https://github.com/freenet/). Also, you should check the developer blogs (from the default bookmarks, or over the web, e.g. [toad](http://amphibian.dyndns.org/flogmirror/)), but be warned they are often not regularly updated and frequently go off on rants on unrelated topics!
es: En cada nueva versión (build), se publica un breve resumen de todos los principales cambios en las listas support y devl (soporte y desarrollo) y el panel eng.freenet en Freetalk. Esto normalmente también se repite en FMS y Frost. Como alternativa, para una vista mucho más detallada, revise los [repositorios git](https://github.com/freenet/). Además debe revisar los blogs de desarrolladores (desde los marcadores predeterminados, o a través de la web, ej. [toad](http://amphibian.dyndns.org/flogmirror/)), pero tenga en cuenta que a menudo no se actualizan con regularidad y frecuentemente se pierden en sermones sobre temas no relacionados!

source: Why are there so many messages in my logfile with a backtrace attached?
es: ¿Por qué hay tantos mensajes en mi fichero de registro (log) con una traza retrospectiva (backtrace) adjunta?
zh_cn: 为什么我的日志文件中有许多附有回潮信息的消息？

source: Freenet logs messages excessively during normal operation. It's something we're aware of and are working on.
es: Freenet registra (log) mensajes de forma excesiva durante las operaciones normales. Es algo de lo que somos conscientes y en lo que estamos trabajando.
zh_cn: Freenet 日志消息在正常操作期间很过量。这个情况已得知并正在研究。

source: I have Kaspersky anti-virus, and Freenet doesn't install, or shows "Download/upload queue database corrupted!"
es: Tengo un anti-virus Kaspersky, y Freenet no se instala, o muestra "¡La base de datos de la cola de descarga/subida está corrompida!"
zh_cn: 我有卡巴斯基防病毒软件，并且 Freenet 不能安装，或者显示“下载/上传队列数据库已损坏！”

source: Kaspersky can be a problem with Freenet. See [here][url_kaspersky]. We recommend you turn off Kaspersky during install and during node startup, and exclude the directory you installed Freenet in (most likely {freenet_install_dir_1} or {freenet_install_dir_2}).
es: Kaspersky puede ser un problema con Freenet. Vea [aquí][url_kaspersky]. Le recomendamos que apague Kaspersky durante la instalación y durante el inicio del nodo, y excluya el directorio en el que instaló Freenet (muy probablemente {freenet_install_dir_1} o {freenet_install_dir_2}).

source: I set a password and now I forgot it, what can I do?
es: Establecí una contraseña y ahora la he olvidado, ¿qué puedo hacer?
zh_cn: 我设置了密码，现在我忘了，该怎么办？

source: The password protects your downloads and uploads and the client-cache (cache of what you've recently browsed on Freenet). It is stored in the file master.keys. There is no way to recover the password, but if you forget it you can wipe your downloads and uploads and the client cache by securely deleting the file master.keys. See [the question on private data and local security](#privatedata) for more information.
es: La contraseña protege las claves de sus descargas y subidas, y de la caché de cliente (caché que almacena aquello que ha navegado recientemente en Freenet). Se guardan en el fichero master.keys (claves maestras). No hay forma de recuperar la contraseña, pero si la olvida, puede limpiar sus descargas y subidas, y la caché de cliente, borrando de forma segura el fichero master.keys. Vea [el asunto de los datos privados y la seguridad local](#privatedata) para más información.
zh_cn: 采用密码保护的是下载和上传及客户端缓存（您最近浏览的 Freenet 内容）。它存储在 master.keys 文件中。没有方法来找回密码，但如果您忘记了密码，您可以删除 master.keys 文件来安全清除您的下载和上传及客户端缓存。参见[隐私数据和本地安全](#privatedata)了解更多信息。

source: Freenet keeps complaining about clock skew
es: Freenet continúa quejandose de desfase de reloj
zh_cn: Freenet 一直抱怨时钟偏移

source: Freenet will have problems if your clock is constantly being rewound. Usually this happens when something is resetting your clock regularly in big jumps. On Linux, you should run ntpd to make sure your clock isn't too far off (this isn't vital but it's helpful), but if you see clock skew errors, try adding the -x option to it to avoid big backwards jumps. Also, running ntpdate on startup so there is one big jump before Freenet starts is a good idea. This can also happen on Windows sometimes, let us know how you managed to fix it ... generally it's not all that serious though, especially if big jumps in the clock are only once a day.
es: Freenet tendrá problemas si su reloj está siendo constantemente atrasado. Habitualmente esto sucede cuando algo está reconfigurando su reloj en en grandes saltos de forma regular. En Linux debe ejecutar ntpd para asegurarse de que su reloj no está demasiado desfasado (esto no es vital pero es útil), pero si ve errores de desfase de reloj pruebe a añadirle la opción -x para evitar grandes saltos hacia atrás. Además, ejecutar ntpdate en el arranque para que haya un gran salto antes de que se inicie Freenet es una buena idea. Esto también puede ocurrir a veces en Windows, háganos saber como consiguió corregirlo... aunque generalmente la cosa no es tan seria, especialmente si los grandes saltos de reloj son sólo una vez al día.

source: Publishing
es: Publicar
zh_cn: 发布

source: If I publish something in Freenet, how will people find it? Don't they have to know the key I used?
es: Si publico algo en Freenet, ¿cómo lo encontrará la gente? ¿No tendrían que conocer la clave que usé?
zh_cn: 如果我在 Freenet 发布了某些东西，人们如何找到它？难道它们必须知道我使用的键值？

source: Yes, people will have to know what key you used to publish your information. This means you will have to announce your key in some way. The most common way to do this is to send a message, containing your key and brief description of your information, to the author of one of the existing Freenet sites. Most of the "portal" sites which are linked from the Freenet web interface (fproxy) read the Freetalk or FMS forums, and there are boards specifically for announcing sites (usually the boards are called "sites"!). You could also send your key to people by using the Freenet [mailing lists]( help.html#mailing-lists), in the IRC channel (chat.freenode.net #freenet), by private e-mail, or by advertising your Freenet site on your World Wide Web site. If you're feeling extravagant, you could even try skywriting it. (Graffiti is not recommended, for legal reasons.)
es: Sí, la gente tendrá que conocer la clave que usó para publicar su información. Esto significa que tendrá que anunciar su clave de alguna manera. La forma más común de hacer esto es enviar un mensaje que contenga su clave y una breve descripción de su información, al autor de uno de los sitios de Freenet existentes. La mayoría de los sitios "portales" que están enlazados en la interfaz web de Freenet (fproxy) leen los foros Freetalk o FMS, y hay grupos específicos para anunciar sitios (¡normalmente los grupos son llamados "sitios"!). También podría enviar su clave a la gente usando [listas de correo]( help.html#mailing-lists) de Freenet, en el canal de IRC (chat.freenode.net #freenet), mediante correo privado, o publicitando su sitio Freenet en su sitio web regular (World Wide Web). Si le apetece la extravagancia, incluso podría tratar de escribirlo en el cielo (no se recomiendan los graffiti, por motivos legales).

source: How do I publish a Content Hash Key (CHK)?
es: ¿Cómo publico una Content Hash Key (CHK)?
zh_cn: 我该如何发布一个 内容 Hash 键值（CHK）？

source: A Content Hash Key is based on the actual content contained within it - and as such, the key will only be known after it has been inserted into Freenet. To insert a CHK, simply insert it as "CHK@", Freenet will tell you what the actual CHK is once the insertion completes.
es: Una Content Hash Key (CHK, clave hash de contenido), se basa en el contenido real albergado en su interior - y como tal, la clave se conocerá sólo después de que se haya insertado en Freenet. Para insertar una CHK, simplemente hágalo como "CHK@", Freenet le dirá cuál es la clave CHK real una vez la inserción se complete.

source: Can Freenet documents be updated / deleted?
es: ¿Pueden actualizarse / borrarse los documentos de Freenet?
zh_cn: Freenet 文档可以被更新 / 删除？

source: Currently, a document posted to Freenet with the same name as one already present may actually serve to propagate the existing document. There is also currently no means of deleting a document from Freenet. Documents that are never requested are eventually removed through disuse. However, you can use an [Updatable Subspace Key (USK)]( https://wiki.freenetproject.org/USK) to provide a form of updatable freesite: your node will automatically look for later editions of the site (after you visit it, or always if you bookmark it), and show you the latest version. You can force it to search for the latest version by changing the number at the end of the key to negative.
es: Actualmente, un documento publicado en Freenet con el mismo nombre que uno ya presente, en realidad puede servir para propagar el documento existente. Además, en la actualidad no hay forma de borrar un documento de la red Freenet. Los documentos que nunca se solicitan eventualmente son eliminados por desuso. No obstante, puede usar una [Updatable Subspace Key (USK, clave de subespacio actualizable)](https://wiki.freenetproject.org/USK) para proveer una forma de freesite actualizable: Su nodo buscará automáticamente ediciones posteriores del sitio (después de que lo visite, o continuamente si lo añadió a marcadores), y le mostrará la última versión. Puede forzarlo para que busque la última versión cambiando el número del final de la clave a negativo.

source: Contributing
es: Contribuir
zh_cn: 贡献

source: I have this great idea....
es: Tengo esta gran idea...
zh_cn: 我有个好主意...

source: Good! First step: read the [mailing list archives](help.html#mailing-lists). Odds are good that someone else had the same idea and discussed it with the group. Either a flaw was found in the idea, or perhaps it was decided to postpone implementing the idea until later. Some examples of ideas already discussed are storing information by content hash, key redirection, signed keys/data, use of UDP, server discovery, URLs, document versioning, and others. If you don't see the idea discussed in the archives, by all means bring it up in the appropriate [mailing list](help.html#mailing-lists).
es: ¡Bien! El primer paso: Lea los [archivos de la lista de correo](help.html#mailing-lists). Las probabilidades son buenas de que alguien más haya tenido la misma idea y la haya discutido con el grupo. O bien se encontró un fallo en la idea, o quizá se decidió posponer la implementación de la idea hasta más tarde. Algunos ejemplos de ideas ya discutidas son almacenar información por hash de contenido, redireccionamiento de clave, claves/datos firmados, uso de UDP, descubrimiento de servidor, URLs, versionado de documentos, y otros. Si no ve la idea discutida en los archivos, plantéela por todos los medios en la [lista de correo](help.html#mailing-lists) adecuada.

source: Can I contribute to the Freenet Project?
es: ¿Puedo contribuir al Proyecto Freenet?
zh_cn: 我能帮助 Freenet 项目吗？

source: Absolutely. Even if you don't have the time or skills to become a co-developer of the project, you can contribute in other ways: * Help test Freenet by installing and configuring the server software on your machine. * Install the client software on your machine to test retrieving information and publishing your own. * Work on the Freenet web site (including the FAQ). * Contribute your ideas to the discussion lists. * [Translate the user interface](https://wiki.freenetproject.org/Translation) into another language.
es: Totalmente. Incluso si no tiene el tiempo o las destrezas para convertirse en un co-desarrollador del proyecto, puede contribuir de otras formas: * Ayude a probar Freenet instalando y configurando el software de servidor en su máquina. * Instale el software cliente en su máquina para probar a descargar información y publicar la suya propia. * Trabaje en el sitio web de Freenet (incluidas las preguntas frecuentes (FAQ)). * Aporte sus ideas a las listas de discusión. * [Traduzca la interfaz de usuario](https://wiki.freenetproject.org/Translation) a otro idioma.

source: If you are a developer, you can help by working on Freenet itself, or by creating other applications to run on Freenet. External applications (such as FMS, the main forums system used on Freenet) use [the Freenet Client Protocol](https://wiki.freenetproject.org/FCPv2) to talk to Fred. Another possibility is writing plugins - these are written in Java and run in Freenet's JVM, and can be bundled with Freenet when they are ready. A popular plugin is Sone, which is a microblogging/social app over Freenet. You can see how to install FMS and Sone on e.g. the Freenet Social Networking Guide freesite. If you want to work on Freenet itself, see [here](contribute.html#developers) to get the source code. Improvements to this website, fixes for spelling/grammar mistakes, new ideas (see [the previous answer](#idea)), are all welcome. You may find [the wiki]( https://wiki.freenetproject.org/Main_Page) helpful.
es: Si es un desarrollador, puede ayudar trabajando en el propio Freenet, o creando otras aplicaciones para ejecutar en Freenet. Las aplicaciones externas (como FMS, el principal sistema de foros usado en Freenet) usan [el protocolo de cliente de Freenet (FCP)](https://wiki.freenetproject.org/FCPv2) para hablar con el demonio de referencia de Freenet (Fred). Otra posibilidad es escribir complementos - estos se escriben en Java y se ejecutan en la máquina virtual Java (JVM) de Freenet, y pueden empaquetarse con Freenet cuando estén listos. Un complemento popular es Sone, que es una aplicación de microblogging/social sobre Freenet. Puede ver cómo instalar FMS y Sone en, por ejemplo, el freesite de la Guía de Interconexión Social de Freenet. Si quiere trabajar en el propio Freenet, eche un vistazo [aquí](contribute.html#developers) para obtener el código fuente. Son bienvenidas las mejoras a este sitio web, correcciones para fallos ortográficos/gramaticales, nuevas ideas (vea [la respuesta previa](#idea)). Puede que encuentre útil [el wiki](https://wiki.freenetproject.org/Main_Page). https://wiki.freenetproject.org/Main_Page) helpful.

source: If you have any questions about contributing, please contact us, via [the developers mailing list][url_devlist], [the chat channel][url_chat], [the support mailing list][url_supportlist] or anonymously via the freenet board on FMS. Last but not least you can [donate][url_donate] to support our paid developer(s) and cover server costs.
es: Si tiene alguna pregunta en relación a contribuir, por favor, contacte con nosotros mediante [la lista de correo de desarrolladores][url_devlist], [el canal de chat][url_chat], [la lista de correo de soporte][url_supportlist], o anónimamente mediante el grupo freenet en FMS. Por último, pero no menos importante, puede [donar][url_donate] para apoyar a nuestro(s) desarrollador(es) pagados y cubrir los costes de servidor.

source: How can I access the code and website?
es: ¿Cómo puedo acceder al código y al sitio web?
zh_cn: 我怎样才能访问代码和网站？

source: See our [GitHub repository](https://github.com/freenet/).
es: Vea nuestro [repositorio en GitHub](https://github.com/freenet/).
zh_cn: 参见我们的 [GitHub 版本库](https://github.com/freenet/)。

source: What tools do I need to help develop?
es: ¿Qué herramientas necesito para ayudar a desarrollar?
zh_cn: 我需要什么工具来帮助开发吗？

source: Building Freenet requires JDK 1.6 or later. You can download the source tarballs on the download page for a specific build, or use git to get an up to date copy of the source, see [here](contribute.html#developers) for details. Further instructions for building and deploying the server are included with the code itself. Generally speaking, joining our IRC channel is a good idea: [#freenet on chat.freenode.net](irc://chat.freenode.net/freenet)
es: Compilar Freenet requiere JDK 1.6 o superior. Puede descargar los tarballs con el código fuente para una versión (build) específica en la página de descargas, o usar git para obtener una copia actualizada del código fuente, eche un vistazo [aquí](contribute.html#developers) para más detalles. Se incluyen instrucciones adicionales con el propio código para compilar y desplegar el servidor. Hablando en general, unirse al canal de IRC es una buena idea: [#freenet en chat.freenode.net](irc://chat.freenode.net/freenet)
