Repository: hyphanet/website
Catalog: locale/*/LC_MESSAGES/freenet_site.po
Languages: es, zh_cn

source: What is Freenet?
es: ¿Qué es Freenet?
zh_cn: 什么是 Freenet？

source: > _"I worry about my child and the Internet all the time, even though she's too > young to have logged on yet. Here's what I worry about. I worry that 10 or > 15 years from now, she will come to me and say 'Daddy, where were you when > they took freedom of the press away from the Internet?'"_ > --Mike Godwin, [Electronic Frontier Foundation](https://www.eff.org/)
es: > _"Me preocupo por mi hija e Internet todo el tiempo, incluso aunque ella es demasiado > joven para haberse iniciado aún. Esto es lo que me preocupa. Me preocupa que en 10 o > 15 años desde ahora, ella se volverá hacia mi y dirá 'Papi, ¿dónde estabas tú cuando > arrebataron la libertad de prensa de Internet?'"_ > --Mike Godwin, [Electronic Frontier Foundation](https://www.eff.org/)
zh_cn: > “我一直担心我的孩子和互联网，尽管她还年轻得没有上过网。我担心的是 10 年或 15 年之后，她会来问我：‘老爸，当年他们将新闻自由权从网络夺走的时候，你去哪了？’” > ——Mike Godwin，[电子前哨基金会](https://www.eff.org/)

source: Freenet is free software which lets you anonymously share files, browse and publish "freesites" (web sites accessible only through Freenet) and chat on forums, without fear of censorship. Freenet is decentralised to make it less vulnerable to attack, and if used in "darknet" mode, where users only connect to their friends, is very difficult to detect.
es: Freenet es un software libre que le permite compartir ficheros anónimamente, navegar y publicar "freesites" (sitios web accesibles sólo a través de Freenet) y chatear en foros, sin miedo a la censura. Freeneet es descentralizada para hacerla menos vulnerable a los ataques, y si se usa en modo "darknet", donde los usuarios sólo conectan con sus amigos, es muy difícil de detectar.
zh_cn: Freenet 是一个免费软件，您可以通过它匿名的分享文件、浏览和发布“Freesite”（只能在 Freenet 网络中访问的网站）、在论坛中发帖，不用担心被审查。Freenet 是去中心化的，很难被攻击。如果使用它的“暗网（Darknet）”模式，用户仅会连接到他们的好友，那么他人很难侦测到这个用户。

source: Communications by Freenet nodes are encrypted and are routed through other nodes to make it extremely difficult to determine who is requesting the information and what its content is.
es: Las comunicaciones mediante nodos Freenet se cifran y enrutan a través de otros nodos para hacer que sea extremadamente difícil determinar quién está pidiendo la información y cuál es su contenido.
zh_cn: Freenet 节点之间的通讯是加密的，并通过其他节点路由。因此要了解谁在请求某些信息、请求的内容是什么，是极其困难的。

source: Users contribute to the network by giving bandwidth and a portion of their hard drive (called the "data store") for storing files. Files are automatically kept or deleted depending on how popular they are, with the least popular being discarded to make way for newer or more popular content. Files are encrypted, so generally the user cannot easily discover what is in his datastore, and hopefully can't be held accountable for it. Chat forums, websites, and search functionality, are all built on top of this distributed data store.
es: Los usuarios contribuyen a la red al ceder ancho de banda y una porción de su disco duro (llamada el "almacenamiento de datos") para almacenar ficheros. Los ficheros se conservan o se borran automáticamente dependiendo de cómo son de populares, con el menos popular siendo descartado para dejar sitio a contenidos más recientes o populares. Los ficheros se cifran, así que el usuario generalmente no puede descubrir fácilmente qué es lo que hay en su almacenamiento de datos, y con suerte no puede ser responsabilizado por ello. Foros de conversación, sitios web, y funcionalidad de búsqueda, todos se erigen sobre este almacenamiento de datos distribuido.
zh_cn: 用户通过贡献自己的互联网带宽和他们的一部分硬盘空间（称为“数据存储（Data Store）”）来储存文件。根据文件的流行程度，文件会自动被保留或删除。不流行的文件被删除，可以腾出更多的空间给流行的文件。文件是加密的，因此用户无法轻易得知它的“数据存储”内储存了什么内容，因此也不会因其被追究责任。聊天论坛、网站和搜索功能，都是基于该分布式“数据存储”构建。

source: Freenet has been downloaded over 2 million times since the project started, and used for the distribution of censored information all over the world including countries such as China and in the Middle East. Ideas and concepts pioneered in Freenet have had a significant impact in the academic world. Our 2000 paper "Freenet: A Distributed Anonymous Information Storage and Retrieval System" was the most cited computer science paper of 2000 according to Citeseer, and Freenet has also inspired papers in the worlds of law and philosophy. Ian Clarke, Freenet's creator and project coordinator, was selected as one of the top 100 innovators of 2003 by MIT's Technology Review magazine.
es: Freenet ha sido descargado más de 2 millones de veces desde que el proyecto comenzó, y se ha usado para la distribución de información censurada por todo el mundo incluyendo países y áreas tales como China y Oriente Medio. Las ideas y conceptos que fueron pioneros en Freenet han tenido un impacto significativo en el mundo académico. Nuestra publicación de 2000 "Freenet: Un Sistema Distribuido y Anónimo de Almacenamiento y Descarga de Información" fue la publicación de ciencia de computadoras más citada de 2000 de acuerdo con Citeseer, y Freenet también ha inspirado publicaciones en los ámbitos legales y filosóficos. Ian Clarke, el creador de Freenet y coordinador del proyecto, fue seleccionado como uno de los 100 innovadores de 2003 por el magazine Technology Review del MIT.
zh_cn: Freenet 自诞生起已被下载超过 200 万次，用来在全世界分发敏感受审查的信息，包括中国和中东国家。Freenet 中的先驱思想和概念也深深影响了学术界。我们在 2000 年的论文《Freenet：一个分布式匿名信息存储和接收系统》（Freenet: A Distributed Anonymous Information Storage and Retrieval System）， 是 2000 年被引用次数最多的计算机科学论文（来源：Citeseer）。Freenet 也给世界法律和哲学论文带来了灵感。Ian Clarke，Freenet 的创造者和项目协调人，被 2003 年《麻省理工科技评论 》杂志（MIT's Technology Review）评为世界百强革新者。

source: An important recent development, which very few other networks have, is the "darknet": By only connecting to people they trust, users can greatly reduce their vulnerability, and yet still connect to a global network through their friends' friends' friends and so on. This enables people to use Freenet even in places where Freenet may be illegal, makes it very difficult for governments to block it, and does not rely on tunneling to the "free world".
es: Un importante desarrollo reciente, que muy pocas otras redes tienen, es la "darknet" (red oscura): Al conectar sólo con personas en las que confían, los usuarios pueden reducir enormemente su vulnerabilidad, y todavía conectar a una red global a través de amigos de amigos de amigos, etc. Esto permite a las personas usar Freenet incluso en lugares donde Freenet puede ser ilegal, hace que sea muy difícil para los gobiernos bloquearlo, y no se fundamenta en el establecimiento de túneles hacia el "mundo libre".
zh_cn: 在最近的开发中，我们引入了一个重要的功能（在其他类似网络中鲜见），称为“暗网（Darknet）”：用户仅与自己信任的人互相连接，这能够极大的降低他们的风险，同时仍然能够通过他们朋友的朋友的朋友来连接到整个 Freenet 网络。这能够让那些“使用 Freenet 即违法”的地方的人们使用 Freenet。政府很难封禁它，用户无需“翻墙隧道”就可以进入“自由的世界”。

source: The Philosophy behind Freenet
es: La filosofía detrás de Freenet
zh_cn: Freenet 背后的哲学

source: *Written by Ian Clarke* 1. [A Disclaimer](#disclaimer) 2. [Suggested prior reading](#prior_reading) 3. [The importance of the Free flow of information](#free_flow_info) 4. [Censorship and freedom](#censor_freedom) 5. [The solution](#solution) 6. [Isn't censorship sometimes necessary?](#is_censorship_necessary) 7. [But why is anonymity necessary?](#why_anonymity) 8. [And what of copyright?](#copyright) 9. [But how will artists be rewarded for their work without copyright?](#reward) 10. [Alternatives to Copyright](#alternative)
es: *Escrito por Ian Clarke* 1. [Un descargo](#disclaimer) 2. [Lectura previa sugerida](#prior_reading) 3. [La importancia del intercambio Libre de información](#free_flow_info) 4. [Censura y libertad](#censor_freedom) 5. [La solución](#solution) 6. [¿No es necesaria a veces la censura?](#is_censorship_necessary) 7. [¿Pero por qué es necesario el anonimato?](#why_anonymity) 8. [¿Y qué hay del copyright?](#copyright) 9. [¿Pero cómo serán recompensados los artistas por su trabajo sin copyright?](#reward) 10. [Alternativas al Copyright](#alternative)
zh_cn: *作者：Ian Clarke* 1. [免责声明](#disclaimer) 2. [建议提前阅读](#prior_reading) 3. [自由信息流的重要性](#free_flow_info) 4. [审查制度和自由](#censor_freedom) 5. [解决方案](#solution) 6. [有时审查制度不是必须的吗？](#is_censorship_necessary) 7. [但是为何需要匿名？](#why_anonymity) 8. [版权又将怎样？](#copyright) 9. [但若艺术家的工作没有版权，他们如何得到回报？](#reward) 10. [版权的替代品](#alternative)

source: ### 1\. A Disclaimer There are many reasons why people get involved in the Freenet Project. Some share the views outlined in this document; some share variations of these views, which are also served by what we are trying to achieve; and some just enjoy the technical challenge. These are the ideas which motivated me to architect the system in the first place, but not necessarily the views that everyone involved in the Freenet Project holds.
es: ### 1\. Un descargo Hay muchas razones por las que la gente se involucra en el Freenet Project. Algunas comparten los puntos de vista perfilados en este documento; algunas comparten variaciones de estos puntos de vista, que también se sirven de aquello que estamos tratando de conseguir; y algunos simplemente disfrutan del desafío técnico. Estas son las ideas que me motivaron para diseñar el sistema en primer término, pero no necesariamente los puntos de vista que todos los involucrados en el Freenet Project mantienen.

source: ### 2\. Suggested prior reading For this document to make sense, you should probably know what Freenet is. You can get a good overview from [What is Freenet?](about.html#introduction).
es: ### 2\. Lectura previa sugerida Para que este documento tenga sentido, probablemente debería conocer lo que es Freenet. Puede lograr una buena visión de conjunto a partir de [¿Qué es Freenet?](about.html#introduction).
zh_cn: ### 2\. 建议提前阅读 要理解本文讲述的内容，您应该事先了解什么是 Freenet。您可以先阅读《[什么是 Freenet?](about.html#introduction)》章节，以大致了解。

source: ### 3\. The importance of the Free flow of information Freedom of speech, in most western cultures, is generally considered to be one of the most important rights any individual might have. Why is the freedom to share ideas and opinions so important? There are several ways to answer this question.
es: ### 3\. La importancia del intercambio Libre de información La libertad de expresión, en la mayoría de las culturas occidentales, generalmente se considera que es uno de los derechos fundamentales más importantes que cualquier individuo podría tener. ¿Por qué es tan importante la libertad de compartir ideas y opiniones? Hay varias formas de responder a esta pregunta.
zh_cn: ### 3\. 自由信息流的重要性 言论自由，在大多数西方文化中，被普遍认为是个人最重要的权利之一。为什么自由分享想法和观点如此重要？可以从几个方面来回答这个问题。

source: #### 3.1 Communication is what makes us human One of the most obvious differences between mankind and the rest of the animal kingdom is our ability to communicate sophisticated and abstract concepts. While we constantly discover that animal's communication ability is more sophisticated than previously assumed, it is unlikely that any other animal approaches our own level of ability in this area.
es: #### 3.1 La comunicación es lo que nos hace humanos Una de las diferencias más obvias entre la humanidad y el resto del reino animal es nuestra capacidad de comunicar conceptos sofisticados y abstractos. Aunque descubrimos constantemente que la capacidad de comunicación de los animales es más sofisticada de lo que previamente asumimos, es improbable que cualquier otro animal se aproxime a nuestro nivel de capacidad en este área.
zh_cn: #### 3.1 沟通是我们之所以成为人类的原因 人类和其他动物王国最显著的不同是我们的复杂沟通和抽象概念的能力。虽然我们现在发现动物之间的沟通其实也十分复杂，但其他动物要达到我们的沟通水平几乎是不可能的。

source: #### 3.2 Knowledge is good Most people, given the option of knowing something and not knowing something, will choose to have more information rather than less. Wars have been won and lost over who was better-informed. This is because being better-informed allows us to make better decisions, and generally improve our ability to survive and be successful.
es: #### 3.2 El conocimiento es bueno La mayoría de las personas, dada la opción de conocer algo o no conocerlo, escojerá tener más información en lugar de menos. Se han ganado y perdido guerras en base a quien estaba mejor-informado. Esto es a causa de que estar mejor-informado nos permite tomar mejores decisiones, y generalmente mejorar nuestra capacidad de sobrevivir y tener éxito.
zh_cn: #### 3.2 知识为善 大多数人对于某件事，面对“懂”与“不懂”的选择时，都会去选择去弄懂，了解更多信息。战争见多识广的一方更可能赢。这是因为见多识广让我们能够做出更好的决定，让我们更有能力生存和成功。

source: #### 3.3 Democracy assumes a well informed population Many people today live under democratic governments, and those who don't, probably want to. Democracy is an answer to the question of how to create leaders, while preventing them from abusing that power. It achieves this by giving the population the power to regulate their government through voting, yet the ability to vote does not necessarily mean that you live in a democratic country. For a population to regulate their government effectively it must know what their government is doing, they must be well informed. It is a feedback loop, but this loop can be broken if the government has the power to control the information the population has access to.
es: #### 3.3 La democracia asume una población bien informada Muchas personas hoy día viven bajo gobiernos democráticos, y aquellos que no, probablemente querrían. La democracia es una respuesta a la cuestión de cómo crear líderes, mientras evitamos que abusen del poder. Esto lo logra dando a la población el poder de regular su gobierno mediante el voto, aunque la capacidad de votar no significa necesariamente que viva en un país democrático. Para que una población regule su gobierno de forma efectiva tiene que conocer lo que su gobierno está haciendo, debe estar bien informada. Es un bucle reactivo, pero este bucle puede romperse si el gobierno tiene el poder de controlar la información a la que la población tiene acceso.
zh_cn: #### 3.3 民主需要知情的人民 很多人今天都生活在一个民主的政权。而其他人，可能也想。民主是“如何创造领导人、且避免权力滥用”这一问题的答案。人民通过投票权来监管他们的政府，但是拥有投票权并不意味着您生活在一个民主的国家。为了有效的监管他们的政府，人民必须知道政府正在做什么。他们必须充分知情。这是一个反馈循环，但若政府有权控制人民可以掌握的信息，该循环便可被破坏。

source: ### 4\. Censorship and freedom Everyone values their freedom, in fact, many consider it so important that they will die for it. People like to think that they are free to form and hold whatever opinions they like, particularly in western countries. Consider now that someone had the ability to control the information you have access to. This would give them the ability to manipulate your opinions by hiding some facts from you, by presenting you with lies and censoring anything that contradicted those lies. This is not some Orwellian fiction, it is standard practice for most western governments to lie to their populations, so much so, that people now take it for granted, despite the fact that this undermines the very democratic principles which justify the government's existence in the first place.
es: ### 4\. Censura y libertad Todos valoran su libertad, de hecho, muchos la consideran tan importante que morirían por ella. A la gente le gusta pensar que es libre de conformar y sostener cualquier opinión que deseen, particularmente en los países occidentales. Ahora considere que alguien tiene la capacidad de controlar la información a la que usted tiene acceso. Esto le daría a aquel la capacidad de manipular sus opiniones al ocultarle algunos hechos, al presentarle a usted mentiras y censurando cualquier cosa que contradiga esas mentiras. Esto no es ninguna ficción orweliana, es una práctica estándar para la mayoría de los gobiernos occidentales mentir a sus poblaciones tanto, que esas personas ahora lo dan por sentado a pesar del hecho de que esto socava los principios democráticos mismos que justifican en primer término la existencia del gobierno.
zh_cn: ### 4\. 审查制度和自由 每个人都珍视他们的自由，很多人为之奋斗至终。人们认为他们应该能够自由的形成和持有任何观点，特别是在西方国家。假如某人有能力控制您可以掌握的信息，他们就可以对您欺骗，并审查隐藏那些可以揭穿谎言的信息，从而操控您的思想。这并不只是集权的假象，大部分西方的政府实际上就是这样欺骗民众的，以至于人们视之为理所当然。然而事实是这暗中破坏了民主的原则，该原则决定了此政府的存在与否。

source: ### 5\. The solution The only way to ensure that a democracy will remain effective is to ensure that the government cannot control its population's ability to share information, to communicate. So long as everything we see and hear is filtered, we are not truly free. Freenet's aim is to allow two or more people who wish to share information, to do so.
es: ### 5\. La solución La única forma de asegurar que una democracia seguirá siendo efectiva es garantizar que el gobierno no puede controlar la capacidad de su población de compartir información, de comunicarse. En tanto todo lo que veamos y escuchemos esté filtrado, no somos verdaderamente libres. La meta de Freenet es permitir que dos o más personas que deseen compartir información, así lo hagan.
zh_cn: ### 5\. 解决方案 确保民主仍然有效的唯一方法是保证政府无法控制人民分享信息、沟通的能力。只要我们能看到和听到的每件事都被过滤，我们不会真正的自由。Freenet 的目标就是允许愿意互相分享信息的人们，能够自由的分享。

source: ### 6\. Isn't censorship sometimes necessary? Of course no issue is black and white, and there are many who feel that censorship is a good thing in some circumstances. For example, in some European countries propagating information deemed to be racist is illegal. Governments seek to prevent people from advocating ideas which are deemed damaging to society. There are two answers to this however. The first is that you can't allow those in power to impose "good" censorship, without also enabling them to impose "bad" censorship. To impose any form of censorship a government must have the ability to monitor and thus restrict communication. There are already criticisms that the anti-racism censorship in many European countries is hampering legitimate historical analysis of events such as the second world war. The second argument is that this "good" censorship is counter-productive even when it does not leak into other areas. For example, it is generally more effective when trying to persuade someone of something to present them with the arguments against it, and then answer those arguments. Unfortunately, preventing people from being aware of the often sophisticated arguments used by racists, makes them vulnerable to those arguments when they do eventually encounter them. Of course the first argument is the stronger one, and would still hold-true even if you didn't accept the second. Basically, you either have censorship, or you don't. There is no middle-ground.
es: ### 6\. ¿No es necesaria a veces la censura? Por supuesto que ningún asunto es blanco o negro, y hay muchos que sienten que la censura es algo bueno en determinadas circunstancias. Por ejemplo, en algunos países europeos propagar información que se estime racista es ilegal. Los gobiernos buscan prevenir que la gente propugne ideas consideradas dañinas para la sociedad. Sin embargo, hay dos respuestas a esto. La primera es que no se puede permitir que aquellos en el poder impongan una censura "buena", sin habilitarles también a imponer una censura "mala". Para imponer cualquier forma de censura un gobierno debe tener la capacidad de monitorizar y por tanto restringir la comunicación. Ya hay críticas acerca de que la censura anti-racista en muchos países europeos está entorpeciendo el legítimo análisis histórico de eventos tales como la segunda guerra mundial. El segundo argumento es que esta censura "buena" es contraproducente incluso cuando no afecta a otras áreas. Por ejemplo, cuando intentamos persuadir a alguien de algo generalmente es más efectivo presentarle los argumentos en contra de ello, y luego rebatir esos argumentos. Desafortunadamente, prevenir que la gente esté al tanto de los argumentos a menudo sofisticados usados por los racistas, les hace más vulnerables a esos argumentos cuando eventualmente se los encuentran. Por supuesto el primer argumento es el más fuerte, y aún sería cierto si no ha aceptado la validez del segundo. Básicamente, o bien tiene censura, o no. No hay término medio.
zh_cn: ### 6\. 有时审查制度不是必须的吗？ 所有问题都不是非黑即白的，很多人都认为在某些情况下审查制度是个好东西。例如，在某些欧洲国家，传播种族主义信息是违法的。政府寻求阻止此思想的宣扬，以免破坏社会。但对此行为有两种争论。首先，您不能确保当权者实施“好的”审查制度，而不实施“坏的”审查制度。要实施任何形式的审查制度，政府一定拥有监视和限制沟通的权力。在很多欧洲国家已经有对种族主义审查制度的批评，它阻止了合理的对历史事件的分析（如第二次世界大战）。 第二种争论是，即使“好的”审查制度没有渗入其他领域，它仍然会起到反作用。例如，通常来说，将争议摆在桌面，回答这些争议，更容易说服某人。不幸的是，虽然阻止了人们了解种族主义分子的争议，但当他们最终遇到这些争论时，他们会变得更加脆弱。 当然第一种争论是最强的，即使您不接受第二种争论，它也是正确的。根本上，要么存在审查制度，要么不存在。不存在中间的情况。

source: ### 7\. But why is anonymity necessary? You cannot have freedom of speech without the option to remain anonymous. Most censorship is retrospective, it is generally much easier to curtail free speech by punishing those who exercise it afterward, rather than preventing them from doing it in the first place. The only way to prevent this is to remain anonymous. It is a common misconception that you cannot trust anonymous information. This is not necessarily true, using digital signatures people can create a secure anonymous pseudonym which, in time, people can learn to trust. Freenet incorporates a mechanism called "subspaces" to facilitate this.
es: ### 7\. ¿Pero por qué es necesario el anonimato? No puede tener libertad de expresión sin la opción de permanecer anónimo. La mayoría de la censura es retrospectiva, generalmente es mucho más fácil restringir la libertad de expresión castigando a aquellos que la ejercitan con posterioridad, en lugar de evitar que la ejerciten en primer término. La única manera de prevenir esto es permanecer anónimo. Es un error común de concepto la imposibilidad de confiar en la información anónima. Esto no es necesariamente verdad, usando firmas digitales las personas pueden crear pseudónimos anónimos en los que, con el tiempo, la gente aprende a confiar. Freenet incorpora un mecanismo llamado "subespacios" para facilitar esto.
zh_cn: ### 7\. 但是为何需要匿名？ 如果您无法匿名，您不可能拥有言论自由。大部分的审查是可追溯的。在发表言论后再惩罚相关人员，比在言论发表第一时间处理更容易。唯一可避免惩罚的方式就是保持匿名。有一个常见的误解是，匿名信息不可信。这不一定是正确的。使用数字签名，人们可以创建一个安全的笔名，他人可以去信任这个笔名。Freenet 引入了“子空间（Subspaces）”的机制来使之成为可能。

source: ### 8\. And what of copyright? Of course much of Freenet's publicity has centered around the issue of copyright, and thus I will speak to it briefly. The core problem with copyright is that enforcement of it requires monitoring of communications, and you cannot be guaranteed free speech if someone is monitoring everything you say. This is important, most people fail to see or address this point when debating the issue of copyright, so let me make it clear: > *You cannot guarantee freedom of speech and enforce copyright law* It is for this reason that Freenet, a system designed to protect Freedom of Speech, must prevent enforcement of copyright.
es: ### 8\. ¿Y qué hay acerca del copyright? Por supuesto mucha de la publicidad de Freenet se ha centrado en el asunto del copyright (derechos de copia), y por tanto hablaré de ello brevemente. El problema principal con el copyright es que hacerlo respetar requiere monitorizar las comunicaciones, y usted no puede tener garantizada la libertad de expresión si alguien está monitorizando todo lo que dice. Esto es importante, la mayoría de la gente no percibe o incide en este punto al debatir el asunto del copyright, así que permítame aclararlo: > *No puede garantizar la libertad de expresión y hacer respetar las leyes de copyright* Es por esta razón que Freenet, un sistema diseñado para proteger la libertad de expresión, debe evitar hacer respetar el copyright.
zh_cn: ### 8\. 版权又将怎样？ Freenet 的很多媒体报道都关注它带来的版权问题，因此我在这里简单说一下。版权的核心问题在于，为了保护版权，就需要监视通讯。如果某人监视了您所说的一切，您的言论自由就无法保障。这非常重要，在人们争论保护版权的问题时，往往忽略了这一点。因此，我再次强调： > *您无法在保证言论自由的同时实施版权法* 这就是 Freenet——一个被设计为保护言论自由的系统——拒绝保护版权的原因。
