Repository: hyphanet/website
Catalog: locale/*/LC_MESSAGES/freenet_site.po
Languages: es, zh_cn

source: Is there a Help Site that goes deeper into the questions newbies may have about Freenet, and where people can contribute too?
es: ¿Hay algún sitio de ayuda que profundice en las preguntas que los novatos puedan tener sobre Freenet, y donde la gente también pueda contribuir?
zh_cn: 有没有帮助台来解答新手提出的有关 Freenet 的问题，以及人们可以在那里做出贡献？

source: Have a look at [our wiki](https://wiki.freenetproject.org/). An older wiki, which is now read-only, but has a fair amount of content so is sometimes helpful is [here](https://old-wiki.freenetproject.org/). There are also several implementations of wiki's over Freenet. The most recent one is called Jfniki. There is a link in the default bookmarks on the Browse Freenet page after you install Freenet.
es: Eche un vistazo a [nuestro wiki](https://wiki.freenetproject.org/). Un wiki más antiguo, que ahora es de sólo lectura pero tiene una buena cantidad de contenidos, de modo que a veces es útil, lo tiene [aquí](https://old-wiki.freenetproject.org/). Además hay varias implementaciones de software de wikis para Freenet. La más reciente se llama Jfniki. Habrá un enlace en los marcadores predeterminados en la página Navegar por Freenet después de que instale Freenet.

source: Where can I report bugs?
es: ¿Dónde puedo informar de fallos?
zh_cn: 我可以在哪报告 Bug？

source: You can use our [bug tracking system](https://bugs.freenetproject.org/) or send a mail to our [support mailing list](help.html#mailing-lists).
es: Puede usar nuestro [sistema de monitorización de fallos](https://bugs.freenetproject.org/) o enviarnos un correo a nuestra [lista de correo de soporte](help.html#mailing-lists).
zh_cn: 您可以使用我们的 [Bug 跟踪系统](https://bugs.freenetproject.org/) 或者发邮件到 [用户支持邮件列表](help.html#mailing-lists)。

source: I'm a theoretical computer scientist/mathematician, how can I help?
es: Soy un científico computacional/matemático teórico, ¿cómo puedo ayudar?
zh_cn: 我是个理论计算机科学家/数学家，我能帮什么吗？

source: See [here](https://wiki.freenetproject.org/Research_challenges).
es: Eche un vistazo [aquí](https://wiki.freenetproject.org/Research_challenges).
zh_cn: 参见[这里](https://wiki.freenetproject.org/Research_challenges)。

source: Security
es: Seguridad
zh_cn: 安全

source: Can I use my regular browser to browse Freenet?
es: ¿Puedo usar mi navegador regular para navegar por Freenet?
zh_cn: 我可以使用我的日常浏览器浏览 Freenet 吗？

source: Freenet has a web interface: much of the content on Freenet is in the form of "freesites", and downloads, configuration and friend connections can be managed from the web interface. However, because of weaknesses in current browsers, we **strongly** recommend that you use a separate browser for Freenet. Specifically, browser history stealing, in all its forms, is a major threat if you share a browser between Freenet and the WWW at large: malicious web pages will be able to probe which freesites you have visited, and report this information to their owners. Privacy/incognito mode may be sufficient, and Windows tray app will start a browser running in this mode.
es: Freenet tiene una interfaz web: mucho del contenido en Freenet está en forma de "freesites" y descargas, la configuración y las conexiones de amigos se pueden gestionar desde la interfaz web. Sin embargo, a causa de la debilidad en los navegadores actuales, recomendamos **firmemente** que use un navegador aparte para Freenet. Específicamente, el robo del historial del navegador, en todas sus formas, es una gran amenaza si comparte en gran medida un navegador entre Freenet y la WWW: páginas web maliciosas podrían sondear qué freesite ha visitado, y entregar esta información a sus dueños. El modo privacidad/incognito puede ser suficiente, y la aplicación de bandeja de sistema de Windows iniciará un navegador en este modo.

source: Won't attack X break Freenet's anonymity?
es: ¿Algún ataque X no romperá el anonimato de Freenet?
zh_cn: 攻击者 X 不会打破 Freenet 的匿名性？

source: **Short answer**: Probably, on opennet. Maybe, on darknet. **Long answer**: Freenet has a different threat model to Tor and the Mixmaster remailers. Freenet is designed to resist censorship: The network must therefore be robust, and content must be distributed without requiring a central server, whether anonymous or not. Anonymity is important for requesters and especially for those who upload content in the first place. The typical example is a corporate or government whistleblower. Generally to find the originator of some content, the attacker must be able to predict the data in advance, must be able to move across the network relatively quickly, and must be able to perform the attack while the data is being inserted; after that, it is distributed across the network and is much harder to trace, and the originator may have left the network. However, if by chance or by overwhelming force the attacker is connected to the whistleblower (or e.g. seizes the computers of everyone on the network), he may be able to identify this much more quickly. All of this is vastly more difficult on a darknet, where everyone connects only to their friends, where it is very hard for an attacker to find nodes, and where to connect to a given node he must social engineer its operator! Freenet does support opennet mode (plug and play), but darknet is far more secure, and far more difficult to block on a national firewall. Tor on the other hand is designed to anonymise real-time data streams, on the assumption that the list of nodes can be public, that there is a free world where nodes can be operated safely, that the authors of controversial content will be able to either host (hidden) web servers themselves or upload it to other (hidden, but usually centralised) storage systems, and so on. And Tor has a concept of a "client", which is somebody who uses the service without providing any value to it; on Freenet, every node relays data for its neighbours. Hence the attacks on Freenet are completely different to the attacks on Tor. Both compromise to some degree to enable more or less real-time performance.
es: **Respuesta corta**: Probablemente, en la opennet. Quizá, en la darknet. **Respuesta larga**: Freenet tiene un modelo de amenaza distinto del de Tor y los reemisores de corrreo Mixmaster, Freenet está diseñado para resistir la censura: Por tanto la red debe ser robusta, y los contenidos deben estar distribuidos sin requerir un servidor central, tanto si son anónimos como si no. El anonimato es importante para los peticionarios, y especialmente para aquellos que suben contenido en primer término. El ejemplo típico es un informante de una corporación o gobierno. Generalmente, para encontrar al originador de algún contenido, el atacante debe poder predecir los datos por adelantado, debe poder moverse a lo largo de la red de forma relativamente rápida, y debe poder realizar el ataque mientras los datos se están insertando; tras la inserción se distribuyen por toda la red y son mucho más difíciles de rastrear, y el originador puede haber abandonado la red. Sin embargo, si por casualidad, o mediante un forzado masivo, el atacante está conectado con el informante (p.e. asalta las computadoras de todos los participantes en la red), puede ser capaz de identificar los datos de forma mucho más rápida. Todo esto es enormemente más difícil en una darknet, donde todos se conectan sólo a sus amigos, donde es muy difícil para un atacante encontrar nodos, y donde para conectar a un nodo determinado ¡el atacante tiene que haber logrado manipular la voluntad (social engineering) de su operador! Freenet soporta el modo opennet (conectar y funcionar), pero el modo darknet es mucho más seguro, y mucho más difícil de bloquear en un cortaguegos (firewall) nacional. Por otro lado, Tor está diseñado para anonimizar flujos de datos (streams) en tiempo-real, asumiendo que la lista de nodos puede ser pública, que hay un mundo libre donde los nodos pueden ser operados de forma segura, que los autores de contenido controvertido podrán bien alojar servidores web (de forma oculta) por si mismos, o subirlos a otros sistemas de almacenamiento, (ocultos, pero normalmente centralizados) y demás. Y Tor tiene un concepto de "cliente", equivalente a que alguien usa el servicio sin proporcionar a cambio ningún valor añadido; en Freenet, cada nodo repite datos para sus vecinos. Por tanto, los ataques sobre Freenet son completamente distintos a los ataques sobre Tor. Ambos precisan habilitar hasta cierto punto más o menos rendimiento en tiempo-real.

source: If you can use the darknet, trust your friends, don't reinsert files, always use the "Insert a random, safe key" option, and change your anonymous identity after some volume of inserts, you should be relatively safe using Freenet. However this has not yet been quantified. If you can connect, build up some trust in your anonymous persona, insert your controversial content, and then disappear, again, you are better off with Freenet, especially if the content is a website (but if you are connecting on opennet, beware of seednode compromises). In some other cases, Tor is better. We are still working on Freenet's security and there are major security enhancements which have not yet been implemented, most of which will go in before 1.0\. Cryptographic tunnels similar to Tor's onion routing are one possibility, which would greatly reduce the impact of many of the below attacks, but there are several other enhancements planned, both to anonymity and to network robustness/undetectability.
es: Si puede usar la darknet, confíe en sus amigos, no reinserte ficheros, use siempre la opción "Insertar una clave aleatoria segura", y cambie su identidad anónima después de un cierto volumen de inserciones, así debería estar relativamente seguro usando Freenet. Sin embargo, esto aún no ha sido cuantificado. Si puede conectar, desarrolle confianza sobre su personaje anónimo, inserte su contenido controvertido, y luego desaparezca de nuevo, así estará en mejor situación con Freenet, especialmente si el contenido es un sitio web (pero si está conectando en modo opennet, tenga en cuenta los compromisos del nodo semilla). En algunos otros casos, Tor es mejor. Aún estamos trabajando en la seguridad de Freenet, y hay importantes mejoras de seguridad que aún no han sido implementadas, la mayoría de las cuales se introducirán antes de la 1.0\. Los túneles criptográficos similares al enrutamiento onion (cebolla) de Tor, son una posibilidad, que reduciría enormemente el impacto de muchos de los ataques descritos debajo, pero hay otras cuantas mejoras planeadas, tanto para el anonimato como para la robustez/indetectabilidad de la red.

source: **Major known attacks**: In the interests of giving would-be users as much information as possible, and on the assumption that any serious attacker would do their homework, here are the major classes of attack on Freenet we are presently aware of:
es: **Principales ataques conocidos**: En interés de proporcionar a los usuarios potenciales tanta información como sea posible, y asumiendo que cualquier atacante serio haría sus deberes, estos son los principales tipos de ataques sobre Freenet de los que actualmente tenemos conocimiento:

source: * **Harvesting**: Simply by running some powerful Freenet nodes, an attacker can identify most of the opennet (Strangers network) relatively easily. These nodes can then be attacked one by one (subject to resources), their traffic analysed, or simply be blocked on a national firewall. Connecting only to friends (darknet) largely solves this problem. ISPs may be able to identify Freenet nodes with some effort, although we make this fairly difficult: Freenet's current protocol is designed to be hard to detect, and steganography will be introduced at some point. However, traffic flow analysis, or brute-force blocking of all peer to peer traffic (e.g. traffic between IP addresses marked as "consumer" rather than "business"), both of which would hit a lot of things other than Freenet, would likely be effective for quite some time.
es: * **Cosechado**: Simplemente ejecutando algunos nodos Freenet potentes, un atacante puede reconocer la mayoría de la opennet (red de desconocidos) con relativa facilidad. Estos nodos pueden entonces ser atacados uno por uno (en función de los recursos), ser analizado su tráfico, o simplemente ser bloqueado por un cortafuegos (firewall) nacional. Conectar sólo con amigos (darknet) soluciona en gran medida este problema. Los ISPs pueden ser capaces de identificar los nodos Freenet con algún esfuerzo, sin embargo ponemos esto bastante difícil: el actual protocolo de Freenet está diseñado para ser difícil de detectar, y se va a introducir la esteganografía en algún momento. Sin embargo, el análisis del flujo de tráfico, o el bloqueo por fuerza bruta de todo el tráfico entre pares (P2P, ej. tráfico entre direcciones IP marcadas como "consumidor" en lugar "negocios"), acciones que entre ambas filtrarían montones de cosas distintas de Freenet, probablemente serían efectivas durante bastante tiempo.

source: * **Bootstrapping attacks**: Unless a node only connects to friends, it will have to connect to the opennet "seednodes" to announce itself and get initial peers to connect to. At the moment there are relatively few seednodes and the list is maintained manually. The seednodes could be blocked easily by a national firewall etc, but also, there is little to prevent attackers from setting up their own seednodes and submitting them, and then "capturing" any new Freenet users who connect to their nodes, in order to observe their traffic etc. Freenet will try to announce to multiple seednodes, but see the below section on "correlation attacks", which generally are feasible with only a single connection to the target. So this is a question of resources - if the attacker has the resources to surveil all new Freenet nodes, he has a good chance of pulling it off. In future we may have more seednodes, and only reveal a small proportion of them to each node, as Tor does with its hidden bridges, but that will not prevent attackers from creating lots of malicious seednodes and getting them into the official lists, and it will likely still be possible to block all the seednodes with some effort (something similar has already happened to Tor hidden bridges in China). Combined with harvesting and adaptive search attacks, this attack explains why opennet is regarded by many core developers as hopelessly insecure. If you want good security you need to connect only to friends. Hit and run inserts are possible, and can be relatively safe in terms of many of the other attacks, but you are taking the risk that the opennet seednode you connect to may be malicious.
es: * **Ataques de inicialización**: A menos que un nodo conecte sólo con nodos de amigos, tendrá que conectarse a los "seednodes" (nodos semilla) de la opennet para anunciarse a si mismo y obtener los pares iniciales a los que conectar. De momento hay relativamente pocos nodos semilla y la lista se mantiene de forma manual. Los nodos semilla podrían ser bloqueados fácilmente por un cortafuegos (firewall) nacional, etc., pero además, poco se puede hacer para evitar que los atacantes establezcan sus propios nodos semilla y los ofrezcan, para luego "capturar" cualquier nuevo usuario de Freenet que conecte con sus nodos, para observar su tráfico, etc. Freenet tratará de anunciarse en múltiples nodos semilla, pero vea la sección de debajo sobre "ataques de correlación", que generalmente son factibles con una única conexión al objetivo. Así que esta es una cuestión de recursos - si el atacante tiene los recursos para vigilar todos los nuevos nodos de Freenet, tiene una buena oportunidad de lograr sus propósitos. En el futuro puede que tengamos más nodos semilla, y sólo revelemos una pequeña proporción de ellos a cada nodo, como hace Tor con sus 'puentes' ocultos, pero que no evitarán que los atacantes creen montones de nodos semilla maliciosos y los coloquen en las listas oficiales, y probablemente aún será posible bloquear todos los nodos semilla con algún esfuerzo (algo similar está ya ocurriendo con los puentes ocultos de Tor en China). Combinado con los ataques de cosechado y búsqueda adaptativa, este ataque explica por qué la opennet es descrita por muchos desarrolladores principales como perdidamente insegura. Si quiere una buena seguridad necesita conectar sólo con amigos (darknet). Las inserciones por sorpresa y desaparición posterior en la opennet son posibles, y pueden ser relativamente seguras en relación a muchos de los demás ataques, pero usted está corriendo el riesgo de que el nodo semilla de la opennet al que se conecta pueda ser malicioso.

source: * **Correlation attacks**: If you are connected to a node, and can recognise the keys being requested (probably because it was posted publicly), you can show statistically that the node in question probably requested it, based on the proportion of the keys requested from that node, the locations of nearby nodes, the HTL on the requests and so on. This will be largely eliminated by tunnels (but these will be quite expensive so may need to be turned off by default except for predictable blocks), but in any case it requires a rather powerful attacker compared to the next attack... Note also that if you only connect to your friends, a remote attacker will have to either co-opt your friends or social engineer you into giving them a connection; either way, connecting to the entire network this way is rather expensive: If they already suspect you personally they'll probably bug your keyboard rather than trying to connect to your Freenet node!
es: * **Ataques de correlación**: Si está conectado a un nodo, y puede reconocer las claves que se están pidiendo (probablemente porque fueron difundidas públicamente), puede mostrar estadísticamente que el nodo en cuestión pidió probablemente una clave concreta, en base a la proporción de claves pedidas desde ese nodo, las ubicaciones de nodos cercanos, los HTL (hops to live, vida de la petición en saltos) en las peticiones, y demás. En gran medida esto se paliará con los túneles (pero serán bastante caros, así que puede ser necesario que de forma predeterminada se apaguen excepto para bloques predecibles), pero en todo caso requiere un atacante bastante potente comparado con el ataque descrito a continuación... Observe también que si usted sólo conecta con sus amigos, un atacante remoto tendrá que, o bien lograr ser asimilado entre sus amigos, o hacerle a usted ingeniería social para que le proporcione una conexión; de cualquier manera, conectarse a la totalidad de la red de esta forma es bastante caro: ¡Si sus atacantes ya se han fijado en usted personalmente, es probable que monitoricen su teclado en lugar de intentar conectar a su nodo Freenet!
