Repository: hyphanet/website
Catalog: locales/*/LC_MESSAGES/freenet_site.po
Languages: fr

source: * **Bootstrapping attacks**: Unless a node only connects to friends, it will have to connect to the opennet "seednodes" to announce itself and get initial peers to connect to. At the moment there are relatively few seednodes and the list is maintained manually. The seednodes could be blocked easily by a national firewall etc, but also, there is little to prevent attackers from setting up their own seednodes and submitting them, and then "capturing" any new Freenet users who connect to their nodes, in order to observe their traffic etc. Freenet will try to announce to multiple seednodes, but see the below section on "correlation attacks", which generally are feasible with only a single connection to the target. So this is a question of resources - if the attacker has the resources to surveil all new Freenet nodes, he has a good chance of pulling it off. In future we may have more seednodes, and only reveal a small proportion of them to each node, as Tor does with its hidden bridges, but that will not prevent attackers from creating lots of malicious seednodes and getting them into the official lists, and it will likely still be possible to block all the seednodes with some effort (something similar has already happened to Tor hidden bridges in China). Combined with harvesting and adaptive search attacks, this attack explains why opennet is regarded by many core developers as hopelessly insecure. If you want good security you need to connect only to friends. Hit and run inserts are possible, and can be relatively safe in terms of many of the other attacks, but you are taking the risk that the opennet seednode you connect to may be malicious.
fr: * **Les attaques d’amorçage ** : à moins qu’un nœud ne se connecte qu’à des amis, il devra se connecter à des « nœuds de propagation » du réseau ouvert afin de s’annoncer et d’obtenir les premiers pairs à qui se connecter. Pour l’instant, les nœuds de propagation sont assez peu nombreux, et la liste est tenue à jour manuellement. Les nœuds de propagation pourraient facilement être bloqués par un pare-feu national, etc., mais les attaquants auraient la possibilité de mettre en place leurs propres nœuds de propagation sans trop de difficulté, de les faire accepter, et ensuite de « capturer » les utilisateurs de Freenet qui s’y connecteraient afin d’observer leur trafic, etc. Freenet tentera d’annoncer à plusieurs nœuds de propagation. Consulter la section ci-dessous sur les « attaques par corrélation », qui sont habituellement possibles avec une seule connexion vers la cible. C’est donc une question de ressources - si l’attaquant possède les ressources nécessaires pour surveiller tous les nœuds Freenet, il a de bonnes chances d’arriver à ses fins. Il se peut que nous ayons plus de nœuds de propagation à l’avenir, et que nous n’en révélions qu’une petite partie à chaque nœud, comme Tor le fait avec ses ponts cachés, mais cela n’empêchera pas les attaquants de créer de nombreux nœuds de propagation malveillants et de les faire ajouter aux listes officielles. Il sera ensuite encore possible de bloquer tous les nœuds de propagation avec un peu d’effort (quelque chose de semblable est déjà arrivé aux ponts cachés de Tor en Chine). En les combinant au moissonnage et aux attaques par recherche adaptative, certains développeurs principaux pensent que ces attaques rendent le réseau ouvert totalement vulnérable. Si une bonne sécurité est importante à vos yeux, vous devez seulement vous connecter à des amis. Des insertions éclair sont possibles, et peuvent être relativement à l’abri de plusieurs autres attaques, mais vous prenez le risque que le nœud de propagation auquel vous vous connectez sur le réseau ouvert puisse être malveillant.

source: * **Correlation attacks**: If you are connected to a node, and can recognise the keys being requested (probably because it was posted publicly), you can show statistically that the node in question probably requested it, based on the proportion of the keys requested from that node, the locations of nearby nodes, the HTL on the requests and so on. This will be largely eliminated by tunnels (but these will be quite expensive so may need to be turned off by default except for predictable blocks), but in any case it requires a rather powerful attacker compared to the next attack... Note also that if you only connect to your friends, a remote attacker will have to either co-opt your friends or social engineer you into giving them a connection; either way, connecting to the entire network this way is rather expensive: If they already suspect you personally they'll probably bug your keyboard rather than trying to connect to your Freenet node!
fr: * **Les attaques par corrélation** : si vous êtes connecté à un nœud et pouvez reconnaître les clés demandées (vraisemblablement parce qu’elles auront été publiées publiquement), vous pouvez démontrer statistiquement que le nœud en question les a probablement demandées, d’après la partie des clés demandées à partir de ce nœud, l’emplacement des nœuds à proximité, le HTL des requêtes, etc. Cela sera en grande partie éliminé par les tunnels (mais ils auront un coût plutôt élevé et seront peut-être désactivés par défaut, sauf pour les blocs prévisibles), mais dans tous les cas, il faudrait un attaquant assez puissant comparé à l’attaque suivante... Remarquez aussi que si vous vous connectez seulement à des amis, un attaquant distant devrait enrôler vos amis, ou vous mener, par piratage psychologique, à lui donner une connexion ; dans tous les cas, il serait plutôt coûteux de se connecter au réseau entier de cette façon : s’ils vous soupçonnent déjà personnellement, ils mettront probablement votre clavier sur écoute plutôt que d’essayer de se connecter à votre nœud Freenet !

source: * **Adaptive search**: If you want to find the author of some content, and you can predict the exact keys which will be inserted, and you are able to connect to new nodes at will, you may be able to listen out for the keys, guess where they must have come from, connect to nodes near there, and if your guess is correct, get more keys which gives you a more accurate fix on the originator, so the attack gets faster and faster and eventually converges on the originator. This attack is most powerful with inserts of big, predictable files, but the "Insert a random, safe key" option will make the keys unpredictable even if the content is guessable, by using random encryption keys. The downside is it produces a different key each time for the same file, and you can never safely reinsert the same file to the same key. Given that Freenet's data persistence is currently relatively poor, this is a problem. Anyway, if you _can_ use the random keys option, the attacker is unable to move towards you until after you announce the file: Most of his samples will come not from the actual content inserts but from chat posts. There are far fewer of these, and changing your pseudonymous identity periodically will help, provided the attacker cannot easily connect the new identity to the old one. Using a dedicated identity for posting sensitive content, which doesn't chat too much, again will help. Another thing which makes a huge difference is connecting only to your friends (i.e. using darknet): This makes it extremely difficult for an attacker to get new connections closer to where he thinks you must be, just as it helps with correlation attacks. So the biggest problems with this attack are 1) Files which are not very popular fall off Freenet relatively quickly, so need to be reinserted, but it is not safe to reinsert to the same key (this is why we have the "Insert a canonical key" option, for those who don't care about attacks), and 2) Chat can still be attacked. Tunnels will help to deal with both problems, and by default will only be used for predictable keys so can be relatively slow without this causing problems in practice. Also there is work going on on various techniques to allow users to do reinserts safely via for example preventing the attacker from seeing requests started before he connected. Another important point is this only works if the source is uploading new content, or chatting, regularly; creating and bootstrapping a new pseudonymous identity over a short period, doing a single insert (of any size) with the safe random key option, and announcing it, should be relatively safe from this attack, even on opennet - but see the section above on bootstrapping attacks.
fr: * **La recherche adaptative** : si vous souhaitez trouver l’auteur d’un contenu, que vous pouvez prédire exactement quelles clés seront insérées et vous connecter à de nouveaux nœuds comme il vous plaît, vous pourriez surveiller le passage de ces clés, deviner leur provenance, vous connecter à des nœuds à proximité, et si votre supposition s’avère obtenir plus de clés, ce qui vous permettrait de déterminer l’émetteur de manière plus précise encore afin que l’attaque s’accélère et atteigne enfin l’émetteur. Cette attaque déploie toute sa puissante lors de l’insertion de gros fichiers prévisibles. Mais en utilisant des clés de chiffrement aléatoires, l’option « Insérer une clé sûre aléatoire » rendra les clés imprévisibles même si l’on peut deviner le contenu. L’inconvénient est qu’une clé différente sera produite à chaque fois pour le même fichier, et que vous ne pourrez jamais réinsérer en toute sécurité le même fichier vers la même clé. C’est un problème dans la mesure où la persistance des données de Freenet est actuellement relativement faible. De toute façon, si vous utilisez l’option de clés aléatoires, l’attaquant pourra seulement se diriger vers vous après que vous aurez annoncé le fichier : la plupart de ses échantillons ne proviendront pas des insertions de contenu même, mais de clavardages. Ils sont bien moins nombreux, et il serait à votre avantage de changer votre identité pseudonyme périodiquement, à condition que l’attaquant ne puisse pas connecter facilement la nouvelle identité à l’ancienne. Il serait aussi à votre avantage d’utiliser une identité destinée à la publication de contenu délicat, sans trop l’utiliser pour le clavardage. Se connecter seulement à vos amis (c.-à-d. en utilisant le réseau invisible) fait une énorme différence : il devient ainsi extrêmement difficile à un attaquant d’obtenir de nouvelles connexions à proximité de l’endroit où il pense que vous êtes, et cela aide aussi contre les attaques par corrélation. Les plus importants problèmes posés par cette attaque sont 1) les fichiers qui ne sont pas très populaires disparaissent assez rapidement de Freenet et doivent être réinsérés, mais réinsérer vers la même clé présente des risques (c’est pourquoi nous proposons une option « Insérer une clé canonique » pour ceux qui ne se soucient pas des attaques), et 2) le clavardage peut encore être attaqué. Les tunnels aideront à régler ces deux problèmes, et ne seront utilisés par défaut que pour les clés prévisibles. Ils pourront ainsi être relativement lents sans que cela cause en pratique de problème. De plus, diverses techniques sont étudiées afin que les utilisateurs puissent effectuer des réinsertions sans risque, en empêchant par exemple l’attaquant de voir les requêtes lancées avant qu’il ne se connecte. Il est aussi important de noter que cela ne fonctionne que si la source téléverse du nouveau contenu ou clavarde régulièrement ; créer et amorcer une nouvelle identité pseudonyme sur une courte période, n’effectuer qu’une seule réinsertion (de n’importe quelle taille) en utilisant l’option de clé sûre aléatoire, et l’annoncer devrait être relativement à l’abri de cette attaque, même sur le réseau ouvert - consulter la section ci-dessus sur les attaques d’amorçage.

source: * **Traffic analysis**: Freenet provides minimal protection against global traffic analysis (basic message padding etc); if the attacker also has nodes on the network, the extra data will likely be helpful. We certainly do not guarantee that it is impossible to trace data transfers from one node to the next with detailed traffic data, however it is hoped that this will fall down on the busier nodes. One day we will implement steganographic transports and/or constant bitrate links as an option for more paranoid users. Note that on Tor-style networks, global traffic analysis will defeat the network completely: all that is needed is to observe both the entry and exit points.
fr: * **L’analyse du trafic** : Freenet ne fournit qu’une protection minimale contre l’analyse globale du trafic (bourrage de messages de base, etc.) ; si l’attaquant possède aussi des nœuds sur le réseau, les données supplémentaires aideront sûrement. Nous ne garantissons absolument pas qu’il est impossible de suivre à la trace les transferts de données d’un nœud à l’autre avec des données de trafic détaillées, cependant, l’on peut espérer que cela tombera sur les nœuds les plus occupés. Un jour prochain, nous mettrons en œuvre des transports sténographiques ou des liens à débit binaire constant comme option pour les utilisateurs plus paranoïaques. Il faut noter que sur les réseaux de type Tor, une analyse globale du trafic aurait entièrement raison du réseau. Il suffit d’observer à la fois les points d’entrée et de sortie.

source: * **Swapping attacks**: It is possible to attack the location swapping algorithm, and thereby disrupt routing on friend-to-friend networks. This has been demonstrated by the authors of the Pitch Black paper. We are working on a solution, but sadly at the moment most users use opennet.
fr: * **Les attaques par permutation** : il est possible d’attaquer l’algorithme de permutation d’emplacement, et ainsi d’interrompre le routage des réseaux d’ami à ami. Cela a été démontré par les auteurs de l’article « Pitch Black ». Nous nous efforçons de trouver une solution, mais malheureusement à ce jour, la plupart des utilisateurs utilisent le réseau ouvert.

source: More information on the current practical state of Freenet security is available [here](https://wiki.freenetproject.org/Security_summary).
fr: Vous trouverez [ici](https://wiki.freenetproject.org/Security_summary) plus d’informations sur l’état actuel concret de la sécurité de Freenet.

source: Is Freenet vulnerable to flooding attacks?
fr: Freenet est-il exposé aux attaques par inondation ?

source: Short answer: no. Long answer: We don't think so. Aside from protecting freedom of speech, Freenet is also designed to be an efficient dynamic caching system. If information is requested a lot from a limited number of nodes, the nodes that the requests pass through will cache the information, lowering the load on the network. If information is inserted on a limited set of nodes and then subsequently requested a lot from a separate set of nodes, with repetition, the sets will close in on one another in the network topology until they are "neighbors" and only the originally targeted nodes are suffering from the attack. In other words, in order to harm Freenet with a flood you need to consistently change your point of entry into the network and continually insert and request new data, and you will still only increase the workload for the network that is linear to your own. Given an immense will and capacity greater than the total of the entire network, it is possible to cripple any public network (including the Internet itself) with floods, but it is our intention to always keep Freenet as resistant to this as theoretically possible. Curiously enough, the above analysis only applies to [Opennet]( https://wiki.freenetproject.org/Opennet). On Darknet, you might have a little more success, although it would be much harder to change your entry point in any significant way. Nonetheless, you have a reasonably low bandwidth multiplier (the total number of nodes visited, around 20 on average), and you are severely limited by the number of nodes you can connect to, which will be low on a darknet.
fr: Réponse courte : non. Réponse longue : Nous ne pensons pas. En plus de protéger la liberté d’expression, Freenet est conçu pour être un système de mise en cache dynamique efficace. Si une information est demandée fréquemment par un nombre limité de nœuds, les nœuds par lesquels passeront les requêtes mettront l’information en cache, diminuant ainsi la charge du réseau. Si une information est insérée dans un ensemble limité de nœuds pour être par la suite beaucoup demandée par un autre ensemble de nœuds, et ce à répétition, les ensembles se rapprocheront les uns des autres dans la topologie du réseau jusqu’à ce qu’ils soient « voisins », et seuls les nœuds ciblés à l’origine subiront l’attaque. En d’autres mots, afin d’inonder Freenet, vous devez constamment changer votre point d’entrée dans le réseau, tout en insérant et en demandant continuellement des données nouvelles, et là encore, vous n’augmenterez que la charge du réseau qui est linéaire au vôtre. Avec une énorme volonté et une capacité supérieure à celle de tout le réseau, il est possible de paralyser n’importe quel réseau public (et même Internet) en l’inondant, mais nous avons bien l’intention d’assurer la résistance de Freenet autant que théoriquement possible. Il est assez curieux de noter que l’analyse ci-dessus ne s’applique qu’au [réseau ouvert](https://wiki.freenetproject.org/Opennet). Dans le réseau invisible, vous pourriez avoir un peu plus de réussite, bien qu’il soit bien plus ardu de changer votre point d’entrée de manière importante. Néanmoins, vous avez un multiplicateur de bande passante relativement bas (le nombre total de nœuds visités, environ 20 en moyenne), et vous êtes sérieusement limité par le nombre de nœuds auxquels vous pouvez vous connecter, un petit nombre dans le réseau invisible.

source: Why hash keys and encrypt data when a node operator could identify them (the data) anyway if he tried?
fr: Pourquoi hacher les clés et chiffrer les données si un opérateur de nœud peut de toute façon les reconnaître (les données) s’il essaie ?

source: Hashing the key and encrypting the data is not meant a method to keep Freenet Node operators from being able to figure out what type of information is in their nodes if they really want to (after all, they can just find the key in the same way as someone who requests the information would) but rather to keep operators from having to know what information is in their nodes if they don't want to. This distinction is more a legal one than a technical one. It is not realistic to expect a node operator to try to continually collect and/ or guess possible keys and then check them against the information in his node (even if such an attack is viable from a security perspective), so a sane society is less likely to hold an operator liable for such information on the network.
fr: Le hachage de la clé et le chiffrement des données ne visent pas à empêcher les opérateurs de nœuds Freenet de déterminer quelle sorte d’informations se trouvent dans leurs nœuds s’ils le souhaitent vraiment (après tout, ils peuvent simplement trouver la clé de la même façon que quelqu’un qui demande les informations le ferait), mais plutôt pour que les opérateurs en question n’aient pas à savoir quelles informations se trouvent dans leurs nœuds s’ils ne le désirent pas. Cette distinction est plus juridique que technique. Il n’est pas réaliste de s’attendre à ce qu’un opérateur de nœud tente de recueillir continuellement ou de deviner les clés possibles, et de les comparer aux informations dans son nœud (même si une telle attaque est faisable sur le plan de la sécurité), et ainsi une société lucide est moins susceptible de tenir un opérateur responsable de la présence de telles informations sur le réseau.

source: What about hostile "cancer" nodes within the network?
fr: Qu’en est-il des nœuds cancéreux hostiles dans le réseau ?

source: The existence of malicious nodes within the network is the most difficult problem that a distributed network must face, and has been the bane of many previous ideas. Many systems (such as multiplayer gaming networks) try to avoid malicious nodes by keeping the protocol and code closed, but we have yet to see an example of that working in the long run. And anyway it is opposed to Freenet's philosophy. Freenet is based on a balance of positive and negative feedback loops that bring requests for information to a node when it is functioning well, and keep requests away from it when it is not. The key to avoiding "cancers" is (as in the body) to make sure these loops can correctly identify even the most carefully designed malicious node and not keep sending requests to it. This issue is not fully dealt with by the current test code, but you can rest assured that a number of possible solutions have been on the table and discussed for some time now. Several have been implemented (enforcing hashes or signatures on content, per node failure tables, backing off from a node that causes timeouts ...)
fr: L’existence de nœuds malveillants dans le réseau est le problème le plus épineux qu’un réseau distribué doit affronter, et a été le fléau de bien des idées précédentes. De nombreux systèmes (tels que les réseaux de jeux multijoueurs) tentent d’éviter les nœuds malveillants en fermant le protocole et le code, mais il reste encore à trouver un exemple fonctionnel de cette approche à long terme. Et de toute manière, cela est contraire à la philosophie de Freenet Freenet repose sur une combinaison de boucles de rétroactions positives et négatives qui amène les requêtes d’informations à un nœud s’il fonctionne bien, et l’en éloigne quand ce n’est pas le cas. Le facteur essentiel pour éviter les « cancers » est (comme dans un corps) de s’assurer que les boucles peuvent reconnaître même les nœuds malveillants conçus avec le plus grand soin, et ne continuent pas à leur envoyer des requêtes. Ce problème n’est pas entièrement réglé par le code de test actuel, mais vous pouvez être certain qu’un nombre de solutions possibles est à l’étude depuis quelque temps déjà. Plusieurs ont été mises en œuvre (obliger le hachage ou la signature du contenu, les tables d’échec pour chaque nœud, rester éloigné d’un nœud causant des temporisations...).

source: What about attack Y?
fr: Qu’en est-il de l’attaque Y ?

source: Freenet is still in testing and there are bound to be attacks found that we have not dealt with yet. So if you do manage to figure out a truly new kind of attack, we are interested in hearing about it. Please keep in mind what Freenet is and what it is not, however. No single network can offer everybody everything, and there are security issues that Freenet, by its nature, may not deal with to extent you might wish. If this upsets you, all of our code is freely available, so you are free to take as much of it as you like and write your own distributed network that suits your desires.
fr: Freenet est encore en phase de test, et il est normal que nous n’ayons pas encore réglé des attaques connues. Ainsi, si vous arrivez à trouver une nouvelle sorte d’attaque vraiment nouvelle, nous aimerions le savoir. Cependant, gardez bien à l’esprit ce que Freenet est et n’est pas. Aucun réseau ne peut tout offrir à tout le monde, et en raison de sa nature, il existe des problèmes de sécurité que Freenet ne pourra pas traiter aussi bien que vous le souhaiteriez. Si cela vous dérange, tout notre code est entièrement accessible, et vous êtes libre d’en prendre autant que vous le désirez afin d’écrire votre propre réseau distribué, qui répondra à vos besoins.

source: What private data does Freenet store? How do I get rid of it? How can I secure my computer so I am safe when running Freenet?
fr: Quelles données confidentielles Freenet stocke-t-il ? Comment puis-je m’en débarrasser ? Comment puis-je sécuriser mon ordinateur afin de pouvoir utiliser Freenet en toute sécurité ?
