Repository: hyphanet/website
Catalog: locales/*/LC_MESSAGES/freenet_site.po
Languages: fr

source: What is Freenet?
fr: Qu’est-ce que Freenet ?

source: > _"I worry about my child and the Internet all the time, even though she's too > young to have logged on yet. Here's what I worry about. I worry that 10 or > 15 years from now, she will come to me and say 'Daddy, where were you when > they took freedom of the press away from the Internet?'"_ > --Mike Godwin, [Electronic Frontier Foundation](https://www.eff.org/)
fr: >_« Je m’inquiète en permanence pour ma fille et Internet, bien qu’elle soit trop >jeune pour s’être déjà connectée. Voici ce qui m’inquiète. Je m’inquiète que dans >10 ou 15 ans, elle viendrait me voir et me dirait « Papa, t’étais où quand ils >ont supprimé la liberté de la presse sur Internet ? »_ > --Mike Godwin, [Fondation Frontière électronique](https://www.eff.org/)

source: Freenet is free software which lets you anonymously share files, browse and publish "freesites" (web sites accessible only through Freenet) and chat on forums, without fear of censorship. Freenet is decentralised to make it less vulnerable to attack, and if used in "darknet" mode, where users only connect to their friends, is very difficult to detect.
fr: Freenet est un logiciel libre qui vous permet, de façon anonyme, de partager des fichiers, de parcourir et de publier des « sitesFree » (sites Web accessibles uniquement par Freenet), de clavarder sur des forums, le tout sans craindre la censure. Freenet est décentralisé afin de le rendre moins vulnérable aux attaques, et s’il est utilisé en mode « réseau invisible » qui implique que les utilisateurs se connectent seulement à leurs amis, il est très difficile à détecter.

source: Communications by Freenet nodes are encrypted and are routed through other nodes to make it extremely difficult to determine who is requesting the information and what its content is.
fr: Les communications des nœuds Freenet sont chiffrées et acheminées par d’autres nœuds afin qu’il soit extrêmement difficile de déterminer qui demande l’information et quel en est le contenu.

source: Users contribute to the network by giving bandwidth and a portion of their hard drive (called the "data store") for storing files. Files are automatically kept or deleted depending on how popular they are, with the least popular being discarded to make way for newer or more popular content. Files are encrypted, so generally the user cannot easily discover what is in his datastore, and hopefully can't be held accountable for it. Chat forums, websites, and search functionality, are all built on top of this distributed data store.
fr: Les utilisateurs contribuent au réseau en donnant de la bande passante et une partie de leur disque dur (appelée « magasin de données ») pour le stockage de fichiers. Les fichiers sont automatiquement conservés ou supprimés suivant leur popularité, les moins populaires étant détruits pour faire place à du contenu plus récent ou plus populaire. Les fichiers sont chiffrés. L’utilisateur ne peut donc pas découvrir facilement ce que contient son magasin de données et, avec un peu de chance, ne peut pas en être tenu responsable. Les forums de discussion, les sites Web et la fonction de recherche s’appuient sur ce magasin de données distribué.

source: Freenet has been downloaded over 2 million times since the project started, and used for the distribution of censored information all over the world including countries such as China and in the Middle East. Ideas and concepts pioneered in Freenet have had a significant impact in the academic world. Our 2000 paper "Freenet: A Distributed Anonymous Information Storage and Retrieval System" was the most cited computer science paper of 2000 according to Citeseer, and Freenet has also inspired papers in the worlds of law and philosophy. Ian Clarke, Freenet's creator and project coordinator, was selected as one of the top 100 innovators of 2003 by MIT's Technology Review magazine.
fr: Freenet a été téléchargé plus de 2 millions de fois depuis le début du projet et a été utilisé pour la diffusion d’informations censurées partout dans le monde, incluant des pays comme la Chine et au Moyen-Orient. Les idées et concepts précurseurs de Freenet ont eu un impact significatif dans le milieu universitaire. Notre article de 2000 intitulé « Freenet : A Distributed Anonymous Information Storage and Retrieval System (Freenet : un système de stockage et de récupération d’informations anonyme et distribué) » a été l’article scientifique le plus cité de 2000 d’après Citeseer, et Freenet a aussi inspiré des articles dans les milieux juridique et philosophique. Ian Clarke, créateur de Freenet et coordinateur du projet, a été choisi comme l’un des 100 premiers innovateurs de 2003 par le magazine « Technology Review » du MIT.

source: An important recent development, which very few other networks have, is the "darknet": By only connecting to people they trust, users can greatly reduce their vulnerability, and yet still connect to a global network through their friends' friends' friends and so on. This enables people to use Freenet even in places where Freenet may be illegal, makes it very difficult for governments to block it, and does not rely on tunneling to the "free world".
fr: Le « réseau invisible » est un développement important récent que très peu d’autres réseaux possèdent : en ne se connectant qu’à des personnes de confiance, les utilisateurs peuvent grandement réduire leur vulnérabilité, tout en se connectant à un réseau mondial par l’intermédiaire des amis des amis de leurs amis, etc. Cela permet l’utilisation de Freenet en des lieux où Freenet pourrait être illégal, rend le blocage des gouvernements très difficile, et ne dépend pas d’une tunnellisation vers le « monde libre ».

source: The Philosophy behind Freenet
fr: La philosophie derrière Freenet

source: *Written by Ian Clarke* 1. [A Disclaimer](#disclaimer) 2. [Suggested prior reading](#prior_reading) 3. [The importance of the Free flow of information](#free_flow_info) 4. [Censorship and freedom](#censor_freedom) 5. [The solution](#solution) 6. [Isn't censorship sometimes necessary?](#is_censorship_necessary) 7. [But why is anonymity necessary?](#why_anonymity) 8. [And what of copyright?](#copyright) 9. [But how will artists be rewarded for their work without copyright?](#reward) 10. [Alternatives to Copyright](#alternative)
fr: *Écrit par Ian Clarke* 1. [Un avis de non-responsabilité](#disclaimer) 2. [Lecture préalable recommandée](#prior_reading) 3. [L’importance de la libre circulation des informations](#free_flow_info) 4. [Censure et liberté](#censor_freedom) 5. [La solution](#solution) 6. [La censure n’est-elle pas nécessaire parfois ?](#is_censorship_necessary) 7. [Mais pourquoi l’anonymat est-il nécessaire ?](#why_anonymity) 8. [Et les droits d’auteur ?](#copyright) 9. [Mais comment les artistes seront-ils récompensés pour leur travail sans les droits d’auteur ?](#reward) 10. [Solutions de remplacement des droits d’auteur](#alternative)

source: ### 1\. A Disclaimer There are many reasons why people get involved in the Freenet Project. Some share the views outlined in this document; some share variations of these views, which are also served by what we are trying to achieve; and some just enjoy the technical challenge. These are the ideas which motivated me to architect the system in the first place, but not necessarily the views that everyone involved in the Freenet Project holds.
fr: ### 1\. Un avis de non-responsabilité Les raisons pour lesquelles des personnes s’impliquent dans le Projet Freenet sont nombreuses. Certaines partagent les points de vue présentés dans ce document ; d’autres partagent des variantes de ces points de vue, variantes qui sont aussi couvertes par ce que nous essayons de réaliser ; et d’autres encore aiment juste le défi technique. Voilà les idées qui m’ont motivé à concevoir le système en premier lieu, et non pas nécessairement les points de vue de tous ceux impliqués dans le Projet Freenet.

source: ### 2\. Suggested prior reading For this document to make sense, you should probably know what Freenet is. You can get a good overview from [What is Freenet?](about.html#introduction).
fr: ### 2\. Lecture préalable recommandée Afin que ce document ait un sens, vous devriez probablement savoir ce qu’est Freenet. [Qu’est-ce que Freenet ?](about.html#introduction) vous donnera une bonne vue d’ensemble.

source: ### 3\. The importance of the Free flow of information Freedom of speech, in most western cultures, is generally considered to be one of the most important rights any individual might have. Why is the freedom to share ideas and opinions so important? There are several ways to answer this question.
fr: ### 3\. L’importance de la libre circulation des informations Dans la plupart des cultures occidentales, la liberté d’expression est généralement considérée comme l’un des droits primordiaux de l’individu. Pourquoi la liberté de partager idées et opinions est-elle si importante ? Il y a plusieurs façons de répondre à cette question.

source: #### 3.1 Communication is what makes us human One of the most obvious differences between mankind and the rest of the animal kingdom is our ability to communicate sophisticated and abstract concepts. While we constantly discover that animal's communication ability is more sophisticated than previously assumed, it is unlikely that any other animal approaches our own level of ability in this area.
fr: #### 3.1 La communication est ce qui fait de nous des humains Une des différences les plus évidentes entre l’homme et le reste du règne animal est notre aptitude à communiquer des concepts sophistiqués et abstraits. Alors que nous découvrons constamment que l’aptitude à la communication des animaux est plus complexe que nous le supposions initialement, il est peu probable qu’un autre animal approche notre propre niveau de compétence dans ce domaine.

source: #### 3.2 Knowledge is good Most people, given the option of knowing something and not knowing something, will choose to have more information rather than less. Wars have been won and lost over who was better-informed. This is because being better-informed allows us to make better decisions, and generally improve our ability to survive and be successful.
fr: #### 3.2 La connaissance est bénéfique La plupart des personnes auxquelles l’on donnera l’option de savoir quelque chose ou de ne pas le savoir, choisira d’avoir plus d’informations que moins. Des guerres ont été gagnées ou perdues, selon qui a été le mieux informé. C’est parce qu’être mieux informé nous permet de prendre de meilleures décisions et d’améliorer de manière générale notre aptitude à survivre et à réussir.

source: #### 3.3 Democracy assumes a well informed population Many people today live under democratic governments, and those who don't, probably want to. Democracy is an answer to the question of how to create leaders, while preventing them from abusing that power. It achieves this by giving the population the power to regulate their government through voting, yet the ability to vote does not necessarily mean that you live in a democratic country. For a population to regulate their government effectively it must know what their government is doing, they must be well informed. It is a feedback loop, but this loop can be broken if the government has the power to control the information the population has access to.
fr: #### 3.3 La démocratie implique une population bien informée De nombreuses personnes vivent aujourd’hui sous le régime de gouvernements démocratiques et celles pour qui ce n’est pas le cas le voudraient probablement. La démocratie est une réponse à la question de comment créer des meneurs, tout en les empêchant d’abuser de ce pouvoir. Elle réalise cela en donnant à la population le pouvoir de réguler leur gouvernement par le vote, cependant la possibilité de voter ne signifie pas nécessairement que vous vivez dans un pays démocratique. Afin qu’une population puisse réguler son gouvernement de façon efficace, elle doit savoir ce que son gouvernement fait, elle doit être bien informée. C’est une boucle de rétroaction, mais cette boucle peut être brisée si le gouvernement a le pouvoir de contrôler les informations auxquelles la population a accès.

source: ### 4\. Censorship and freedom Everyone values their freedom, in fact, many consider it so important that they will die for it. People like to think that they are free to form and hold whatever opinions they like, particularly in western countries. Consider now that someone had the ability to control the information you have access to. This would give them the ability to manipulate your opinions by hiding some facts from you, by presenting you with lies and censoring anything that contradicted those lies. This is not some Orwellian fiction, it is standard practice for most western governments to lie to their populations, so much so, that people now take it for granted, despite the fact that this undermines the very democratic principles which justify the government's existence in the first place.
fr: ### 4\. Censure et liberté Tout le monde accorde de l’importance à sa liberté. En fait, beaucoup la considèrent comme si importante qu’ils sont prêts à mourir pour elle. Les gens aiment à penser qu’ils sont libres de nourrir et d’exprimer n’importe quelle opinion, particulièrement dans les pays occidentaux. Examinez maintenant la possibilité que quelqu’un puisse contrôler les informations auxquelles vous avez accès. Cela lui permettrait de manipuler vos opinions en vous cachant certains faits, en vous présentant des mensonges et en censurant toute chose qui contredirait ces mensonges. Ce n’est pas une fiction orwellienne, mais une pratique courante pour la plupart des gouvernements occidentaux que de mentir au peuple, tellement que les gens la tiennent maintenant pour acquis, malgré le fait que cela compromet les principes démocratiques mêmes qui justifient l’existence d’un gouvernement en premier lieu.

source: ### 5\. The solution The only way to ensure that a democracy will remain effective is to ensure that the government cannot control its population's ability to share information, to communicate. So long as everything we see and hear is filtered, we are not truly free. Freenet's aim is to allow two or more people who wish to share information, to do so.
fr: ### 5\. La solution La seule manière de garantir qu’une démocratie restera efficace est de s’assurer que le gouvernement ne peut pas contrôler la capacité de sa population à partager des informations, à communiquer. Tant que tout ce que nous voyons et entendons est filtré, nous ne sommes pas vraiment libres. Le but de Freenet est de permettre à deux personnes ou plus, qui souhaitent partager des informations, de le faire.

source: ### 6\. Isn't censorship sometimes necessary? Of course no issue is black and white, and there are many who feel that censorship is a good thing in some circumstances. For example, in some European countries propagating information deemed to be racist is illegal. Governments seek to prevent people from advocating ideas which are deemed damaging to society. There are two answers to this however. The first is that you can't allow those in power to impose "good" censorship, without also enabling them to impose "bad" censorship. To impose any form of censorship a government must have the ability to monitor and thus restrict communication. There are already criticisms that the anti-racism censorship in many European countries is hampering legitimate historical analysis of events such as the second world war. The second argument is that this "good" censorship is counter-productive even when it does not leak into other areas. For example, it is generally more effective when trying to persuade someone of something to present them with the arguments against it, and then answer those arguments. Unfortunately, preventing people from being aware of the often sophisticated arguments used by racists, makes them vulnerable to those arguments when they do eventually encounter them. Of course the first argument is the stronger one, and would still hold-true even if you didn't accept the second. Basically, you either have censorship, or you don't. There is no middle-ground.
fr: ### 6\. La censure n’est-elle pas nécessaire parfois ? Aucun problème n’est bien sûr tout noir ou tout blanc, et beaucoup pensent que la censure est une bonne chose dans certaines circonstances. Par exemple, dans certains pays européens, la propagation d’informations présumées racistes est illégale. Les gouvernements cherchent à empêcher les gens à favoriser les idées présumées dommageables pour la société. Il y a cependant deux réponses à cela. La première est que l’on ne peut pas permettre aux détenteurs du pouvoir d’imposer une « bonne » censure sans leur permettre aussi d’imposer une « mauvaise » censure. Pour imposer toute sorte de censure, un gouvernement doit avoir la capacité de surveiller et donc de restreindre les communications. Le fait que la censure antiraciste entrave les analyses historiques légitimes d’événements tels que la Deuxième Guerre mondiale est déjà critiqué. Le second argument est que cette « bonne » censure est improductive même si elle ne s’étend pas aux autres idées. Par exemple, si l’on essaie de persuader quelqu’un de quelque chose, il est généralement plus efficace de présenter les arguments contre et de répondre ensuite à ces arguments. Malheureusement, en empêchant les gens d’être conscients des arguments souvent sophistiqués mis de l’avant par les racistes, nous rendons ces personnes vulnérables à ces arguments quand ils leur sont enfin présentés. Le premier argument est bien sûr le plus fort et resterait vrai même si vous n’acceptiez pas le second. Plus simplement, soit vous avez de la censure, soit vous n’en avez pas. Il n’y a pas de juste milieu.

source: ### 7\. But why is anonymity necessary? You cannot have freedom of speech without the option to remain anonymous. Most censorship is retrospective, it is generally much easier to curtail free speech by punishing those who exercise it afterward, rather than preventing them from doing it in the first place. The only way to prevent this is to remain anonymous. It is a common misconception that you cannot trust anonymous information. This is not necessarily true, using digital signatures people can create a secure anonymous pseudonym which, in time, people can learn to trust. Freenet incorporates a mechanism called "subspaces" to facilitate this.
fr: ### 7\. Mais pourquoi l’anonymat est-il nécessaire ? Il ne peut y avoir de liberté d’expression sans l’option de rester anonyme. La majorité de la censure est rétrospective. Il est en effet généralement bien plus facile d’entraver la liberté d’expression en punissant après coup ceux qui l’exercent, plutôt qu’en les empêchant de s’exprimer en premier lieu. La seule manière d’éviter cela est de rester anonyme. Croire que l’on ne peut pas faire confiance aux informations anonymes est une méprise courante. Ce n’est pas nécessairement vrai. En utilisant des signatures numériques, l’on peut créer un pseudonyme sécurisé auquel les gens apprendront à faire, avec le temps, confiance. Freenet intègre un mécanisme appelé « sous-espaces » pour faciliter cela.

source: ### 8\. And what of copyright? Of course much of Freenet's publicity has centered around the issue of copyright, and thus I will speak to it briefly. The core problem with copyright is that enforcement of it requires monitoring of communications, and you cannot be guaranteed free speech if someone is monitoring everything you say. This is important, most people fail to see or address this point when debating the issue of copyright, so let me make it clear: > *You cannot guarantee freedom of speech and enforce copyright law* It is for this reason that Freenet, a system designed to protect Freedom of Speech, must prevent enforcement of copyright.
fr: ### 8\. Et les droits d’auteur ? Une grande partie de la publicité de Freenet a mis l’accent sur le problème des droits d’auteur, et j’en parlerai donc brièvement. Le problème fondamental des droits d’auteur est que les faire appliquer exige une surveillance des communications, et il ne peut y avoir une garantie de la liberté d’expression si quelqu’un surveille tout ce que vous dites. C’est important, la plupart des gens ne le voient pas ou n’abordent pas ce point quand ils débattent du problème des droits d’auteur, laissez-moi donc le préciser : >*On ne peut pas garantir la liberté d’expression tout en appliquant la loi sur le droit d’auteur* Pour cette raison, Freenet, un système conçu pour protéger la liberté d’expression, doit empêcher l’application des droits d’auteur.

source: ### 9\. But how will artists be rewarded for their work without copyright? Firstly, even if copyright were the only way that artists could be rewarded for their work, then I would contend that freedom is more important than having professional artists (those who claim that we would have no art do not understand creativity: people will always create, it is a compulsion, the only question is whether they can do it for a living). Secondly, it could be questioned whether copyright is effective even now. The music industry is one of the most vocally opposed to enhancements in communication technology, yet according to many of the artists who should be rewarded by copyright, it is failing to do so. Rather it has allowed middle-men to gain control over the mechanisms of distribution, to the detriment of both artists and the public.
fr: ### 9\. Mais comment les artistes seront-ils récompensés pour leur travail sans les droits d’auteur ? Premièrement, même si les droits d’auteur étaient la seule façon pour que les artistes puissent être récompensés pour leur travail, je soutiendrais que la liberté est plus importante que d’avoir des artistes professionnels (ceux qui prétendent qu’il n’y aurait plus d’art ne comprennent pas ce qu’est la créativité : les gens créeront toujours, c’est une compulsion, la seule question est de savoir s’ils peuvent en vivre). Deuxièmement, on pourrait remettre en question l’efficacité des droits d’auteur dans le contexte actuel. L’industrie de la musique est l’une des plus fermement opposées aux améliorations des technologies de communication, et cependant, d’après de nombreux artistes qui devraient être récompensés par les droits d’auteur, cette industrie ne les récompense pas. Elle a plutôt permis aux intermédiaires de prendre le contrôle des mécanismes de distribution, au détriment des artistes et du public.
