Repository: hyphanet/website
Catalog: locales/*/LC_MESSAGES/freenet_site.po
Languages: fr

source: ### So it's running, what do I do? When the installer closes, it should open a browser window pointing to the first-time wizard. Here you can configure basic settings, and then start using Freenet. You can access Freenet later on via the system tray menu ( bottom right on the screen), or use the Browse Freenet shortcut on the desktop and/or start menu. If it doesn't work, open [http://127.0.0.1:8888/](http://127.0.0.1:8888/) in your web browser. For best security you should use a separate browser for Freenet, preferably in privacy mode. On Windows, the system tray menu will try to use Chrome in incognito mode if possible. Internet Explorer does not work well with Freenet, Firefox and Opera are widely used. If you know anyone running Freenet, you can improve your security and help to build a robust network by connecting to their node. First, open the [Add a friend page](http://127.0.0.1:8888/addfriend/). You and your friend should each download their "node reference". Send the file to the other person, and add his node reference using the form at the bottom of the page. When both are added, your friend's node should show up on the Friends page, probably as "CONNECTED" or "BUSY". You can set a name for your node on the config page to make it easier to see who it is. Only add nodes run by people **you actually know**, whether online or offline, as adding total strangers harms performance and does not improve security much (they could be the bad guys!).
fr: ### Donc ça tourne, que faire ? Lors de sa fermeture, le programme d’installation devrait ouvrir une fenêtre de navigateur présentant l’assistant de première installation. Il vous permettra de configurer les paramètres de base, et vous pourrez ensuite commencer à utiliser Freenet. Vous pourrez accéder à Freenet par la suite grâce au menu de la zone de notification (en bas à droite de l’écran), ou en utilisant le raccourci « Parcourir Freenet » sur le bureau ou dans le menu Démarrer. Si cela ne fonctionne pas, accédez à [http://127.0.0.1:8888/](http://127.0.0.1:8888/) dans votre navigateur Web. Pour une sécurité accrue, vous devriez utiliser un navigateur séparé pour Freenet, préférablement en mode privé. Dans Windows, le menu de la zone de notification essaiera si possible d’utiliser Chrome en navigation privée. Internet Explorer ne fonctionne pas bien avec Freenet, Firefox et Opera sont largement utilisés. Si vous connaissez quelqu’un qui fait tourner Freenet, vous pouvez améliorer votre sécurité tout en participant à la construction d’un réseau robuste en vous connectant à son nœud. Ouvrez d’abord la [page Ajouter un ami](http://127.0.0.1:8888/addfriend/). Votre ami et vous devrez télécharger vos « références de nœud » respectives. Envoyez-vous le fichier et ajoutez sa référence de nœud en utilisant le formulaire en bas de la page. Quand vous en aurez fait autant l’un et l’autre, le nœud de votre ami apparaîtra alors sur la page Amis, probablement comme « CONNECTÉ » ou « OCCUPÉ ». Vous pouvez définir un nom pour son nœud dans la page de configuration pour savoir plus facilement de qui il s’agit. N’ajoutez que des nœuds exploités par des personnes que « vous connaissez réellement », que cela soit en ligne ou hors ligne, car l’ajout de parfaits inconnus nuira aux performances et ne fera rien pour améliorer la sécurité (ce pourrait être des méchants !).

source: ### So I'm connected, what do I do? Freenet itself includes anonymous websites ("freesites"), filesharing, searching, and more, but you can also use third party applications for chat, filesharing, to help you upload freesites, etc. The [Freenet Social Networking Guide](http://freesocial.draketo.de/) explains how to set up the main third party tools, including email, forums and micro-blogging (Sone, a bit like twitter).
fr: ### Je suis connecté, que faire ensuite ? Freenet lui-même inclut des sites Web anonymes (« sitesFree »), du partage de fichiers, une recherche et plus encore, mais vous pouvez aussi utiliser des applications tierces pour le clavardage, le partage de fichiers, pour vous aider à téléverser des sitesFree, etc. Le [Guide du réseautage social de Freenet](http://freesocial.draketo.de/) explique comment mettre en place les principaux outils tiers, incluant le courriel, les forums et le microblogage (Sone, un peu comme Twitter).

source: ### It doesn't work, now what? If you have problems installing or running Freenet, please see the [knowledge base][kb_url], [FAQ][faq_url], [chat][chat_url], or [mailing list][ml_url].
fr: ### Ça ne fonctionne pas, quoi faire ? Si vous éprouvez des problèmes lors de l’installation ou de l’exécution de Freenet, veuillez consulter la [base de connaissances][kb_url], [la FAQ][faq_url], [le clavardage][chat_url], ou [la liste de diffusion][ml_url].

source: ### Hardware requirements Generally a 1GHz processor and 1GB of RAM should be fine. Freenet will run on smaller systems, but it uses at least 128MB of RAM, so unless the system does nothing else it will struggle in less than 512MB. However, the processor is less of a problem, people have been known to run it on 400MHz Pentium 2's or ATOM's, although downloads and browsing would be slow. Freenet will use a portion of your disk for storing data, you can configure this to any size from 100MB upwards, but we recommend at least 1GB. Freenet also uses disk space for your downloads. Freenet's memory usage is approximately 256MB plus 400kB for every 2GB of datastore. On 64-bit Windows, we will install a 32-bit Java Virtual Machine because of limitations of the [Java Service Wrapper]( http://wrapper.tanukisoftware.org/doc/english/download.jsp).
fr: ### Les exigences matérielles Généralement, un processeur d’1 GHz et 1 Go de mémoire vive devraient suffire. Freenet pourrait fonctionner sur des systèmes plus petits, mais il utilise au moins 128 Mo de mémoire vive, et à moins que le système ne fasse rien d’autre, il éprouvera des difficultés avec moins de 512 Mo. Cependant, le processeur est un problème mineur, et des utilisateurs font tourner Freenet sur des Pentium II 400 MHz ou des ATOM, bien que les téléchargements et la navigation seraient lents. Freenet utilisera une partie de votre disque afin d’y stocker des données. Vous pouvez définir cette taille à partir de 100 Mo, mais nous recommandons au moins 1 G0. Freenet utilise aussi de l’espace disque pour vos téléchargements. L’utilisation de la mémoire par Freenet est approximativement de 256 Mo plus 400 Ko pour chaque tranche de 2 Go du magasin de données. Sur Windows 64 bits, nous installerons une machine virtuelle Java 32 bits, à cause des restrictions de [l’enveloppeur de service](http://wrapper.tanukisoftware.org/doc/english/download.jsp).

source: ### Upgrading Freenet provides an upgrade-over-Freenet mechanism: It will keep itself up to date automatically from other Freenet nodes, and this will normally work even if it is unable to route to them due to them being too new. This is anonymous and secure, and we recommend people use it. However, if something is severely broken, you can upgrade your node manually from our servers: * Windows users can upgrade to the latest-stable Freenet release by running "update.cmd" in the Freenet directory. * OS X, GNU/Linux, or other POSIX users may upgrade by running the update.sh shell script in the Freenet directory.
fr: ### La mise à niveau Freenet propose un mécanisme de mise à niveau qui utilise Freenet : il s’assurera d’être automatiquement à jour à partir d’autres nœuds Freenet, et normalement, cela fonctionnera même s’il lui est impossible de les atteindre, car ils sont trop nouveaux. Ce mécanisme est anonyme et sûr, et nous en recommandons l’utilisation. Cependant, si quelque chose est sérieusement endommagé, vous pourrez mettre votre nœud à niveau manuellement à partir de nos serveurs : * Les utilisateurs de Windows peuvent effectuer la mise à niveau vers la version stable la plus récente en exécutant « update.cmd » dans le répertoire Freenet. * Les utilisateurs d’OS X, GNU/Linux, ou autres POSIX peuvent effectuer la mise à niveau en exécutant la procédure d’interpréteur de commandes « update.sh » dans le répertoire Freenet.

source: Add friends (or connect to strangers)
fr: Ajouter des amis (ou se connecter à des inconnus)

source: If you know other people who also use Freenet, you can [add them as Friends][url_addfriend]. This will make you safer against attacks on Freenet Project infrastructure (the [seednodes][url_seednode_info]).
fr: Si vous connaissez d’autres personnes qui utilisent aussi Freenet, vous pouvez [les ajouter en tant qu’amis][url_addfriend]. Cela renforcera votre sécurité contre les attaques sur l’infrastructure du Projet Freenet (les [nœuds de propagation][url_seednode_info]).

source: Once you are connected to 5 or more friends, you can enable **high security mode**. In high security mode Freenet will only connect to your friends. This makes your usage of Freenet almost undetectable, but you are still able to access the rest of the network through your friends' friends friends ....
fr: Une fois que vous êtes connecté à 5 amis ou plus, vous pouvez activer le **mode haute sécurité**. En mode haute sécurité, Freenet ne se connectera qu’à vos amis. Cela rend votre utilisation de Freenet quasiment indétectable, mais vous pouvez quand même accéder au reste du réseau grâce aux amis des amis de vos amis...

source: You don't have to add friends right now. If you use a "low" or "normal" security level Freenet will automatically connect to strangers and will work just fine. However, your (or someone else's) government may be able to find out who you are with enough effort. Be careful!
fr: Vous ne devez pas ajouter d’amis maintenant. Si vous choisissez un niveau de sécurité « faible » ou « normal », Freenet se connectera à des inconnus et fonctionnera très bien. Cependant, votre gouvernement (ou celui de quelqu’un d’autre) pourrait déployer suffisamment d’effort afin de découvrir qui vous êtes. Soyez vigilant !

source: Verifying Signatures
fr: Vérifications des signatures

source: Download the [Freenet Project signing keys][url_keyring] and import them into your keyring:
fr: Téléchargez les [clés de signature du Projet Freenet][url_keyring] et importez-les dans votre trousseau :

source: Philosophical
fr: Philosophique

source: Freenet is a platform for censorship-resistant communication and publishing. It is designed to ensure true freedom of communication over the Internet. It allows anybody to publish and read information with complete anonymity. Nobody controls Freenet, not even its creators, meaning that the system is not vulnerable to manipulation or shutdown. Freenet is also very efficient in how it deals with information, adaptively replicating content in response to demand. For more information, see [What is Freenet?](about.html#introduction)
fr: Freenet est une plateforme de communication et de publication qui résiste à la censure. Elle est conçue pour garantir une réelle liberté de communication par Internet. Elle permet à quiconque de publier et de lire des informations dans l’anonymat le plus total. Personne ne contrôle Freenet, pas même ses créateurs, ce qui signifie que le système n’est pas vulnérable aux manipulations ni aux coupures de service. De plus, Freenet gère les informations avec une grande efficacité, répliquant son contenu de manière autoadaptative afin de répondre à la demande. Pour plus d’informations, consulter [Qu’est-ce que Freenet ?](about.html#introduction)

source: How is Freenet different to Tor? Can I access Google/Facebook/etc through Freenet?
fr: Comment Freenet est-il différent de Tor ? Puis-je accéder à Google, Facebook, etc. par Freenet ?

source: Freenet is a self-contained network, while Tor allows accessing the web anonymously, as well as using "hidden services" (anonymous web servers). Freenet is not a proxy: You cannot connect to services like Google or Facebook using Freenet. However, Freenet has websites, filesharing, forums, chat, microblogging, email etc, all anonymous and hosted within Freenet. Freenet is a distributed datastore, so once content is uploaded to Freenet, it will remain on Freenet forever, as long as it remains popular, without fear of censorship or denial of service attacks, and without needing to run your own web server and keep it online constantly. The other big difference is that Freenet has the "darknet" or Friend to Friend mode, where your Freenet node (software on your computer) only connects to the Freenet nodes run by your friends, i.e. people you know (and maybe to their friends, to speed things up). This makes blocking Freenet, e.g. on a national firewall, extremely difficult.
fr: Freenet est un réseau autonome, tandis que Tor permet d’accéder au Web anonymement, ainsi que d’utiliser des « services cachés » (serveurs Web anonymes). Freenet n’est pas un serveur mandataire : vous ne pouvez pas vous connecter à des services tels que Google ou Facebook en utilisant Freenet. Cependant, Freenet offre des sites Web, du partage de fichiers, des forums, du clavardage, du microblogage, du courriel, etc., tous anonymes et hébergés dans Freenet. Freenet est un magasin de données distribué, et donc, une fois qu’un contenu est téléversé vers Freenet, il restera dans Freenet pour toujours, tant qu’il restera populaire, sans crainte de censure ou d’attaques par déni de service, et sans avoir à exécuter votre propre serveur Web afin de le garder continuellement en ligne . L’autre grosse différence est que Freenet offre le mode « réseau invisible » ou ami à ami, grâce auquel votre nœud Freenet (le logiciel sur votre ordinateur) ne se connecte qu’aux nœuds Freenet exécutés par vos amis, c.-à-d. des personnes que vous connaissez (et peut-être à leurs amis, afin d’accélérer les choses). Cela complique énormément le blocage de Freenet, p. ex. par un pare-feu national.

source: However, most people currently use Freenet in "opennet" mode (that is, connecting automatically to whoever the network assigns, rather than connecting only to their friends). This is much less secure than using Freenet in "darknet" mode, and is relatively easy to block, as it does have some central servers ("seed nodes"). Freenet has many unsolved problems, and is still experimental. Our objective for Freenet is to build a global friend-to-friend darknet, which would be extremely difficult to block, and would provide very strong anonymity and censorship resistance. This will require further work on Freenet, on usability, speed and security, but above all it is a techno-social experiment: Will people know enough friends who are willing to use Freenet to make such an anonymous friend-to-friend network possible? This is why Freenet supports "opennet" mode: to let people try it out before they ask their friends to connect. Tor is a little less experimental, and arguably is an easier problem; it may provide better anonymity today, provided that it isn't blocked, and of course, Tor lets you access the internet as a whole, whereas on Freenet you can only access Freenet content. However if you can use a large enough darknet, Freenet already provides an interesting level of censorship resistance, DoS resistance and anonymity.
fr: Cependant, la plupart des gens utilisent actuellement Freenet en mode « réseau ouvert » (c’est-à-dire en se connectant automatiquement à toute personne assignée par le réseau, plutôt qu’en se connectant seulement à leurs amis). Cela est beaucoup moins sécurisé que d’utiliser Freenet en mode « réseau invisible », et est relativement facile à bloquer, à cause de serveurs centraux (« nœuds de propagation »). Freenet présente de nombreux problèmes non résolus et est encore expérimental. Pour Freenet, notre objectif est de construire un réseau invisible mondial d’ami à ami, réseau qu’il serait extrêmement difficile de bloquer et qui fournirait un anonymat et une résistance à la censure des plus robustes. Pour y parvenir, il faudra travailler davantage sur Freenet en matière de convivialité, de vitesse et de sécurité. Mais par-dessus tout, il s’agit d’une expérience technosociale : les utilisateurs connaîtront-ils assez d’amis enclins à utiliser Freenet afin de rendre un tel réseau anonyme d’ami à ami possible ? C’est pourquoi Freenet propose le mode « réseau ouvert », afin de permettre aux gens de l’essayer avant de demander à leurs amis de s’y connecter. Tor est peu moins expérimental, et dans un certain sens, est un problème plus facile ; il peut fournir un meilleur anonymat aujourd’hui, à condition qu’il ne soit pas bloqué, et bien sûr, Tor vous permet d’accéder à Internet dans son ensemble, alors que sur Freenet vous ne pouvez qu’accéder au contenu de Freenet. Cependant, si vous pouvez utiliser un réseau invisible assez grand, Freenet fournit déjà un niveau de résistance à la censure, aux DdS, et un anonymat intéressant.

source: Using the internet "anonymously" is not necessarily easy: Connecting to Facebook through Tor doesn't prevent Facebook from knowing pretty much everything about you, and connecting to your (non-HTTPS) webmail account through Tor may mean the person running the proxy ("exit node") can steal your webmail account password. Freenet is a separate network, which does things differently, because there are no central servers. This is why we don't support Javascript, server-side scripting etc on freesites: Everything must be rewritten to work on a distributed network. But the advantage is there is no single server which can be compelled to hand over your private communications or which can be shut down. There are still risks, for example, talking about your home town or internet provider on an anonymous forum, or downloading files which Freenet can't make safe such as PDFs or word processor documents (Freenet will warn you about this). Also, for web content in particular, it may be easier to upload it to Freenet than set up a hidden server on Tor; you don't need to keep your node online for your content to be available, you don't need to figure out how to configure it safely, and most important, if you go away your site will still be available.
fr: Il n’est pas nécessairement facile d’utiliser Internet de manière « anonyme » : se connecter à Facebook avec Tor n’empêche pas Facebook de presque tout savoir sur vous, et se connecter à son compte de courriel Web (non HTTPS) avec Tor signifie que la personne exécutant le mandataire (nœud de sortie) peut voler le mot de passe de votre compte de courriel Web. Freenet est un réseau séparé qui fait les choses différemment, car il n’y a pas de serveurs centraux. C’est pourquoi nous ne prenons pas en charge JavaScript, les scripts côté serveur, etc. sur les sitesFree : tout doit être réécrit afin de fonctionner sur un réseau distribué. Mais l’avantage est qu’il n’existe pas un seul serveur que l’on pourrait obliger à divulguer vos communications confidentielles, ou qui pourrait être éteint. Des risques persistent cependant, par exemple, parler de la ville où vous habitez ou de votre fournisseur d’accès Internet sur un forum anonyme, ou télécharger des fichiers que Freenet ne peut pas assembler tels que des PDF ou des documents de traitement de texte (Freenet vous avertira le cas échéant). De plus, particulièrement pour du contenu Web, il pourrait être plus simple de le téléverser vers Freenet que de mettre en place un serveur caché sur Tor ; votre nœud ne doit pas rester en ligne pour que votre contenu soit disponible, vous n’avez pas à trouver comment le paramétrer de façon sécuritaire, et par-dessus tout, si vous disparaissez, votre site sera encore disponible.

source: ### Summary: Tor (or I2P): * Lets you access the Internet (but be careful!). * Lets you access anonymous web servers and other services. * Lets you host anonymous web servers, which need to be kept online, and can be DoS'ed, but can run any dynamic or server-side content you want. * Provides reasonable anonymity * Has been blocked by several countries, with varying success. Even its hidden bridges can be harvested and blocked with moderate effort. * Is somewhat centralised * Is more mature and has more users and developers
fr: ### Résumé : Tor (ou I2P): * Vous permet d’accéder à Internet (mais soyez prudent !) * Vous permet d’accéder à des serveurs Web anonymes et à d’autres services * Vous permet d’héberger des serveurs Web anonymes, qui doivent toujours être en ligne, peuvent subir des attaques par déni de service, et peuvent exécuter n’importe quel contenu dynamique ou coté serveur * Fournit un anonymat raisonnable * A été bloqué par plusieurs pays, avec plus ou moins de succès. Même ces ponts cachés peuvent être moissonnés et bloqués avec un effort modéré * Est centralisé dans une certaine mesure * Est plus mature, et a plus d’utilisateurs et de développeurs

source: Freenet in general: * Only lets you access content uploaded to Freenet, including (static) websites, email, filesharing, forums, microblogging, etc. All of which are anonymous (or pseudonymous i.e. you create an untraceable identity). * Hosts content in a distributed way: You don't know what your node is storing, any given content is distributed across many nodes. * Ensures that popular content will be available forever. * Is older than Tor, but more experimental (arguably it's a harder task).
fr: Freenet en général : * Ne vous permet que d’accéder à du contenu téléversé vers Freenet, incluant sites Web (statiques), courriel, partage de fichiers, forums, microblogage, etc. Tous sont anonymes (ou pseudonymes, c.-à-d. que vous créez une identité qui ne peut pas être retracée). * Héberge du contenu de manière distribuée : vous ne savez pas ce que votre nœud stocke, tout contenu étant éparpillé sur de nombreux nœuds. * Garantit que le contenu populaire sera toujours mis à disposition. * Est plus ancien que Tor, mais plus expérimental (une tâche plus ardue, pourrait-on dire).

source: Freenet in darknet mode: (friend to friend: connects only to your friends' nodes) * Is very hard to block, and this can be improved further with transport plugins. * Provides good anonymity, and with a bit more work it could provide very strong anonymity (PISCES tunnels). * Is fully decentralised: No central servers at all.
fr: Freenet en mode invisible : (d’ami à ami : ne se connecte qu’aux nœuds de vos amis) * Est très difficile à bloquer, ce qui eut encore être amélioré grâce à des greffons de transport. * Fournit un bon anonymat, et pourrait proposer un anonymat très renforcé avec un peu de travail (tunnels PISCES). * Est entièrement décentralisé : aucun serveur central, du tout.

source: Freenet in opennet mode: (connect automatically even if you don't know anyone on Freenet) * Is relatively easy to block. * Provides limited anonymity * Is somewhat centralised
fr: Freenet en mode réseau ouvert : (se connecte automatiquement, même si vous ne connaissez personne sur Freenet) * Est relativement facile à bloquer * Fournit un anonymat limité * Est d’une certaine façon centralisé

source: Unfortunately most people use Freenet in opennet mode currently. The big question is can we build a global friend-to-friend darknet? Join us and find out!
fr: Malheureusement, la plupart des gens utilisent actuellement Freenet en mode réseau ouvert. La grande question étant de savoir si l’on peut construire un réseau invisible mondial d’ami à ami. Joignez-vous à nous et découvrez-le !
