Repository: hyphanet/website
Catalog: locales/*/LC_MESSAGES/freenet_site.po
Languages: fr

source: Freenet unstable testing prerelease 1471-pre3 is now available. This is feature-complete and hopefully the last testing release before the stable release of build 1471. Build 1471 will be the last to support Java 6. Highlights: - Fix uploads stalling when using MAXIMUM physical security. - Fix lots of "setNativePriority(X) has failed!", which was caused by a serious thread priority problem. This might fix nodes unexpectedly losing peers. - Order alerts within a category by time: if you have lots of messages from darknet peers they will remain nicely sorted. For more information and how to help test see the [developer mailing list][devl_1471].
fr: La préversion de test non stable 1471-pre3 est maintenant proposée. Elle est pleinement fonctionnelle et sera, espérons-le, la dernière version de test avant la version stable de la version 1471. La version 1471 sera la dernière à prendre en charge Java 6. Points saillants : - Correction du blocage des téléversements en niveau de sécurité physique MAXIMAL. - Correction de nombreux « setNativePriority(X) a échoué ! », qui étaient causés par un sérieux problème de fils d’exécution. Cela pourrait corriger la perte inattendue de pairs par les nœuds. - Tri chronologique des alertes d’une catégorie : si vous avez de nombreux messages provenant de pairs du réseau invisible, ils resteront bien rangés. Pour plus d’informations et des instructions sur comment tester, consultez la [liste de diffusion des développeurs][devl_1471].

source: 2015-12-20 - "Weekend of Code" hackathon results
fr: 2015-12-20 - Résultats du marathon de programmation « Fin de semaine de code »

source: During the hackathon we got some changes done: - [Fix uploads stalling when using MAXIMUM physical security.][1] - [Fix lots of "setNativePriority(X) has failed!"][2] - [Fix Bokmål localization loading.][3] - [Fix JVM version string parsing.][4] - [Fix and add test for broken localization substitution token pairs.][5] - [Remove Gantros Index][6] because it stopped updating. - [Remove Linkageddon][6] because it stopped updating. - [Remove deprecated negtype crypto.][7] - [Order alerts by date.][8] - [Progress toward Freemail "to" field autocomplete.][9] - Progress toward changing the language setting in Winterface. - Progress toward building and verifying dependencies for [Fred][10] and [Winterface][11] using [Gradle][12] and [gradle-witness][13]. If we're able to get final changes ready build 1471-pre3 will be released the weekend of January 2nd.
fr: Durant le marathon de programmation, nous avons effectué des changements : - [Correction du blocage des téléversements en niveau de sécurité physique MAXIMAL.][1] - [Correction de nombreux « setNativePriority(X) a échoué ! »][2] - [Correction du chargement de la localisation en bokmål.][3] - [Correction de l’analyse de la chaîne de version de la machine virtuelle Java.][4] - [Correction et ajout de test pour détecter les pairs de jeton de substitution de localisation non fonctionnelle.][5] - [Retrait de l’index de Gantros][6], car il a cessé de se mettre à jour. - [Retrait de Linkageddon][6], car il a cessé de se mettre à jour. - [Retrait de la cryptographie negtype déconseillée.][7] - [Tri des alertes par date.][8] - [Progrès réalisés vers une saisie semi-automatique du champ « À ».][9] - Progrès réalisés vers un changement du paramètre de langue dans Winterface. - Progrès réalisés vers l’établissement et la vérification des dépendances pour [Fred][10] et [Winterface][11] grâce à [Gradle][12] et [gradle-witness][13]. Si nous pouvons finaliser les derniers changements, la version 1471-pre3 paraîtra durant la fin de semaine du 2 janvier.

source: 2015-12-12 - New OS X installer and tray app
fr: 2015-12-12 - Nouveau programme d’installation pour OS X et nouvelle appli de zone de notification

source: The [Freenet installer][downloads_url] for OS X is now a native application. It should fix several major installation problems OS X users have encountered in the past. It also includes an updated [tray application][tray_url] with bugfixes and new features. All Freenet users on OS X are encouraged to [download][tray_release_url] the new tray application. ![][tray_screenshot_url]
fr: Le [programme d’installation de Freenet][downloads_url] pour OS X est maintenant une application native. Elle devrait corriger plusieurs problèmes sérieux que les utilisateurs d’OS X ont rencontrés par le passé. Elle inclut aussi une [appli de zone de notification][tray_url] mise à jour, qui corrige des bogues et offre de nouvelles fonctions. Tous les utilisateurs de Freenet sur OS X sont invités à [télécharger][tray_release_url] la nouvelle application de zone de notification. ![][tray_screenshot_url]

source: 2015-12-12 - Appeal for donations
fr: 2015-12-12 - Appel aux dons

source: Freenet is a platform for censorship-resistant communication and publishing. For the past 15 years the project has built tools to fight for freedom of speech and information. Our software provides a decentralized peer-to-peer network designed to hide who publishes or accesses potentially controversial information - or even that it exists - especially useful for those living in oppressive political regimes. While development is primarily driven by volunteers, the project has also employed paid developers to provide more-focused work. Over the past 2 years, the project's paid developer has made [great progress][build18] improving “Web of Trust” functionality to combat spam, which is a central problem in any anonymous system. Unfortunately, the Freenet Project no longer has enough money to retain his services, so he is now a volunteer. This greatly reduces his capacity to continue this important work. We are extremely excited for the future of Freenet and the [projects built on top of it][projects]. There is so much more work to do, and full-time developers greatly benefit the project. Help us keep Internet freedom alive and expand human liberty. {donate_button} Thank you, Freenet Project volunteers
fr: Freenet est une plateforme de communication et de publication qui résistent à la censure. Depuis 15 ans, le projet a développé des outils pour préserver la liberté d’expression et de circulation de l’information. Notre logiciel fournit un réseau pair à pair décentralisé conçu pour cacher qui publie ou accède à des informations potentiellement controversées — ou bien même que ces informations existent — ce qui est particulièrement utile pour les personnes qui vivent sous le joug de régimes politiques oppressifs. Bien que le développement soit principalement mené par des bénévoles, le projet a aussi employé des développeurs rémunérés afin de fournir un travail plus ciblé. Au cours des deux dernières années, le développeur rémunéré du projet a [grandement amélioré][build18] le fonctionnement de la toile de confiance « Web of Trust » afin de combattre le pollupostage qui est un problème majeur de tout système anonyme. Malheureusement, le Projet Freenet n’a plus assez d’argent pour recourir à ses services, et il est donc maintenant bénévole, ce qui diminue considérablement sa capacité à poursuivre ce travail important. Le futur de Freenet et des [projets qui en découlent][projects] nous enthousiasme. Il y a tant à accomplir, et des développeurs à temps plein profitent grandement au projet. Aidez-nous à préserver la liberté sur Internet tout en promouvant la liberté humaine. {donate_button} Merci, Les bénévoles du Projet Freenet

source: 2015-11-20 - "Weekend of Code" hackathon announcement
fr: 2015-11-20 - Annonce du marathon de programmation « Fin de semaine de code »

source: ## Who? We welcome developers of all skill levels, designers, translators, and users. ## What? The Freenet Project is holding a "Weekend of Code" hackathon to improve user experience. ## When? The weekend of December 19th and 20th. ## Where? [chat.freenode.net #freenet][irc_url] [FLIP][flip_url] #freenet Local meetups are arranged separately. ## Details See the [wiki Hackathon page][hackathon_url] for details. Happy hacking!
fr: ## Qui ? Nous accueillons les développeurs de tous niveaux de compétence, les concepteurs, les traducteurs et les utilisateurs. ## Quoi ? Le Projet Freenet organise un marathon de programmation « Fin de semaine de code » pour améliorer l’expérience utilisateur. ## Quand ? La fin de semaine du 19 au 20 décembre. ## Où ? [chat.freenode.net #freenet][irc_url] [FLIP][flip_url] #freenet Des rencontres locales sont organisées séparément. ## Détails Consultez la [page wiki du marathon de programmation][hackathon_url] pour plus de détails. Bonne programmation !

source: 2015-10-25 - Prerelease and Windows installer
fr: 2015-10-25 - Préversion et programme d’installation pour Windows

source: The Windows installer has updated translations for French, Indonesian, and Simplified Chinese, and is newly translated into Bulgarian, Croatian, and Japanese. In addition, Freenet unstable testing prerelease 1471-pre2 is now available. For details on what it contains and how to test it see the [release announcement][announcement].
fr: Les traductions en français, indonésien et en chinois simplifié du programme d’installation pour Windows sont mises à jour, et de nouvelles traductions en bulgare, en croate et en japonais sont maintenant offertes. De plus, la préversion instable de test 1471-pre2 de Freenet est maintenant proposée. Pour plus de détails sur ce qu’elle contient, et sur comment tester, consulter l’[annonce de parution][announcement].

source: 2015-10-21 - Website redesign is live
fr: 2015-10-21 - La refonte du site est en production

source: The redesigned website is now live! Existing URLs [redirect](http://www.w3.org/Provider/Style/URI.html) to their new equivalents. Thanks to everyone who contributed feedback, development, and translations. If we missed something, please tell us in our [support chat](help.html#irc)!
fr: Le site refondu est maintenant en ligne ! Les URL existantes [redirigent](http://www.w3.org/Provider/Style/URI.html) vers les nouvelles URL équivalentes. Merci à tous ceux qui ont participé, que ce soit par leurs commentaires, leur développement, ou encore leurs traductions. Si nous avons manqué quelque chose, veuillez-nous-en informer sur notre [clavardage de soutien](help.html#irc)!

source: 2015-10-11 - Upcoming website redesign
fr: 2015-10-11 - Refonte du site Web à venir

source: In the next few weeks we will transition to a redesigned website. This will be the first major change since 2009. In addition to looking more modern, this new version is also more practical to modify, test, and translate. If you'd like to get a look at the site in testing you can find it [here][url_testing] - as given in the prompt the username and password are "guest". If you'd like to help with translation, please join us on the ["website" resource on Transifex][url_transifex]. If you have any feedback on the new website design please let us know on [chat][url_chat] or the [support list][url_supportlist]! [url_testing]: https://testing.freenetproject.org/ [url_transifex]: https://www.transifex.com/otf/freenet/website/ [url_supportlist]: https://emu.freenetproject.org/cgi-bin/mailman/listinfo/support [url_chat]: irc.html
fr: Dans les prochaines semaines, nous migrerons vers un site Web redessiné. Cela sera le premier changement en profondeur depuis 2009. Outre son apparence plus moderne, cette nouvelle version est plus pratique à modifier, à tester et à traduire. Si vous souhaitez jeter un coup d’oeil au site de test, vous le trouverez [ici][url_testing]. Tel qu’indiqué dans l’invite, le nom d’utilisateur et le mot de passe sont « guest ». Si vous désirez vous impliquer dans la traduction, veuillez nous rejoindre dans la [ressource « website » sur Transifex][url_transifex]. Si vous avez des commentaires sur la conception du nouveau site Web, veuillez nous en faire part sur le [clavardage][url_chat] , ou sur la [liste de soutien][url_supportlist] ! [url_testing] : https://testing.freenetproject.org/ [url_transifex] : https://www.transifex.com/otf/freenet/website/ [url_supportlist] : https://emu.freenetproject.org/cgi-bin/mailman/listinfo/support [url_chat] : irc.html

source: 2015-09-17 - elliptic curves: using safe Bouncy Castle since November 2014
fr: 2015-09-17 - courbes elliptiques : utilisation de Bouncy Castle, sûr, depuis novembre 2014

source: <p> A recent article outlines <a href="http://web-in-security.blogspot.ca/2015/09/practical-invalid-curve-attacks.html"> practical attacks against elliptic curves</a> to recover private keys which worked against the Bouncy Castle crypto provider used by Freenet until <a href="#build01466">Build 1466</a> (released 2014-11-09) and against Java JCE <a href="http://www.oracle.com/technetwork/topics/security/cpujul2015-2367936.html"> until July 2015</a>. If you use the current stable <a href="#20150816-1470-release">build 1470</a> on an updated Java, your node is not vulnerable to these attacks. </p> <p> On darknet the attacks required knowing both node references, so in darknet mode Freenet was only vulnerable to them if two friends connected to the same malicious third party or shared their node references in public. On opennet the target of these attacks would have been the seednodes because other opennet connections are neither persistent nor trusted. </p>
fr: <p> Un article récent décrit <a href="http://web-in-security.blogspot.ca/2015/09/practical-invalid-curve-attacks.html"> des attaques pratiques contre les courbes elliptiques</a> pour récupérer des clés privées, qui ont fonctionné contre le fournisseur de cryptographie Bouncy Castle utilisé par Freenet jusqu’à la <a href="#build01466">version 1466</a> (parue 2014-11-09) et contre l’extension cryptographique de Java (JCE) <a href="http://www.oracle.com/technetwork/topics/security/cpujul2015-2367936.html"> jusqu’à juillet 2015</a>. Si vous utilisez la <a href="#20150816-1470-release">version 1470</a> actuelle stable sur un Java mis à jour, votre nœud n’est pas exposé à ces attaques. </p> <p> Dans le réseau invisible, ces attaques exigeaient de connaître les deux références de nœud, et en mode réseau invisible Freenet n’y était donc vulnérable que si deux amis se connectaient au même tiers malveillant, ou partageaient leur référence de nœud en public. Sur le réseau ouvert, la cible de ces attaques aurait été les nœuds de propagation, car les autres connexions du réseau ouvert ne sont ni persistantes ni fiables. </p>

source: 2015-08-16 - Freenet 0.7.5 build 1470 released
fr: 2015-08-16 - Parution de Freenet 0.7.5 version 1470

source: <p> This release fixes Freemail problems that prevented sending mail, and removes a compromised opennet seed node. Freemail also gains a new message link on the inbox page, links to senders' WoT profiles, and new translations: </p> <ul> <li>Czech</li> <li>Greek</li> <li>Spanish</li> <li>Finnish</li> <li>Hungarian</li> <li>Dutch</li> <li>Polish</li> <li>Portuguese (Portugal)</li> <li>Serbian</li> <li>Turkish</li> </ul> <p> To clarify, the CHK metadata bug fixes in 1468 are added as a new compatibility mode that is not yet the default. Compatibility with 1416 keys is available. </p> <p> The Fred Spanish translation has comprehensive updates as well. </p>
fr: <p> Cette version corrige les problèmes de Freemail qui empêchaient l’envoi de courriel, et retire un nœud de propagation compromis du réseau ouvert. Freemail s’enrichit aussi d’un lien de nouveau message sur la page de la boîte de réception, de liens vers les profils WoT des expéditeurs, et de nouvelles traductions : </p> <ul> <li>Tchèque</li> <li>Grec</li> <li>Espagnol</li> <li>Finnois</li> <li>Hongrois</li> <li>Néerlandais</li> <li>Polonais</li> <li>Portugais (Portugal)</li> <li>Serbe</li> <li>Turc</li> </ul> <p> Pour préciser, les correctifs du bogue des données CHK dans 1468 sont ajoutés comme nouveau mode de compatibilité qui n’est pas encore activé par défaut. La compatibilité avec les clés de 1416 est aussi proposée. </p> <p> La traduction en espagnol de Fred a aussi reçu d’importantes mises à jour. </p>

source: 2015-08-07 - Windows translation update
fr: 2015-08-07 - Mise à jour des traductions sous Windows

source: <p> The Windows installer and tray app have updated translations. The installer is newly translated into Portuguese (Portugal) and Serbian. The tray app is newly translated into Spanish, Persian, Portuguese (Portugal), and Serbian. This also fixes a tray app problem where translations for Brazilian Portuguese and Simplified Chinese were not used. </p>
fr: <p> Les traductions du programme d’installation et l’appli de zone de notification pour Windows ont été mis à jour. Le programme d’installation est maintenant traduit en portugais (Portugal) et en serbe. L’appli de zone de notification est maintenant traduite en espagnol, en persan, en portugais (Portugal) et en serbe. La non-utilisation des traductions en portugais (Brésil) et en chinois simplifié par l’appli de zone de notification a aussi été corrigée. </p>

source: 2015-07-19 - Freenet 0.7.5 build 1469 released
fr: 2015-07-19 - Parution de Freenet 0.7.5 version 1469

source: <p> This release fixes two bugs introduced in build 1468. One caused very slow operation and high CPU usage with large files and physical security levels above None (i.e. Freenet-level disk encryption). The other prevented interactive usage (e.g. freesite browsing) while finishing large downloads or starting large uploads. </p>
fr: <p> Cette version corrige deux bogues présents dans la version 1468. L’un causait un très grand ralentissement et une utilisation élevée de l’UCT en cas de gros fichiers et avec les niveaux de sécurité physique supérieurs à Aucun (c.-à-d. le chiffrement de disque par Freenet). L’autre empêchait une utilisation interactive (p. ex. navigation des sitesFree) tout en finissant de gros téléchargements ou en commençant de gros téléversements. </p>

source: 2015-07-13 - Build 1468 known issues
fr: 2015-07-13 - Problèmes connus de la version 1468

source: <p> Despite being in some form of prerelease for over 6 months, and two weeks of being available as a release candidate, we didn't catch some bugs in time. There are two main issues: </p> <ol> <li> Because the reimplementation of the client layer without db4o did not include prioritization of FEC decoding / encoding, large bulk download or upload queues can starve the realtime queues, making them unresponsive. (See <a href="https://github.com/freenet/fred/pull/381">PR #381</a>.) </li> <li> Due to our misunderstanding of when the cryptography library we use - Bouncy Castle - included which fixes, we did not realize that version 1.51, used by build 1468, has severe performance problems with the way we use it to implement disk encryption. Build 1469 will upgrade to Bouncy Castle 1.52, which fixes this problem. It is only an issue when the physical security level is set to "Low" or higher. It does not happen when physical security is set to "None." (See <a href="https://github.com/freenet/fred/pull/382">PR #382</a>.) </li> </ol> <p> Sadly, these problems can combine to make a node use 100% CPU to slowly process bulk queues while the realtime queue does not respond. Matthew (toad_) has already released a snapshot to fix these problems, which you can find <a href="https://emu.freenetproject.org/pipermail/devl/2015-July/038123.html">on the mailing list</a> or <a href="http://localhost:8080/forumviewthread.htm?messageuuid=E544C7BB-5E5E-4159-83F8-AFC46C089329@h2RzPS4fEzP0zU43GAfEgxqK2Y55kEUNR01cWvYApI#E544C7BB-5E5E-4159-83F8-AFC46C089329@h2RzPS4fEzP0zU43GAfEgxqK2Y55kEUNR01cWvYApI">on FMS</a>. </p>
fr: <p> Malgré plus de six mois de préversions, sous une forme ou une autre, et une mise à disposition de la version d’évaluation pendant deux semaines, nous ne sommes pas arrivé à déceler certains bogues à temps. Il y a deux problèmes principaux : </p> <ol> <li> La réimplémentation de la couche client sans db4o n’ayant pas inclus la priorisation du décodage/encodage FEC, les grosses files de téléchargement ou de téléversement de masse peuvent affamer les files d’attente en temps réel, celles-ci ne répondant plus. (Voir <a href="https://github.com/freenet/fred/pull/381">PR #381</a>.) </li> <li> Comme nous ne comprenions pas quand la bibliothèque cryptographique que nous utilisons - Bouncy Castle - incluait quels correctifs, nous ne nous sommes pas rendu compte que la version 1.51 utilisée par la version 1468 présentait des problèmes sévères de performance de la façon dont nous l’utilisions pour mettre en œuvre le chiffrement du disque. La version 1469 passera à Bouncy Castle 1.52 qui corrige ce problème. Ce n’est un problème que si le niveau de sécurité physique est défini à « Faible » ou plus haut. Cela ne se produit pas si le niveau de sécurité physique est défini à « Aucun ». (Voir <a href="https://github.com/freenet/fred/pull/382">PR #382</a>.) </li> </ol> <p> Malheureusement, ces problèmes peuvent se conjuguer en une utilisation à 100 % de l’UCT et un traitement lent des files de masse alors que la file d’attente en temps réel ne répond plus. Matthew (toad_) a déjà présenté un programme d’analyse sélective pour corriger ces problèmes, programme que vous trouverez <a href="https://emu.freenetproject.org/pipermail/devl/2015-July/038123.html">dans la liste de diffusion</a> ou <a href="http://localhost:8080/forumviewthread.htm?messageuuid=E544C7BB-5E5E-4159-83F8-AFC46C089329@h2RzPS4fEzP0zU43GAfEgxqK2Y55kEUNR01cWvYApI#E544C7BB-5E5E-4159-83F8-AFC46C089329@h2RzPS4fEzP0zU43GAfEgxqK2Y55kEUNR01cWvYApI">sur FMS</a>. </p>

source: 2015-07-11 - Freenet 0.7.5 build 1468 released
fr: 2015-07-11 - Parution de Freenet 0.7.5 version 1468
