Repository: hyphanet/website
Catalog: locales/*/LC_MESSAGES/freenet_site.po
Languages: fr

source: Yes, people will have to know what key you used to publish your information. This means you will have to announce your key in some way. The most common way to do this is to send a message, containing your key and brief description of your information, to the author of one of the existing Freenet sites. Most of the "portal" sites which are linked from the Freenet web interface (fproxy) read the Freetalk or FMS forums, and there are boards specifically for announcing sites (usually the boards are called "sites"!). You could also send your key to people by using the Freenet [mailing lists]( help.html#mailing-lists), in the IRC channel (chat.freenode.net #freenet), by private e-mail, or by advertising your Freenet site on your World Wide Web site. If you're feeling extravagant, you could even try skywriting it. (Graffiti is not recommended, for legal reasons.)
fr: Oui, les gens devront savoir quelle clé vous avez utilisée pour publier vos informations. Cela signifie que vous devrez annoncer votre clé d’une manière ou d’une autre. L’approche la plus habituelle serait d’envoyer un message, contenant votre clé et une description brève de vos informations, à l’auteur d’un des sites Freenet existants. La plupart des sites « portail » qui sont reliés à partir de l’interface Web de Freenet (fproxy) lisent les forums Freetalk ou FMS, et certains tableaux d’affichage sont réservés à l’annonce de sites (les tableaux d’affichage sont habituellement appelés « sites » !). Vous pourriez aussi envoyer votre clé à d’autres en utilisant les [listes de diffusion]( help.html#mailing-lists) de Freenet, dans le canal IRC (chat.freenode.net #freenet), par courriel privé, ou en promouvant votre site Freenet sur votre site Web. Si vous vous sentez extravagant, vous pourriez même l’écrire dans le ciel (les graffitis ne sont pas recommandés pour des raisons juridiques).

source: How do I publish a Content Hash Key (CHK)?
fr: Comment puis-je publier une clé de hachage de contenu (CHK) ?

source: A Content Hash Key is based on the actual content contained within it - and as such, the key will only be known after it has been inserted into Freenet. To insert a CHK, simply insert it as "CHK@", Freenet will tell you what the actual CHK is once the insertion completes.
fr: Une clé de hachage du contenu se base sur le contenu même de la clé, et, à ce titre, la clé ne sera connue qu’après avoir été insérée dans Freenet. Pour insérer une CHK, il suffit de l’insérer en tant « CHK@ », Freenet vous indiquera ce qu’est la CHK une fois que l’insertion sera terminée.

source: Can Freenet documents be updated / deleted?
fr: Les documents de Freenet peuvent-ils être mis à jour / supprimés ?

source: Currently, a document posted to Freenet with the same name as one already present may actually serve to propagate the existing document. There is also currently no means of deleting a document from Freenet. Documents that are never requested are eventually removed through disuse. However, you can use an [Updatable Subspace Key (USK)]( https://wiki.freenetproject.org/USK) to provide a form of updatable freesite: your node will automatically look for later editions of the site (after you visit it, or always if you bookmark it), and show you the latest version. You can force it to search for the latest version by changing the number at the end of the key to negative.
fr: Actuellement, un document publié dans Freenet avec le même nom qu’un autre déjà présent pourrait en fait servir à propager le document existant. Il n’y a actuellement pas non plus de façon de supprimer un document de Freenet. Les documents qui ne sont jamais demandés seront en fin de compte supprimés pour non-utilisation. Cependant, vous pouvez utiliser une [clé de sous-espace actualisable (USK)]( https://wiki.freenetproject.org/USK) afin de proposer une sorte de siteFree pouvant être mis à jour : votre nœud recherchera automatiquement les versions les plus récentes du site (après que vous l’avez visité, ou toujours si vous le mettez en marque-page), et vous présentera la dernière version. Vous pouvez le forcer à rechercher la version la plus récente en changeant le nombre à la fin de la clé en un nombre négatif.

source: Contributing
fr: Participer

source: I have this great idea....
fr: J’ai une idée formidable...

source: Good! First step: read the [mailing list archives](help.html#mailing-lists). Odds are good that someone else had the same idea and discussed it with the group. Either a flaw was found in the idea, or perhaps it was decided to postpone implementing the idea until later. Some examples of ideas already discussed are storing information by content hash, key redirection, signed keys/data, use of UDP, server discovery, URLs, document versioning, and others. If you don't see the idea discussed in the archives, by all means bring it up in the appropriate [mailing list](help.html#mailing-lists).
fr: Bien ! Première étape : lire les [archives des listes de diffusion](help.html#mailing-lists). Il y a de bonnes chances que quelqu’un d’autre a eu la même idée et en a discuté avec le groupe. Soit une faille a été trouvée dans l’idée, soit il a peut-être été décidé de reporter l’implémentation de l’idée à plus tard. Parmi les idées dont il a déjà été discuté : stocker les informations par hachage de contenu, le réacheminement des clés, les clés/données signées, utiliser UDP, la découverte des serveurs, les URL, le versionnage des documents et autres. Si vous ne trouvez pas de discussion sur l’idée dans les archives, mentionnez-la sans hésitation dans la [liste de discussion](help.html#mailing-lists) correspondante.

source: Can I contribute to the Freenet Project?
fr: Puis-je participer au Projet Freenet ?

source: Absolutely. Even if you don't have the time or skills to become a co-developer of the project, you can contribute in other ways: * Help test Freenet by installing and configuring the server software on your machine. * Install the client software on your machine to test retrieving information and publishing your own. * Work on the Freenet web site (including the FAQ). * Contribute your ideas to the discussion lists. * [Translate the user interface](https://wiki.freenetproject.org/Translation) into another language.
fr: Absolument. Même si vous n’avez ni le temps ni les compétences pour devenir codéveloppeur du projet, vous pouvez y contribuer d’autres manières : * Aider à tester Freenet en installant et en configurant le logiciel serveur sur votre machine. * Installer le logiciel client sur votre machine afin de tester la récupération d’informations et la publication des vôtres. * Travailler sur le site Web de Freenet (incluant la FAQ). * Communiquer vos idées sur les listes de discussions. * [Traduire l’interface utilisateur](https://wiki.freenetproject.org/Translation) en une autre langue.

source: If you are a developer, you can help by working on Freenet itself, or by creating other applications to run on Freenet. External applications (such as FMS, the main forums system used on Freenet) use [the Freenet Client Protocol](https://wiki.freenetproject.org/FCPv2) to talk to Fred. Another possibility is writing plugins - these are written in Java and run in Freenet's JVM, and can be bundled with Freenet when they are ready. A popular plugin is Sone, which is a microblogging/social app over Freenet. You can see how to install FMS and Sone on e.g. the Freenet Social Networking Guide freesite. If you want to work on Freenet itself, see [here](contribute.html#developers) to get the source code. Improvements to this website, fixes for spelling/grammar mistakes, new ideas (see [the previous answer](#idea)), are all welcome. You may find [the wiki]( https://wiki.freenetproject.org/Main_Page) helpful.
fr: Si vous êtes un développeur, vous pouvez aider en travaillant sur Freenet même, ou en créant d’autres applications qui fonctionneront sur Freenet. Les applications externes (telles que FMS, le système principal de forum utilisé sur Freenet) utilisent [le protocole client de Freenet]( https://wiki.freenetproject.org/FCPv2) pour communiquer avec Fred. Une autre possibilité est l’écriture de greffons - ils sont écrits en Java, s’exécutent dans la machine virtuelle Java de Freenet et peuvent être ajoutés à Freenet une fois prêts. Un greffon populaire est Sone, une appli de microblogage/sociale sur Freenet. Vous pouvez par exemple lire comment installer FMS et Sone sur le siteFree du guide du réseautage social de Freenet. Si vous souhaitez travailler sur Freenet même, lisez [ceci]( contribute.html#developers) pour obtenir le code source. Les améliorations au site Web, les corrections d’erreurs d’orthographe ou de grammaire, les idées nouvelles (voir [la réponse précédente](#idea)), sont toutes les bienvenues. [Le wiki]( https://wiki.freenetproject.org/Main_Page) pourrait aussi vous être utile.

source: If you have any questions about contributing, please contact us, via [the developers mailing list][url_devlist], [the chat channel][url_chat], [the support mailing list][url_supportlist] or anonymously via the freenet board on FMS. Last but not least you can [donate][url_donate] to support our paid developer(s) and cover server costs.
fr: Si vous désirez savoir comment participer, veuillez nous contacter, par [la liste de diffusion des développeurs][url_devlist], par [le canal de clavardage][url_chat], par [la liste de diffusion de soutien][url_supportlist], ou encore anonymement par le forum freenet sur FMS. Et enfin, vous pouvez [faire un don][url_donate] pour soutenir notre/nos développeur(s) rémunéré(s) et couvrir nos coûts de serveurs.

source: How can I access the code and website?
fr: Comment puis-je accéder au code et au site Web ?

source: See our [GitHub repository](https://github.com/freenet/).
fr: Voir notre [dépôt GitHub](https://github.com/freenet/).

source: What tools do I need to help develop?
fr: De quels outils ai-je besoin pour aider au développement ?

source: Building Freenet requires JDK 1.6 or later. You can download the source tarballs on the download page for a specific build, or use git to get an up to date copy of the source, see [here](contribute.html#developers) for details. Further instructions for building and deploying the server are included with the code itself. Generally speaking, joining our IRC channel is a good idea: [#freenet on chat.freenode.net](irc://chat.freenode.net/freenet)
fr: La construction de Freenet exige la trousse d’outils JDK 1.6 ou ultérieure. Vous pouvez télécharger les tarballs source à partir de la page de téléchargement pour une version particulière, ou utiliser git afin d’obtenir une version à jour de la source. Consulter [ceci](contribute.html#developers) pour plus de détails. De plus amples instructions sur la construction et le déploiement du serveur sont incluses avec le code. Rejoindre notre canal IRC est généralement une bonne idée : [#freenet sur chat.freenode.net](irc://chat.freenode.net/freenet)

source: Is there a Help Site that goes deeper into the questions newbies may have about Freenet, and where people can contribute too?
fr: Y a-t-il un site d’assistance qui couvre plus en profondeur les questions qu’un novice peut avoir sur Freenet, où les gens peuvent contribuer ?

source: Have a look at [our wiki](https://wiki.freenetproject.org/). An older wiki, which is now read-only, but has a fair amount of content so is sometimes helpful is [here](https://old-wiki.freenetproject.org/). There are also several implementations of wiki's over Freenet. The most recent one is called Jfniki. There is a link in the default bookmarks on the Browse Freenet page after you install Freenet.
fr: Consultez [notre wiki](https://wiki.freenetproject.org/). Un wiki plus ancien, qui est maintenant en lecture seule mais qui propose une quantité appréciable de contenu et qui est parfois utile, se trouve [ici]( https://old-wiki.freenetproject.org/). L’on trouve aussi plusieurs versions de wikis dans Freenet. Le plus récent se nomme Jfniki. Un lien se trouve dans les marque-pages par défaut sur la page Parcourir Freenet, après avoir installé Freenet.

source: Where can I report bugs?
fr: Où puis-je signaler des bogues ?

source: You can use our [bug tracking system](https://bugs.freenetproject.org/) or send a mail to our [support mailing list](help.html#mailing-lists).
fr: Vous pouvez utiliser notre [système de suivi des bogues]( https://bugs.freenetproject.org/) ou envoyer un courriel à notre [la liste de diffusion de soutien](help.html#mailing-lists).

source: I'm a theoretical computer scientist/mathematician, how can I help?
fr: Je suis informaticien/mathématicien théoricien, comment puis-je aider ?

source: See [here](https://wiki.freenetproject.org/Research_challenges).
fr: Voir [ici](https://wiki.freenetproject.org/Research_challenges).

source: Security
fr: Sécurité

source: Can I use my regular browser to browse Freenet?
fr: Puis-je utiliser mon navigateur habituel pour parcourir Freenet ?

source: Freenet has a web interface: much of the content on Freenet is in the form of "freesites", and downloads, configuration and friend connections can be managed from the web interface. However, because of weaknesses in current browsers, we **strongly** recommend that you use a separate browser for Freenet. Specifically, browser history stealing, in all its forms, is a major threat if you share a browser between Freenet and the WWW at large: malicious web pages will be able to probe which freesites you have visited, and report this information to their owners. Privacy/incognito mode may be sufficient, and Windows tray app will start a browser running in this mode.
fr: Freenet propose une interface Web : une grande partie du contenu de Freenet se présente sous la forme de « sitesFree » et de téléchargements. La configuration et les connexions aux amis peuvent être gérées de l’interface Web. Cependant, les navigateurs actuels présentant des faiblesses, nous vous recommandons **fortement** d’utiliser un navigateur séparé pour Freenet. Plus particulièrement, le vol de l’historique de navigation, sous toutes ses formes, est une menace de premier plan si vous partagez un navigateur entre Freenet et le Web dans son ensemble : des pages Web hostiles pourront déterminer quels sitesFree vous aurez visités et rapporter ces informations à leurs propriétaires. Le mode privé pourrait être suffisant, et l’appli de zone de notification lancera un navigateur en mode privé.

source: Won't attack X break Freenet's anonymity?
fr: L’attaque X ne compromettra-t-elle pas l’anonymat de Freenet ?

source: **Short answer**: Probably, on opennet. Maybe, on darknet. **Long answer**: Freenet has a different threat model to Tor and the Mixmaster remailers. Freenet is designed to resist censorship: The network must therefore be robust, and content must be distributed without requiring a central server, whether anonymous or not. Anonymity is important for requesters and especially for those who upload content in the first place. The typical example is a corporate or government whistleblower. Generally to find the originator of some content, the attacker must be able to predict the data in advance, must be able to move across the network relatively quickly, and must be able to perform the attack while the data is being inserted; after that, it is distributed across the network and is much harder to trace, and the originator may have left the network. However, if by chance or by overwhelming force the attacker is connected to the whistleblower (or e.g. seizes the computers of everyone on the network), he may be able to identify this much more quickly. All of this is vastly more difficult on a darknet, where everyone connects only to their friends, where it is very hard for an attacker to find nodes, and where to connect to a given node he must social engineer its operator! Freenet does support opennet mode (plug and play), but darknet is far more secure, and far more difficult to block on a national firewall. Tor on the other hand is designed to anonymise real-time data streams, on the assumption that the list of nodes can be public, that there is a free world where nodes can be operated safely, that the authors of controversial content will be able to either host (hidden) web servers themselves or upload it to other (hidden, but usually centralised) storage systems, and so on. And Tor has a concept of a "client", which is somebody who uses the service without providing any value to it; on Freenet, every node relays data for its neighbours. Hence the attacks on Freenet are completely different to the attacks on Tor. Both compromise to some degree to enable more or less real-time performance.
fr: **Réponse courte :** probablement, sur le réseau ouvert. Peut-être, sur le réseau invisible. **Réponse longue :** Le modèle de menace de Freenet est différent de celui des services de courriel anonyme Tor et Mixmaster. Freenet est conçu pour résister à la censure : par conséquent, le réseau doit être robuste, et le contenu doit être distribué sans exiger de serveur central, anonyme ou non. L’anonymat est important aux yeux des demandeurs, et particulièrement pour ceux qui téléversent d’abord du contenu. L’exemple typique est un lanceur d’alerte issu d’une entreprise ou d’un gouvernement. Pour trouver le desserveur d’un contenu, l’attaquant doit généralement prédire quelles seront les données, doit pouvoir se déplacer assez vite dans le réseau, et doit réaliser l’attaque alors que les données sont insérées; par la suite, elles sont distribuées dans le réseau et il devient bien plus difficile de les suivre à la trace, mais le desserveur peut aussi avoir quitté le réseau. Cependant, si l’attaquant est connecté au lanceur d’alerte, par hasard ou par une force écrasante (ou si p. ex. il saisit tous les ordinateurs du réseau), il pourrait alors l’identifier bien plus rapidement. Tout cela serait bien plus difficile sur un réseau invisible où tout le monde ne se connecte qu’à des amis, où un attaquant aurait du mal à trouver des nœuds, et où il devrait recourir au piratage psychologique de l’opérateur d’un nœud donné afin de se connecter à ce nœud ! Freenet propose le mode réseau ouvert (prêt à tourner), mais le réseau invisible est bien plus sûr, et il est aussi bien plus difficile à bloquer sur un pare-feu national. D’autre part, Tor est conçu pour anonymiser des flux de données en temps réel, en supposant que la liste des nœuds est publique, qu’il existe un monde libre où des nœuds peuvent être exploités en toute sécurité, que les auteurs de contenu controversé peuvent eux-mêmes soit héberger des serveurs Web (cachés), soit téléverser ledit contenu vers d’autres systèmes de stockage (cachés, mais habituellement centralisés), etc. Et Tor a le concept du « client », qui est quelqu’un qui utilise le service sans y fournir quelque valeur que ce soit; sur Freenet, chaque nœud relaie des données pour ses voisins. D’où la nature entièrement différente des attaques entre Freenet et Tor. Les deux acceptent un certain compromis afin de permettre plus ou moins de performances en temps réel.

source: If you can use the darknet, trust your friends, don't reinsert files, always use the "Insert a random, safe key" option, and change your anonymous identity after some volume of inserts, you should be relatively safe using Freenet. However this has not yet been quantified. If you can connect, build up some trust in your anonymous persona, insert your controversial content, and then disappear, again, you are better off with Freenet, especially if the content is a website (but if you are connecting on opennet, beware of seednode compromises). In some other cases, Tor is better. We are still working on Freenet's security and there are major security enhancements which have not yet been implemented, most of which will go in before 1.0\. Cryptographic tunnels similar to Tor's onion routing are one possibility, which would greatly reduce the impact of many of the below attacks, but there are several other enhancements planned, both to anonymity and to network robustness/undetectability.
fr: Si vous pouvez utiliser le réseau invisible, faire confiance à vos amis, ne pas réinsérer des fichiers, toujours utiliser l’option « Insérer une clé sûre aléatoire », et changer votre identité anonyme après un certain volume d’insertions, alors vous devriez pouvoir utiliser Freenet relativement sans danger. Cependant, cela n’a pas encore été quantifié. Si vous pouvez vous connecter, renforcer un peu la confiance portée à votre personnage anonyme, insérer votre contenu controversé et disparaître ensuite, il est préférable d’opter pour Freenet, particulièrement si le contenu est un site Web (mais si vous vous connectez sur le réseau ouvert, méfiez-vous des compromis des nœuds de propagation). Dans d’autres cas, Tor est préférable. Nous poursuivons encore nos efforts en matière de sécurité, et certaines améliorations majeures visant la sécurité n’ont pas encore été mises en œuvre. La plupart d’entre elles seront ajoutées d’ici 1.0\. Des tunnels cryptographiques semblables au routage en oignon de Tor offrent une possibilité qui réduirait sensiblement l’impact de plusieurs des attaques ci-dessous, mais plusieurs autres améliorations sont aussi prévues, touchant à la fois à l’anonymat et la robustesse ainsi que l’indétectabilité du réseau.

source: **Major known attacks**: In the interests of giving would-be users as much information as possible, and on the assumption that any serious attacker would do their homework, here are the major classes of attack on Freenet we are presently aware of:
fr: **Attaques d’envergure connues :** Dans le but de donner aux utilisateurs potentiels autant d’informations que possible, et en supposant que tout attaquant sérieux ferait ses devoirs, voici les principales classes d’attaques contre Freenet dont nous avons connaissance :

source: * **Harvesting**: Simply by running some powerful Freenet nodes, an attacker can identify most of the opennet (Strangers network) relatively easily. These nodes can then be attacked one by one (subject to resources), their traffic analysed, or simply be blocked on a national firewall. Connecting only to friends (darknet) largely solves this problem. ISPs may be able to identify Freenet nodes with some effort, although we make this fairly difficult: Freenet's current protocol is designed to be hard to detect, and steganography will be introduced at some point. However, traffic flow analysis, or brute-force blocking of all peer to peer traffic (e.g. traffic between IP addresses marked as "consumer" rather than "business"), both of which would hit a lot of things other than Freenet, would likely be effective for quite some time.
fr: * **Le moissonnage** : en exécutant des nœuds Freenet puissants, un attaquant peut identifier la majorité du réseau ouvert (réseau des inconnus) assez facilement. Ces nœuds peuvent alors être attaqués un par un (selon les ressources), leur trafic analysé, ou simplement être bloqués par un pare-feu national. La connexion aux amis seulement (réseau invisible) résout en grande partie ce problème. Les FAI pourraient, avec un peu d’effort, identifier les nœuds Freenet, bien que nous rendions cette identification plutôt difficile : le protocole actuel de Freenet est conçu pour être difficilement détectable, et la sténographie sera utilisée à un moment donné. Cependant, l’analyse de l’écoulement du trafic, ou le blocage par force brute de tout le trafic pair à pair (p. ex. le trafic entre les adresses IP marquées comme « consommateur » plutôt qu’« affaires »), les deux approches englobant beaucoup plus que Freenet, pourrait certainement être efficace pendant un certain temps.
