Repository: hyphanet/website
Catalog: locales/*/LC_MESSAGES/freenet_site.po
Languages: fr

source: ### Updateable Subspace Keys Updateable Subspace Keys are useful for linking to the latest version of a Signed Subspace Key (SSK) site. Note that USKs are really just a user-friendly wrapper around SSKs, which hide the process of searching for more recent versions of a site. A typical USK key looks like this: USK@public key hash,decryption key,crypto settings/user selected name/number/ It is almost identical to the Signed Subspace Key, with the exception of the version-number. There are two types of USK addresses: * an USK with a positive number at the end, or * an USK with a negative number at the end.
fr: ### Les clés de sous-espace actualisable Les clés de sous-espace actualisable sont utiles pour établir des liens vers la version la plus récente d’un site utilisant une clé de sous-espace signé (SSK). Prendre note que les USK ne sont qu’un enveloppeur autour des SSK, facilitant leur utilisation, et dissimulant le processus de recherche de la version la plus récente d’un site. Une USK typique ressemble à ceci : USK@hachage de la clé publique,clé de déchiffrement,paramètres cryptographiques/nom choisi par l’utilisateur/nombre/ Elle est quasiment identique à la clé de sous-espace signé, si ce n’est du numéro de version. Il existe deux sortes d’adresse USK : * une USK avec un nombre positif à la fin, ou * une USK avec un nombre négatif à la fin.

source: The USK with a **positive** number at the end works like this: the Freenet node on your computer keeps a list of versions of USKs that it knows about, without necessarily storing the data as well. This list is built up from previous visits, and also background requests from previous visits to these kind of links. When you visit an USK like the one below, it consults this list for versions of the mysite site of number 5 or greater. If it finds any, it return the latest one. Then, in the background, it searches for **newer** versions that it doesn't yet know about to add to your USK registry for the next time you visit the address. Example (cut for screen purposes): USK@GB3wuHmt[..]o-eHK35w,c63EzO7u[..]3YDduXDs,AQABAAE/mysite/5/
fr: L’USK se terminant par un nombre **positif** fonctionne comme suit : le nœud Freenet sur votre ordinateur conserve une liste des versions des USK qu’il connaît, sans nécessairement stocker aussi les données. Cette liste est construite au fur et à mesure des visites, mais aussi à partir de requêtes d’arrière-plan de visites antérieures vers ces types de liens. Quand vous visitez une USK telle que celle ci-dessous, il consulte cette liste à la recherche de versions du site monsite numéro 5 ou supérieure. S’il en trouve, il retourne le plus récent. Ensuite, en arrière-plan, il recherche des versions **plus récentes** dont il n’a pas encore connaissance pour les ajouter à votre registre d’USK en vue de votre prochaine visite à cette adresse. Exemple (coupé pour affichage à l’écran) : USK@GB3wuHmt[..]o-eHK35w,c63EzO7u[..]3YDduXDs,AQABAAE/monsite/5/

source: When you visit a link with a **negative** number at the end, Freenet searches for the version you requested (e.g. **-7**) plus four more (i.e. 7,8,9,10, 11) at the node on your computer and on other nodes. If it finds only version 7, it will return that. If it finds one of the others, it searches for another batch of five versions: 12,13,14,15,16\. It repeats this until there are four consecutive versions it can't find. Then it will return the latest version it has found so far. Example (cut for screen purposes): USK@GB3wuHmt[..]o-eHK35w,c63EzO7u[..]3YDduXDs,AQABAAE/mysite/-7/ The real treat with USKs comes when data is to be inserted into Freenet. But more on that elsewhere.
fr: Quand vous visitez un lien se terminant par un nombre **négatif**, Freenet recherche la version que vous avez demandée (p. ex. **-7**) plus quatre autres (c.-à-d. 7,8,9,10,11) dans le nœud de votre ordinateur, ou sur d’autres nœuds. S’il ne trouve que la version 7, il la retournera. S’il trouve l’une des autres, il recherche un autre lot de cinq versions : 12,13,14,15,16\. Il répète ce processus jusqu’à ce qu’il trouve quatre versions consécutives. Il retourne ensuite la version la plus récente qu’il aura trouvée à ce point. Exemple (coupé pour affichage à l’écran) : USK@GB3wuHmt[..]o-eHK35w,c63EzO7u[..]3YDduXDs,AQABAAE/monsite/-7/ Les USK sont particulièrement intéressantes quand des données sont insérées dans Freenet. Mais nous y reviendrons ailleurs.

source: ### Keyword Signed Keys Keyword-Signed Keys (KSKs) allow you to save named pages in Freenet. They are not secure against spamming or name hijacking. Several people could each insert a different file to Freenet, all with the same address. However, there is a collision detection, which tries to prevent overwriting of a once-inserted page. A KSK address looks like this: KSK@myfile.txt The drawback to KSKs is that anyone can insert a file with the same name as yours and divert traffic from your file to their own. The advantage is human readable links that can be easily remembered. The KSK description should not contain slashes, just as with other keys ( slashes are used to denote Manifests or Containers). A KSK address can contain a redirection to a CHK address, or it can contain the file itself.
fr: ### Les clés signées par mot-clé Les clés signées par mot-clé (KSK) vous permettent d’enregistrer des pages désignées dans Freenet. Elles ne résistent pas au pollupostage ni au détournement de nom. Différentes personnes pourraient toutes insérer un fichier différent dans Freenet, tous avec la même adresse. Cependant, il existe une détection des collisions qui essaie d’empêcher l’écrasement d’une page une fois qu’elle est insérée. Une KSK ressemble à ceci : KSK@monfichier.txt L’inconvénient des KSK est que n’importe qui peut insérer un fichier portant le même nom que le vôtre et détourner le trafic de votre fichier vers le leur. L’avantage est des liens interprétables par l’utilisateur dont on peut se souvenir facilement. La description de la KSK ne devrait pas contenir de barre oblique, comme pour les autres clés (les barres obliques sont utilisées pour désigner des manifestes et des conteneurs). Une adresse KSK peut contenir un réacheminement vers une adresse CHK, ou elle peut contenir le fichier même.

source: ### Containers A container, in general Freenet terms, is a file that contains several other files. In Freenet 0.7, a freesite, or other collection of files, may be bundled together in a ZIP file, which is limited in size to 2MB. Containers have the advantage that when you load one page you load all the files on the freesite, so either it loads in its entirety or it doesn't load at all, and greatly reduce the number of keys required to insert a given freesite. Containers are currently created transparently when inserting a freesite using e.g. jSite.
fr: ### Les conteneurs De façon générale, dans Freenet, un conteneur est un fichier contenant plusieurs autres fichiers. Dans Freenet 0.7, un siteFree, ou une autre collection de fichiers peuvent être groupés dans un fichier ZIP limité à 2 Mo. Les conteneurs présentent l’avantage de charger toutes les pages du siteFree lors du chargement d’une page, et soit le chargement est complet, soit il n’a juste pas lieu, ce qui réduit grandement le nombre de clés nécessaires pour insérer un siteFree donné. Les conteneurs sont actuellement créés de manière transparente lors de l’insertion d’un siteFree en utilisant p. ex. jSite.

source: ### Manifests A manifest contains metadata over the list of blocks a CHK is divided into and some information about the content-type(MIME), the filenames and other useful information. The main information is whether the CHK-key is a splitfile or not, and whether the manifest is chained or not. You don't need to know much about manifests in order to use Freenet, since it is a part that is handled internally.
fr: ### Les manifestes Un manifeste contient des métadonnées sur la liste de blocs qui divisent une CHK et des informations sur le type de contenu (MIME), sur les noms de fichier et autres informations utiles. L’information principale est de savoir si la CHK est un fichier fractionné ou non, et si le manifeste est enchaîné ou non. Vous n’avez pas besoin de savoir grand-chose sur les manifestes pour utiliser Freenet, car cette partie est gérée en interne.

source: Freenet provides the foundation for anonymous email, forums and chat, as well as a replacement for Facebook/Twitter. Setup of these is described in the [Freenet Social Networking Guide](http://freesocial.draketo.de/) which can also be accessed [over Freenet](http://127.0.0.1:8888/USK@t5zaONbYd5DvGNNSokVnDCdrIEytn9U5SSD~pYF0RTE,guWyS9aCMcywU5PFBrKsMiXs7LzwKfQlGSRi17fpffc,AQACAAE/fsng/58/).
fr: Freenet jette les bases pour du courriel, des forums et du clavardage anonymes, ainsi qu’une solution de remplacement à Facebook/Twitter. Leur mise en œuvre est décrite dans le [Guide du réseautage social de Freenet](http://freesocial.draketo.de/) auquel on peut aussi accéder [par Freenet](http://127.0.0.1:8888/USK@t5zaONbYd5DvGNNSokVnDCdrIEytn9U5SSD~pYF0RTE,guWyS9aCMcywU5PFBrKsMiXs7LzwKfQlGSRi17fpffc,AQACAAE/fsng/58/).

source: jSite is a graphical application that you can use to create, insert and manage your own Freenet sites. It was written in Java by Bombe. You can [download jSite here](https://downloads.freenetproject.org/alpha/jSite/jSite.jar)
fr: jSite est une application graphique que vous pouvez utiliser pour créer, insérer et gérer vos propres sites Freenet. Elle a été écrite en Java par Bombe. Vous pouvez[télécharger jSite ici](https://downloads.freenetproject.org/alpha/jSite/jSite.jar)

source: ### Starting jSite To start jSite, type the following in a terminal: <pre> java -jar jSite.jar</pre> The first window you see is this: ![](assets/img/jsite/select-project.png) In the pane to the left, already created projects can be selected for updating, deleting or cloning. Since this is the first start, no such projects exist.
fr: ### Démarrer jSite Pour démarrer JSite, taper la commande suivante dans un terminal : <pre> java -jar jSite.jar</pre> Voici la première fenêtre affichée : ![](assets/img/jsite/select-project.png) Dans le volet de gauche, des objets déjà créés peuvent être sélectionnés afin de les mettre à jour, de les supprimer ou de les cloner. Pour un premier démarrage, aucun projet n’existe encore.

source: ### Creating a Freesite To create a new Freesite, you click the **Add project**-button. You then need to fill in the details of the project. Under the Project information-section: * **Name** - this is just a name for you to know the project, so anything will do. It may contain spaces. * **Description** - again, just a slightly longer description of the project for your own convenience. * **Local Path** - This is a directory where you will store all the pages of the freesite you are creating. Put in the full path. You can click the Browse button to select a directory graphically or just type it in.
fr: ### La création d’un siteFree Afin de créer un nouveau siteFree, il vous suffit de cliquer sur le bouton **Ajouter un projet**. Vous devez ensuite saisir les détails du projet. Sous la section Informations du projet : * **Nom ** - juste un nom afin que vous reconnaissiez le projet, et n’importe quel nom fera l’affaire. Il peut contenir des espaces. * **Description** - juste une description légèrement plus longue du projet, pour vos besoins. * **Chemin local** - le répertoire où vous stockerez toutes les pages du siteFree que vous créez. Vous pouvez cliquer sur le bouton Parcourir pour choisir graphiquement un répertoire, ou vous pouvez juste saisir le chemin complet.

source: Under the Address-section, there are some automatically generated entries, and the human readable name for the site, as seen in the address-field of the browser: * **Request URI** - this is filled in automatically and should be a long string of seemingly random characters. * **Insert URI** - this is also filled in automatically and will look similar to the Request URI. * **Path** - You need to enter a single word here without spaces. This will appear at the end of the address of your site. You can't leave this blank. Below is an example of how it might look: ![](assets/img/jsite/project-details.png) When everything is filled in correctly, you may press **Next**.
fr: Dans la section Adresse se trouvent des entrées générées automatiquement, et le nom interprétable par l’utilisateur du site, tel que présenté dans le champ d’adresse du navigateur : * **URI de requête** - remplie automatiquement. Devrait être une longue chaîne de caractères apparemment aléatoires. * **URI d’insertion** - remplie aussi automatiquement. Devrait ressembler à l’URI de requête. * **Chemin** - Vous devez saisir ici un seul mot sans espace. Il apparaîtra à la fin de l’adresse de votre site. Il ne peut pas être vide. Cela pourrait ressembler à l’exemple ci-dessous : ![](assets/img/jsite/project-details.png) Une fois que tout est rempli correctement, vous pouvez cliquer sur **Suivant**.

source: The next step is to add files to your Freenet site (or Freesite). This is done in the dialog called **Project Files**. Since we have no files in the current directory, yet, the dialog is pretty much empty. ![](assets/img/jsite/project-files.png) To add files, we put some files in the local directory we specified earlier, **/home/test**, and press **Re-scan**. Then, presto, the files appear. ![](assets/img/jsite/default-file.png) We then highlight one of these files that will be the default page (e.g. index.html might be a good choice) and check the **Default file** checkbox. It should recognise the MIME type as text/html, so leave everything else as they are and click the **Insert now** button.
fr: La prochaine étape consiste à ajouter des fichiers au site Freenet (ou siteFree). Vous pouvez le faire grâce à la fenêtre de dialogue intitulée **Fichiers du projet**. Dans la mesure où il n’y a pas encore de fichier dans le répertoire actuel, la fenêtre de dialogue est vide. ![](assets/img/jsite/project-files.png) Pour ajouter des fichiers, placez-en dans le répertoire local que vous avez spécifié plus tôt, **/home/test**, et cliquez sur **Analyser de nouveau**, puis les fichiers apparaîtront instantanément. ![](assets/img/jsite/default-file.png) Ensuite, mettez en surbrillance un de ces fichiers afin qu’il devienne la page par défaut, (p. ex. index.html pourrait être un bon choix), et cochez la case **Fichier par défaut**. Le type MIME devrait être reconnu comme text/html, et laissez donc le reste ainsi et cliquez sur le bouton **Insérer maintenant**.

source: If all goes well, a window like the one below should appear. It may take quite a while to insert the Freesite, several minutes in fact. ![](assets/img/jsite/project-insert.png) When all is finished, you will get a message pop-up that tells you that the site has been inserted successfully. You can copy the URI to the clip-board by clicking the **Copy URI to Clipboard** -button.
fr: Si tout va bien, une fenêtre comme celle ci-dessous devrait apparaître. L’insertion du siteFree pourrait prendre un certain temps, plusieurs minutes en fait. ![](assets/img/jsite/project-insert.png) Quand tout sera terminé, vous verrez un message vous informant que le site a été inséré avec succès. Vous pourrez alors copier l’URI dans le presse-papiers en cliquant sur le bouton **Copier l’URI dans le presse-papiers**.

source: Then you can use FProxy to surf to your newly created Freesite. Just paste the URI after the [http://localhost:8888/](http://localhost:8888/) in the browser address bar, like this (cut for screen purposes): <pre> http://localhost:8888/freenet:USK@cJNO6G0[..]joM,AQACAAE/watergate2/1/</pre> If it works, congratulations, you have just created your first Freesite!
fr: Vous pouvez alors utiliser FProxy pour surfer vers votre siteFree nouvellement créé. Il vous suffit de coller l’URI après [http://localhost:8888/](http://localhost:8888/) dans la barre d’adresse du navigateur, comme suit (coupé pour affichage à l’écran) : <pre> http://localhost:8888/freenet:USK@cJNO6G0[..]joM,AQACAAE/watergate2/1/</pre> Si ça fonctionne, félicitations, vous venez juste de créer votre premier siteFree !

source: Donate
fr: Faire un don

source: Become a member
fr: Devenir membre

source: Make a donation
fr: Faire une don

source: Choose your monthly donation:
fr: Choisissez votre don mensuel :

source: Choose your one-time donation:
fr: Choisissez votre don unique :

source: Or set your own amount:
fr: Ou définissez votre propre montant :

source: Custom amount
fr: Montant personnalisé

source: #### How can I donate? * You can donate using PayPal. For a recurring payment of $5 or more per month you can become a Freenet "member" (this requires a [PayPal][url_paypal] account). Recurring donations give the project a more stable and dependable income which makes it easier to make long-term commitments to potential developers. Alternatively you can make a one-time donation.
fr: #### Comment puis-je faire un don ? * Vous pouvez faire un don en utilisant PayPal. Pour un paiement périodique de 5 $ ou plus par mois, vous pouvez devenir « membre » de Freenet (un compte [PayPal][url_paypal] est exigé). Les dons périodiques fournissent au projet des revenus plus stables et plus fiables, ce qui facilite les engagements à long terme envers des développeurs potentiels. Vous pouvez aussi faire un don unique.

source: * ![][logo_bitcoin] You can donate using [Bitcoin][url_bitcoin]. Send your donations to {bitcoin_address}. * You can also donate by purchasing items from the Freenet [store][url_zazzle_store]. * Or support us via [Salt at Bountysource][url_salt_bountysource]. * Alternatively, please contact us at {donate_email} if you cannot use any of these payment methods.
fr: * ![][logo_bitcoin] Vous pouvez faire un don en [bitcoins][url_bitcoin]. Envoyez votre don à {bitcoin_address}. * Vous pouvez aussi faire un don en achetant des articles sur la [boutique][url_zazzle_store] Freenet. * Ou soutenez-nous sur [Salt à Bountysource][url_salt_bountysource]. * Vous pouvez aussi nous contacter à {donate_email} si vous ne pouvez utiliser aucun des ces modes de paiement.

source: The Freenet Non-Profit
fr: L’organisme sans but lucratif Freenet

source: All donations go to The Freenet Project Inc, a 501(c)(3) non-profit organization with the following mission statement: > The specific purpose of this corporation is to assist in developing and > disseminating technological solutions to further the open and democratic > distribution of information over the Internet or its successor electronic > communication networks or organizations. It is also the purpose of this > organization to guarantee consenting individuals the free, unmediated, > and unimpeded reception and impartation of all intellectual, scientific, > literary, social, artistic, creative, human rights, and cultural > expressions, opinions and ideas without interference or limitation by or > service to state, private, or special interests. It is also the purpose of > this organization to educate the world community and be an advocate of > these purposes. All funds received will only be utilized to advance our Mission Statement, and are administered at the direction of the Freenet Project Board. The Freenet Project Inc is registered under EIN `95-4864038`
fr: Tous les dons vont à « The Freenet Project Inc » est un organisme sans but lucratif 501(c)(3) dont l’énoncé de mission est la suivante : L’objectif précis de cette organisation est d’aider au développement et à la diffusion de solutions technologiques afin d’améliorer la distribution ouverte et démocratique de l’information sur Internet ou les réseaux et entreprises de communication électronique qui lui succéderont. L’objectif de cette organisation est aussi de garantir aux individus consentants la réception et la transmission libres, sans intermédiaires et sans entraves de toute expression intellectuelle, scientifique, littéraire, sociale, artistique, créatrice, culturelle, sur les droits de la personne, de toute opinion, de toute idée sans interférences ou restrictions par des intérêts privés, spéciaux ou au service de l’État. L’objectif de cette organisation est encore d’éduquer la communauté internationale et de promouvoir ces buts. Tous les fonds reçus seront utilisés pour faire avancer notre énoncé de mission et sont administrés par le conseil d’administration de Freenet. « The Freenet Project Inc » est enregistré sous EIN 95-4864038

source: Why donate
fr: Pourquoi faire un don
