Repository: hyphanet/website
Catalog: locales/*/LC_MESSAGES/freenet_site.po
Languages: fr

source: ### 10\. Alternatives to Copyright Fortunately it won't come to this. There are many alternative ways to reward artists. The simplest is voluntary payment. This is an extension of the patronage system which was frequently used to reward artists prior to copyright, where a wealthy person would fund an artist to allow them to create full-time. The Internet permits an interesting extension of this idea, where rather than having just one wealthy patron, you could have hundreds of thousands, contributing small amounts of money over the Internet. We actually practice what we preach in this regard too, on the 15th of March 2001 the Freenet Project started taking donations, and within a week we had collected over $1000.
fr: ### 10\. Solutions de remplacement des droits d’auteur Heureusement, nous n’en arriverons pas là. Il y a de nombreuses solutions de remplacement pour récompenser les artistes. La plus simple est le paiement volontaire. Il découle du système de mécénat qui était fréquemment utilisé pour récompenser les artistes avant les droits d’auteur, alors qu’une personne riche finançait un artiste pour lui permettre de créer à temps plein. Internet permet une extrapolation de cette idée, avec non pas un mécène riche, mais des centaines de milliers, donnant de petites sommes d’argent par Internet. Nous mettons aussi en pratique ce que nous recommandons à ce sujet. Le 15 mars 2001, le Projet Freenet commença à accepter les dons, et en une semaine, nous avions recueilli 1 000 $.

source: People
fr: Les contributeurs

source: ## Current Contributors
fr: ## Contributeurs actuels

source: ### Ian Clarke Freenet is based on Ian's paper "A Distributed Decentralised Information Storage and Retrieval System". Ian started the Freenet Project around July of 1999, and continues to coordinate the project. Learn more about Ian on his [personal website](http://blog.locut.us/).
fr: ### Ian Clarke Freenet découle de l’article de Ian « A Distributed Decentralised Information Storage and Retrieval System » (un système distribué de stockage et de récupération des informations)". Ian a démarré le Projet Freenet aux alentours de juillet 1999 et continue de coordonner le projet. Apprenez-en davantage à propos d’Ian sur son [site Web personnel](http://blog.locut.us/).

source: ### Matthew Toseland Matthew has been working on Freenet since before the 0.5 release. His work and that of others has resulted in dramatic improvements to the performance and stability of the network.
fr: ### Matthew Toseland Matthew a travaillé sur Freenet dès avant la version 0.5. Son travail, et celui d’autres, a entraîné des améliorations considérables des performances et de la stabilité du réseau.

source: ### Oskar Sandberg Oskar was also one of the earliest contributors to the Freenet Project, and has made some important theoretical breakthroughs that lead to the beginning of Freenet 0.7, see the papers page.
fr: ### Oskar Sandberg Oskar était aussi l’un des premiers contributeurs au Projet Freenet, et il a réalisé des percées théoriques importantes qui ont mené au début de Freenet 0.7. Voir la page des articles.

source: ### Florent Daignière Since 2003, Florent has improved various aspects of the software and performed the project's system administration. In his day job, he is the Technical Director of [Matta Consulting](https://www.trustmatta.com), a boutique security consultancy firm.
fr: ### Florent Daignière Depuis 2003, Florent a amélioré divers aspects du logiciel et a pris en charge l’administration système du projet. Dans son emploi principal, il est directeur technique de [Matta Consulting] (https://www.trustmatta.com), un cabinet spécialisé de consultation en matière de sécurité.

source: ### Michael Rogers Michael has mostly contributed detailed simulations as part of the Google Summer of Code. He has been helpful in designing the [new transport layer]( https://old-wiki.freenetproject.org/NewTransportLayer).
fr: ### Michael Rogers Michael a principalement effectué des simulations détaillées dans le cadre du « Google Summer of Code ». Il a aussi aidé à concevoir la [nouvelle couche de transport] (https://old-wiki.freenetproject.org/NewTransportLayer).

source: ### Steve Dougherty The current release manager. He joined in GSoC 2013 and has been a driving force behind tackling long standing issues in Freenet.
fr: ### Steve Dougherty Responsable des parutions. Il s’est joint au projet pour le GSoC 2013 et a été l’un des moteurs de la résolution des problèmes persistants dans Freenet.

source: ### xor The Developer of the Web of Trust and Freetalk. He worked on the Web of Trust in part-time for one year and is now working as volunteer again.
fr: ### xor Développeur de la toile de confiance « Web of Trust » et de Freetalk. Il a travaillé sur la toile de confiance à temps partiel pendant un an, et travaille maintenant à nouveau comme bénévole.

source: ### David (Bombe) Roden The developer of the site insertion tool jSite and of Sone, the Social Network over Freenet.
fr: ### David (Bombe) Roden Développeur du l’outil d’insertion de sites jSite et de Sone, le réseau social sur Freenet.

source: ### Ximin Luo A debian developer who currently works on packaging Freenet.
fr: ### Ximin Luo Un développeur Debian qui travaille actuellement sur l’empaquetage de Freenet.

source: ### Bert Massop Works on the Freenet core and wherever there is need.
fr: ### Bert Massop Travaille sur le noyau de Freenet et là où le besoin se fait sentir.

source: ### TheSeeker A long term contributor who, among other things, helps keep the contact between the core developers and users in active subgroups.
fr: ### TheSeeker Un contributeur de longue date qui, entre autres, aide à assurer le contact entre les développeurs principaux et les utilisateurs dans les sous-groupes actifs.

source: ### Tommy[D] A Gentoo packager who untangled all the dependencies of Freenet and packaged it cleanly in Gentoo.
fr: ### Tommy[D] Un empaqueteur de Gentoo qui a démêlé toutes les dépendances de Freenet et les a proprement empaquetées dans Gentoo.

source: ### Arne Babenhauserheide The current maintainer of pyFreenet and infocalypse. He also writes articles and tutorials for Freenet.
fr: ### Arne Babenhauserheide Le mainteneur actuel de pyFreenet et d’infocalypse. Il écrit aussi des articles et des tutoriels sur Freenet.

source: ### The translators A dilligent team of people from various backgrounds who make it possible to ship Freenet and this website in many different languages.
fr: ### Les traducteurs Une équipe diligente de personnes d’horizons divers qui permettent de proposer Freenet et ce site Web en de nombreuses langues.

source: ### Many more great hackers This list is missing many freesite authors, plugin writers, and a host of other people who contributed in various ways.
fr: ### Et de nombreux grands bidouilleurs Il manque dans cette liste de nombreux auteurs de sitesFree, de scripteurs de greffons, et bien d’autres personnes qui ont collaboré d’une manière ou d’une autre.

source: ## Anonymous Contributors
fr: ## Les contributeurs anonymes

source: ### Eleriseth Works on Freenet core and communicates via FMS.
fr: ### Eleriseth Travaille sur le noyau de Freenet et communique par FMS.

source: ### Somedude The developer of the Freenet-based Forum system FMS, of FreenetHG and of FLIP, chat over Freenet.
fr: ### Somedude Développeur de FMS, le système de forum basé sur Freenet, de FreenetHG et de FLIP, le clavardage sur Freenet.

source: ### The folks from Frost A group of users and programmers who use an old spammable Freenet-based forum system which has been abandoned by most of the core developers. They are active, however, and though it takes time for their contributions to reach to core development, they take part in Freenet development.
fr: ### Les gens de Frost Un groupe d’utilisateurs et de programmeurs qui utilisent un ancien système de forum pollupostable basé sur Freenet, qui a été abandonné par la plupart des développeurs principaux. Ils sont cependant actifs, et bien que leurs contributions prennent du temps à atteindre le développement de base, ils participent au développement de Freenet.

source: ## Previous Contributors
fr: ## Contributeurs passés

source: ### Thomas Markus A dutch developer and statistic-enthusiast. He now works at Topicus.Education.
fr: ### Thomas Markus Un développeur néerlandais, passionné de statistiques. Il travaille maintenant pour Topicus.Education.

source: ### Scott Miller Scott is responsible for the implementation of much of the cryptography elements within Freenet.
fr: ### Scott Miller Scott est responsable de la mise en œuvre de nombreux éléments cryptographiques qui composent Freenet.

source: ### Steven Starr Steven helps with administration of Freenet Project Inc, and is an advisor to the project on business and publicity matters.
fr: ### Steven Starr Steven aide à l’administration de « Freenet Project Inc » et conseille le projet en matière d’affaires et de publicité.

source: ### Dave Baker Dave's main contribution has been [Freemail](documentation.html#freemail), his Summer of Code project to build a working email-over-Freenet system, as well as some debugging and core work in various places.
fr: ### Dave Baker La contribution principale de Dave a été [Freemail](documentation.html#freemail), son projet « Summer of Code » visant à concevoir un système fonctionnel de courriel-dans-Freenet, mais aussi du travail de débogage et autres travaux de base.

source: ### Robert Hailey Robert has helped improve the speed and security of Freenet by finding two **major** bugs, and has recently contributed some code.
fr: ### Robert Hailey Robert a aidé à améliorer la vitesse et la sécurité de Freenet en découvrant deux bogues **majeurs** et en proposant du code.

source: ### David Sowder David (Zothar) has helped the Freenet Project as time permits and interest directs, including configuration, statistics and peer management via FCP, the FProxy stats page and Node 2 Node Messages (N2NM/N2NTMs). And **hundreds of others**, who either haven't asked to be added here, who prefer to remain nameless, or who we just haven't got around to thanking. Not to mention thousands of users, testers, and [donors](donate.html#sponsors)!
fr: ### David Sowder David (Zothar) a aidé le Projet Freenet suivant ses disponibilités et ses champs d’intérêt, y compris la configuration, la gestion des statistiques et des pairs avec FCP, la page de statistiques de FProxy et les messages de nœud à nœud (MNàN/MTNàN). Et des **centaines d’autres**, qui n’ont soit pas demandé de paraître ici ou qui préfèrent rester anonymes, ou encore que nous n’avons pas eu l’occasion de remercier. Sans oublier les milliers d’utilisateurs, de testeurs et de [donateurs](donate.html#sponsors) !

source: Papers
fr: Les articles

source: ![][icon_pdf] [Measuring Freenet in the Wild: Censorship-resilience under Observation](assets/papers/roos-pets2014.pdf) (PDF) Observations and measurements on the live Freenet network. Includes suggestions for improvement. This was submitted to PETS 2014.
fr: ![][icon_pdf] [« Measuring Freenet in the Wild: Censorship-resilience under Observation » (Mesurage de Freenet en action : la résistance à la censure sous observation](assets/papers/roos-pets2014.pdf) (PDF) Observations et mesures du réseau Freenet de production. Des suggestions d’amélioration sont incluses. Cet article a été présenté durant PETS 2014.

source: ![][icon_pdf] [The Dark Freenet](assets/papers/freenet-0.7.5-paper.pdf) (PDF) Detailed paper about the Freenet 0.7.5 network, as opposed to its routing algorithm, which is detailed in the below papers. Includes some new simulations. This has been submitted to PET 2010.
fr: ![][icon_pdf] [« The Dark Freenet » (Le Freenet invisible)](assets/papers/freenet-0.7.5-paper.pdf) (PDF) Article détaillé sur le réseau Freenet 0.7.5, par opposition à son algorithme de routage, qui est détaillé dans les articles ci-dessous. De nouvelles simulations sont incluses. Cet article a été présenté durant PETS 2010.

source: ![][icon_video] [Video of Small World talk, Berlin, December 2005](http://player.vimeo.com/video/22488244?title=0&byline=0&portrait=0) This is a video of a talk given by Ian Clarke and Oskar Sandberg at the Chaos Computer Congress in Berlin, December 2005, describing the (then) new architecture for Freenet 0.7\. You can also download the [slideshow]( assets/papers/ccc-slideshow.pdf.bz2), and the source for the Java [demo]( assets/papers/ccc-freenet-demo.tar.bz2) (requires Java 1.5).
fr: ![][icon_video] [Vidéo de l’exposé « Petit monde », Berlin, décembre 2005](http://player.vimeo.com/video/22488244?title=0&byline=0&portrait=0) C’est une vidéo d’un exposé donné par Ian Clarke et Oskar Sandberg au « Chaos Computer Congress » à Berlin en décembre 2005, décrivant la nouvelle (alors) architecture de Freenet 0.7\. Vous pouvez aussi télécharger le [diaporama](assets/papers/ccc-slideshow.pdf.bz2) et la source Java de la [démo](assets/papers/ccc-freenet-demo.tar.bz2) (Java 1.5 exigé).

source: ![][icon_pdf] [Searching in a Small World](assets/papers/lic.pdf) (PDF) Oskar Sandberg's licentiate thesis describing a simple decentralized mechanism for constructing small world networks that is inspired by Freenet's original design. Part II of the thesis describes the basis for the new Darknet architecture.
fr: ![][icon_pdf] [Searching in a Small World](assets/papers/lic.pdf) (PDF) Thèse de licence d’Oskar Sandberg, décrivant un mécanisme simple et décentralisé afin de construire des réseaux « petit monde », inspiré par la conception originale de Freenet. La seconde partie de la thèse décrit les principes directeurs de l’architecture en réseau invisible.

source: ![][icon_pdf] [Distributed routing in Small World Networks](assets/papers/swroute.pdf) (PDF) A paper by Oskar Sandberg describing the theoretical basis for the new "Darknet" routing mechanism employed by Freenet 0.7.
fr: ![][icon_pdf] [Distributed routing in Small World Networks](assets/papers/swroute.pdf) (PDF) Un article d’Oskar Sandberg décrivant les fondements théoriques du nouveau mécanisme de routage en réseau invisible utilisé par Freenet 0.7.

source: ![][icon_pdf] Chaos Computer Congress Talk (slideshow) This is a [slideshow](assets/papers/ccc-slideshow.pdf.bz2) for a talk given at the Chaos Computer Congress on 30th Dec 2005 in Berlin, Germany by Ian Clarke and Oskar Sandberg. It described the new "darknet" approach to be employed in Freenet 0.7\. A Java demonstration to accompany the talk is [ also](assets/papers/ccc-freenet-demo.tar.bz2) available.
fr: ![][icon_pdf] Exposé au « Chaos Computer Congress » (diaporama) C’est le [diaporama](assets/papers/ccc-slideshow.pdf.bz2) d’un exposé donné au « Chaos Computer Congress » le 30 déc. 2005 à Berlin, Allemagne, par Ian Clarke et Oskar Sandberg. Il décrivait la nouvelle approche de réseau invisible qui allait être utilisée par Freenet 0.7\. Une démonstration Java accompagnant l’exposé est [aussi](assets/papers/ccc-freenet-demo.tar.bz2) proposée.

source: ![][icon_pdf] [Switching for a small world](assets/papers/vilhelm_thesis.pdf) (PDF) A thesis by Vilhelm Verendel exploring ways to optimise the swapping algorithm.
fr: ![][icon_pdf] [Switching for a small world](assets/papers/vilhelm_thesis.pdf) (PDF) Une thèse par Vilhelm Verendel, explorant les manières d’optimiser l’algorithme de permutation.

source: ![][icon_pdf] [Protecting Freedom of Information Online with Freenet](assets/papers/freenet-ieee.pdf) (PDF) An IEEE Internet Computing article describing the Freenet architecture circa 2002 - probably the best introduction to the theory behind Freenet.
fr: ![][icon_pdf] [Protecting Freedom of Information Online with Freenet](assets/papers/freenet-ieee.pdf) (PDF) Un article d’« IEEE Internet Computing » décrivant l’architecture Freenet vers 2002 - probablement la meilleure présentation de la théorie sous-jacente à Freenet.

source: ![][icon_pdf] [FreeNet White Paper](assets/papers/ddisrs.pdf) (PDF) Original white paper by Ian Clarke, Division of Informatics, University of Edinburgh 1999.
fr: ![][icon_pdf] [FreeNet White Paper](assets/papers/ddisrs.pdf) (PDF) Document original de présentation par Ian Clarke, division de l’informatique, Université d’Édimbourg 1999.

source: ![][icon_pdf] [Attack Resistant Network Embeddings for Darknets](http://www.ukp.tu-darmstadt.de/fileadmin/user_upload/Group_P2P/share/publications/Attack_Resistant_Network_Embeddings_for_Darknets.pdf) (PDF) A proposal for changing the darknet swapping algorithm which we are still considering (we have some doubts about long-term performance).
fr: ![][icon_pdf] [Attack Resistant Network Embeddings for Darknets](http://www.ukp.tu-darmstadt.de/fileadmin/user_upload/Group_P2P/share/publications/Attack_Resistant_Network_Embeddings_for_Darknets.pdf) (PDF) Une proposition de changement de l’algorithme de permutation du réseau invisible que nous examinons toujours (nous avons des doutes sur les performances à long terme).

source: ![][icon_pdf] [A Contribution to Analyzing and Enhancing Darknet Routing](http://www.p2p.tu-darmstadt.de/publications/details/?no_cache=1&tx_bibtex_pi1%5Bpub_id%5D=TUD-CS-2013-0036) ([PDF](http://www.p2p.tu-darmstadt.de/fileadmin/user_upload/Group_P2P/share/INFOCOM.pdf)) A proposal for changing the routing algorithm which we are still considering (the worst case performance i.e. when a block has been lost may be unacceptable).
fr: ![][icon_pdf] [A Contribution to Analyzing and Enhancing Darknet Routing](http://www.p2p.tu-darmstadt.de/publications/details/?no_cache=1&tx_bibtex_pi1%5Bpub_id%5D=TUD-CS-2013-0036) ([PDF](http://www.p2p.tu-darmstadt.de/fileadmin/user_upload/Group_P2P/share/INFOCOM.pdf)) Une proposition de changement de l’algorithme de routage que nous examinons toujours (les performances dans les pires cas, c.-à-d. quand un bloc a été perdu, pourraient ne pas être acceptables).

source: ![][icon_pdf] [Presentation: Towards "Dark" Social Networking Services (Strufe et al.)](https://www.icsi.berkeley.edu/icsi/sites/default/files/events/events_1303_strufe.pdf) (PDF) An interesting presentation by the group responsible for the two above papers.
fr: ![][icon_pdf] [Presentation: Towards "Dark" Social Networking Services (Strufe et al.)](https://www.icsi.berkeley.edu/icsi/sites/default/files/events/events_1303_strufe.pdf) (PDF) Une présentation intéressante par le groupe responsable des deux articles ci-dessus.

source: ![][icon_pdf] [Pisces: Anonymous Communication Using Social Networks](http://arxiv.org/abs/1208.6326) An algorithm for setting up onion-like tunnels on darknets.
fr: ![][icon_pdf] [Pisces : des communications anonymes qui utilisent les réseaux sociaux](http://arxiv.org/abs/1208.6326) Un algorithme qui permet de mettre en place des tunnels de style oignon sur les réseaux invisibles.

source: ![][icon_pdf] [Routing in the Dark: Pitch Black](http://grothoff.org/christian/pitchblack.pdf) ([citeseer](http://citeseerx.ist.psu.edu/viewdoc/summary?doi=10.1.1.117.1543)) (PDF) A paper describing some attacks on Freenet 0.7's location swapping algorithm. We have solutions for this but they are still being tested.
fr: ![][icon_pdf] [Routing in the Dark: Pitch Black](http://grothoff.org/christian/pitchblack.pdf) ([citeseer](http://citeseerx.ist.psu.edu/viewdoc/summary?doi=10.1.1.117.1543)) (PDF) Un article décrivant des attaques sur l’algorithme de permutation d’emplacement de Freenet 0.7. Nous avons des solutions à cela, mais elles sont encore en cours de test.

source: The most up to date reference is of course [the source code]( https://github.com/freenet/fred), but there is also some useful documentation on [the wiki](https://wiki.freenetproject.org/) (you may have to search a bit), and most implemented ideas have been discussed in detail on [the mailing lists](help.html#mailing-lists) at some point, more recently often in-Freenet forums such as FMS, or [the bug tracker](https://bugs.freenetproject.org/). [icon_pdf]: assets/img/small-n-flat/file-pdf.png [icon_video]: assets/img/small-n-flat/file-video.png
fr: La référence la plus à jour est bien sûr [le code source](https://github.com/freenet/fred), mais l’on trouve aussi de la documentation utile sur [le wiki](https://wiki.freenetproject.org/) (vous aurez peut-être à chercher un peu), et l’on a discuté à un moment donné et en détail sur [les listes de diffusion](help.html#mailing-lists) de la plupart des idées mises en œuvre, plus récemment, souvent dans les forums internes à Freenet tels que FMS, ou [le système de suivi des bogues](https://bugs.freenetproject.org/). [icon_pdf] : assets/img/small-n-flat/file-pdf.png [icon_video] : assets/img/small-n-flat/file-video.png

source: About
fr: À propos de Freenet

source: I'll be patient, I promise!
fr: Je serai patient, je le promets !

source: Please note
fr: Veuillez noter

source: This chat is staffed by volunteers, and it may be that no one is around right now. Please ask your question, and someone will answer within several hours.
fr: L’équipe de ce clavardage est composée de bénévoles, et il pourrait n’y avoir personne en ce moment. Veuillez poser votre question et quelqu’un vous répondra dans un délai de quelques heures.

source: Freenet rabbit logo
fr: Logo de lapin Freenet

source: Press:
fr: Presse :

source: Support:
fr: Assistance :

source: {irc_channel} on {irc_server}
fr: {irc_channel} sur {irc_server}

source: License
fr: Licence

source: Content on this website is licensed under the GNU Free Documentation License and may be available under other licenses.
fr: Le contenu de ce site Web est sujet à des droits d’auteur conformément à la Licence GNU de documentation libre et pourrait être proposé sous d’autres licences.

source: Design by DesignBootstrap
fr: Conception par DesignBootstrap

source: Developers
fr: Développeurs

source: If you already have a contribution in mind you can find the project repositories [on GitHub](https://github.com/freenet/). - Get in contact in the [mailing lists](help.html#mailing-lists) - Join us on IRC: [#freenet on chat.freenode.net](help.html#irc) - Report issues in the [bug tracker](https://bugs.freenetproject.org/) The Wiki contains a list of [freenet-related projects](https://wiki.freenetproject.org/Projects) and documentation of the [Freenet Client Protocol](https://wiki.freenetproject.org/FCPv2) for using Freenet from external programs. We're happy to accept pull requests on GitHub as well as patches sent under a pseudonym through Freenet forums such as [FMS](http://freesocial.draketo.de/fms_en.html).
fr: Si vous pensez déjà à une manière de contribuer, vous trouverez les dépôts du projet [sur GitHub](https://github.com/freenet/). – Contactez-nous grâce aux [listes de diffusion](help.html#mailing-lists) – Rejoignez-nous sur : [#freenet sur chat.freenode.net](help.html#irc) – Signalez les problèmes dans le [système de suivi des bogues](https://bugs.freenetproject.org/) Le wiki comprend une liste de [projets liés à Freenet](https://wiki.freenetproject.org/Projects) et la documentation du [protocole client de Freenet](https://wiki.freenetproject.org/FCPv2) afin d’utiliser Freenet à partir de programmes externes. Nous acceptons volontiers les demandes d’intégration sur GitHub, ainsi que les correctifs envoyés par des pseudonymes dans les forums Freenet tels que [FMS](http://freesocial.draketo.de/fms_en.html).

source: Translation
fr: Traduction

source: Bug tracker
fr: Système de suivi des bogues

source: Contribute
fr: Participer
