Repository: hyphanet/website
Catalog: locales/*/LC_MESSAGES/freenet_site.po
Languages: fr

source: Some academics [have published](http://www.ee.hawaii.edu/~dong/traceback/index.htm) a couple of attacks against Freenet, and they appear to be working on more as part of a project to unmask anonymous Freenet users. Build 1411, which was released on the 3rd of September, makes their main attack largely impractical. Nonetheless, we are working on improvements to both make this attack harder and to solve some of the [other known attacks](https://freenetproject.org/faq.html#attack). You can learn more about the attacks and our solution to them on our chief developer's [personal blog](http://amphibian.dyndns.org/flogmirror/#20120911-security). We welcome all work to understand Freenet's security and expose any problems with it, although we would suggest that next time they might let us know before they make the paper public, as is common practice in the security community. Finally, the long term solution is to build a darknet, a Freenet network where people only connect directly to people they trust. That means, get your friends using Freenet, and then add them as Friends on your node. When enough people use Freenet and form darknet connections, we won't need opennet, and this makes all attacks dramatically harder. We will work on making this easier and faster in the near future, as well as fixing the Pitch Black attack.
fr: Des universitaires [ont publié](http://www.ee.hawaii.edu/~dong/traceback/index.htm) quelques attaques contre Freenet, et semblent en élaborer d’autres dans le cadre d’un projet pour démasquer les utilisateurs anonymes de Freenet. La version 1411, parue le 3 septembre, rend leur attaque principale pratiquement impossible. Cependant, nous travaillons sur des améliorations pour rendre cette attaque encore plus difficile, et pour résoudre certaines [autres attaques connues](https://freenetproject.org/faq.html#attack). Vous pouvez en apprendre davantage sur les attaques et nos contresolutions sur le [blogue personnel](http://amphibian.dyndns.org/flogmirror/#20120911-security) de notre développeur en chef. Les efforts pour comprendre la sécurité de Freenet et pour en dévoiler les problèmes sont les bienvenus, bien que la prochaine fois nous suggérions qu’ils nous en fassent part avant de rendre leur article public, ce qui est d’usage dans la communauté de la sécurité. Enfin, la solution durable est de construite un réseau invisible, un réseau Freenet dans lequel les gens ne se connectent directement qu’à des personnes de confiance. Cela signifie enrôler vos amis dans Freenet et les ajouter comme amis sur votre nœud. Quand suffisamment de personnes utiliseront Freenet et établiront des connexions par un réseau invisible, nous n’aurons plus besoin du réseau ouvert et cela compliquera considérablement toutes les attaques. Nous nous efforcerons de faciliter et d’accélérer cette réalité dans un avenir proche, ainsi que de corriger l’attaque « Pitch Black ».

source: 2011-04-13 - Freenet top anti-censorship tool in survey of Chinese users!
fr: 2011-04-13 - Freenet en haut du palmarès des outils d’anticensure dans un sondage d’utilisateurs chinois !

source: A [report](http://www.freedomhouse.org/sites/default/files/inline_images/Censorship.pdf) by [Freedom House](http://freedomhouse.org/) surveyed users in Azerbaijan, Burma, [China](http://www.freedomhouse.org/sites/default/files/LOtF_China.pdf) and Iran for their perceptions of and preferred tools for bypassing local government censorship. In China, Freenet was the only anti-censorship tool to achieve 5 stars, and the third most widely used overall.
fr: Un [rapport](http://www.freedomhouse.org/sites/default/files/inline_images/Censorship.pdf) par [Freedom House](http://freedomhouse.org/) a sondé des utilisateurs en Azerbaïdjan, en Birmanie, en [Chine](http://www.freedomhouse.org/sites/default/files/LOtF_China.pdf) et en Iran au sujet de leurs perceptions sur les outils préférés pour passer outre la censure du gouvernement local. En Chine, Freenet était le seul outil anticensure à recevoir 5 étoiles, et le troisième le plus utilisé globalement.

source: News
fr: Nouvelles

source: Title of the Section
fr: Titre de la section

source: Markdown text
fr: Texte Markdown

source: Title
fr: Titre

source: Page Title
fr: Titre de la page
