Repository: hyphanet/website
Catalog: locales/*/LC_MESSAGES/freenet_site.po
Languages: fr

source: Documents initially made public by the Missouri police department describe their efforts on tracking Freenet usage. Using a simple scheme, they claim a near zero false positive rate for tracking the originator of a download. While we applaud all public documentation on attacks, we have to point out that the claimed effectiveness of their attacks is based solely on flawed mathematics. In reality, the false positive rate of their method is at least 83%, and close to 100% in real world scenarios. The claimed effectiveness of their attack is based on a false assumption about the distribution of the HTL of incoming requests. HTL (Hops to Live) is a number embedded in each request that is usually decremented when the request is forwarded, starting at a value of 18 at the originator of the request, and serves to limit the number of hops a request can survive on the network. As a security precaution, the HTL is decremented probabilistically on the first few hops. In their tracking efforts, the Missouri police department assumes that when multiple requests for pieces of a file arrive from a single node, and all these requests have HTL 18 with no requests at HTL 17 or 16, this node must be the originator of the requests, with a false positive probability decreasing with the number of requests received from the node. This would be true if whether the HTL is decremented is decided per request, which has historically been the case in the early days of Freenet. The vulnerability they claim to exploit was however addressed in 2008 (last touched in [this commit][commithtl18]). Whether the HTL is decremented is since decided per connection, so any probability they claim using the aforementioned method is false. For every connection there is a 50% chance that all the HTL 18 requests (not only a single one, as would be the case with per-request probabilistic decrementing) did not originate from the node from which we received them but were forwarded one step. So for 10 connections (the lowest number of peers Freenet uses), there are on average 5 other nodes whose HTL 18 requests are forwarded with HTL 18, so the probability that a given HTL 18 request originated at the node from which we received it is only about 17% (1 in 6). If the node has more connections (close to 30 is common), this probability is even lower. And this probability does not get higher when gathering more requests of chunks from a specific file or a specific kind of files, because they can reasonably all be forwarded from a different node — the one which really sent them. The heterogenity of the network and routing with second-level connections taken into account does not easily yield robust statistical claims without knowing the peers of peers of the node under investigation. Staying connected for a long time might allow for distinguishing between the changing peers of the node and requests originating at the node itself, but with significant cost. If the node which is tracked has friend-to-friend peers (which unlike automatically added peers do not change regularly), even waiting will not allow finding out with the described method whether HTL 18 requests came from the node itself or from the peers connected over friend-to-friend connections. For details, see [the code][codehtl18]. This does not make it impossible to track Freenet users who use only Opennet mode (connecting to strangers), since a network where nodes connect to strangers is inherently susceptible to Sybil attacks, where nodes of typical users are outnumbered by malicious, colluding nodes. The only way to defend against serious attacks is to *use Freenet in Friend-to-Friend mode*, where the precondition to tracking a user is social engineering to get the people to whom he/she is connected to betray the user. The need to defend against this type of attack is the reason why the core of Freenet was rewritten in 2007 to add this Friend-to-Friend mode (called Darknet mode). However the method used by the Missouri police department is using false statistics: despite its flaws, Freenet's Opennet is much harder to track than they claim. The Freenet developers do not condemn these attacks. Police departments try to use every legal venue to catch criminals. This is their job and vocation, but any attack they find could also be used by oppressive governments to suppress dissenting opinions, so we will work to fix attacks as they come to light. We expect law enforcement to get their math right, especially when using it in court. If they can get a warrant with an 83% false positive rate, that's a problem for lawmakers. If they falsely claim a 0% false positive rate, that's eroding the trust of citizens in the legal system. Additional information on this attack is available from the [mailing list discussion][mlhtl18]. The mission of the Freenet Project is to safeguard freedom of the press by providing censorship resistant communication. This requires protecting people against being targeted for what they write or read. To achieve this, Freenet enables users to publish anonymous websites and offers chat, forums, and file-sharing, as well as confidential communication among friends and methods to leverage the capabilities of Freenet from other tools. When the police spread misinformation about the security of Freenet, it directly undermines our mission by driving users to networks which cannot provide a comparable level of security for whistle-blowers and those wishing to publish anonymously.
fr: Des documents rendus publics initialement par le service de police du Missouri décrivent leurs efforts de suivi de l’utilisation de Freenet. En utilisant un système simple, ils prétendent pouvoir suivre à la trace l’initiateur d’un téléchargement avec un taux de faux positifs quasi nul. Bien que nous applaudissions toute documentation sur les attaques, nous devons souligner que l’efficacité alléguée de leurs attaques se base seulement sur des mathématiques erronées. En réalité, le taux de faux positifs de leur méthode est en réalité d’au moins 83 %, et près de 100 % dans des scénarios tirés de la réalité. L’efficacité alléguée de leur attaque se base sur une hypothèse erronée quant à la distribution du HTL des requêtes entrantes. HTL (Hops to Live) est un nombre incorporé à chaque requête et qui est habituellement décrémenté quand la requête est acheminée, en partant d’une valeur de 18 à l’initiateur d’une requête, et sert à limiter la survie, en nombre de sauts, d’une requête dans le réseau. Par mesure de sécurité, le HTL est décrémenté de façon probabiliste dès les quelques premiers sauts. Dans leurs efforts de suivi, le service de police du Missouri suppose que quand des morceaux d’un fichier sont demandés par un seul nœud, et que toutes ces requêtes ont un HTL 18 sans requêtes HTL 17 ou 16, ce nœud doit être l’initiateur des requêtes, avec une probabilité de faux positifs diminuant avec le nombre de requêtes reçues du nœud. Cela serait vrai s’il était décidé de décrémenter le HTL par requête, ce qui était le cas par le passé au début de Freenet. La vulnérabilité qu’ils disent exploiter a été corrigée en 2008 ((et pour la dernière fois dans cette [modification][commithtl18]). Il est depuis décidé si le HTL est décrémenté par connexion, donc toute probabilité qu’ils prétendent utiliser dans la méthode susmentionnée est fausse. Pour chaque connexion, il y a 50 % de chances que toutes demandes HTL 18 (pas une seulement comme ce serait le cas avec une décrémentation probabiliste par requête) ne proviennent pas initialement du nœud dont nous les avons reçues, mais d’un réacheminement. Donc pour 10 connexions (le plus petit nombre de pairs que Freenet utilise), il y a en moyenne 5 autres nœuds dont les requêtes HTL 18 sont réacheminées avec HTL 18, donc il n’y a que 17 % (1 sur 6) de probabilité qu’une demande HTL 18 donnée provienne initialement du nœud dont nous l’avons reçue. Si le nœud a plus de connexions (souvent près de 30), cette probabilité est encore plus basse. Et cette probabilité n’augmente pas en recueillant plus de demandes de morceaux d’un fichier particulier ou d’une sorte particulière de fichiers, car elles peuvent très bien toutes être réacheminées d’un nœud différent — celui qui les a réellement envoyées. En prenant en compte l’hétérogénéité du réseau et le routage par des connexions de deuxième niveau, l’on ne peut obtenir des prétentions statistiques solides sans connaître les pairs des pairs du nœud surveillé. Rester longuement connecté pourrait permettre de distinguer les pairs changeants du nœud des requêtes dont l’origine est le nœud même, mais cela à grand coût. Si le nœud qui est surveillé à des pairs amis à amis (qui contrairement aux pairs ajoutés automatiquement ne changent pas régulièrement), même une attente ne permettra pas de découvrir, avec la méthode décrite, si les requêtes HTL 18 proviennent du nœud même ou de pairs connectés par des connexions ami à ami. Pour plus de détails, consultez [le code][codehtl18]. Cela ne veut pas dire qu’il est impossible de suivre, de surveiller les utilisateurs de Freenet qui utilise seulement le mode Réseau ouvert (la connexion à des inconnus), dans la mesure où un réseau dont les nœuds se connectent à des inconnus est par définition propice aux attaques Sybil, car les nœuds malicieux, et qui sont de collusion, y ont l’avantage numérique sur les nœuds d’utilisateurs courants. La seule façon de se défendre contres des attaques virulentes est *d’utiliser Freenet en mode ami à ami*, où le préalable au suivi à la trace d’un utilisateur est par piratage psychologique en persuadant les personnes à qui il/elle est connecté de trahir l’utilisateur. Le besoin de se défendre contre ce type d’attaque et la raison pour laquelle le cœur même de Freenet a été réécrit en 2007 afin d’ajouter ce mode ami à ami (appelé mode invisible). Cependant, la méthode utilisée par le service de police du Missouri utilise des statistiques fausses : malgré ses défauts, le réseau ouvert de Freenet est bien plus difficile à surveiller qu’ils ne le prétendent. Les développeurs de Freenet ne condamnent pas ses attaques. Les services de police tentent d’utiliser tous les moyens juridiques pour attraper les criminelles. C’est leur travail et leur vocation, mais toutes les attaques qu’ils découvrent pourraient être utilisées par des gouvernements oppressifs pour réprimer toute opinion dissidente, et nous nous efforcerons de corriger ces attaques dès qu’elles seront découvertes. Nous nous attendons à ce que les responsables de l’application des lois ne fassent pas d’erreurs grossières, particulièrement quand ils utilisent leurs résultats devant un tribunal. S’ils peuvent obtenir un mandat avec un taux de faux positifs de 83 %, c’est un problème pour les législateurs. S’ils prétendent à tort un taux de faux positifs de 0 %, ils minent la confiance des citoyens envers le système juridique. Des informations supplémentaires sur cette attaque se trouvent dans la [discussion de la liste de diffusion][mlhtl18]. La mission du Projet Freenet est de préserver la liberté de la presse en fournissant des communications résistantes à la censure. Cela implique d’empêcher que les gens deviennent des cibles à cause de ce qu’ils écrivent ou lisent. Pour atteindre cet objectif, Freenet permet aux utilisateurs de publier des sites Web anonymes, et propose du clavardage, des forums et du partage de fichiers, ainsi que des communications confidentielles entre amis, et des méthodes pour tirer parti des possibilités de Freenet grâce à d’autres outils. Quand la police répand de la désinformation sur la sécurité de Freenet, elle mine notre mission en conduisant les utilisateurs vers des réseaux qui ne peuvent pas proposer un niveau comparable de sécurité pour les lanceurs d’alerte et ceux qui souhaitent publier anonymement.

source: 2016-05-22 - Freenet build 1473 released
fr: 2016-05-22 - Parution de Freenet version 1473

source: Freenet 0.7.5 build 1473 is now available. This is the first build to require Java 7! It upgrades Bouncy Castle to version 1.54, and adds a Traditional Chinese translation to the Windows installer. Plugin updates: * Add Sharesite - a fork of ShareWiki - as an official plugin. Thanks to ArneBab for getting it ready! It includes an earlier version of TextileJ to avoid license problems, and adds syntax help, external activelink support, and a template with div IDs for easier CSS. * Update Freereader with the ability to configure the site title and subtitle, and fix the translation support. User-facing core change highlights: * Improve MP3 filtering. * Add The Filtered Index to the default bookmark list. * Fix handling of filenames with non-ASCII spaces. * Alphabetize language configuration dropdown. * Add Hungarian translation support. The translation was added previously but not actually available. * Fix dropping low-traffic connections. This helps with simulations. * Optimize FProxy CSS load order, and fix bugs which prevented caching static assets. This improves web interface responsiveness.
fr: Freenet 0.7.5 version 1473 est maintenant proposé. C’est la première version à exiger Java 7 ! Bouncy Castle est mis à niveau vers la version 1.54, et ajoute une traduction en chinois traditionnel au programme d’installation pour Windows. Mis à jour de greffons : * Ajout de Sharesite - un dérivé de ShareWiki - comme greffon officiel. Merci à ArneBab de l’avoir préparé ! Une version antérieure de TextileJ est incluse afin d’éviter les problèmes de licence, et ajoute une aide syntaxique, la prise en charge des liens actifs externes, ainsi qu’un modèle avec des ID div pour faciliter les feuilles de style en cascade. * Mise à jour de Freereader avec la possibilité de configurer le titre et le sous-titre du site. Correctif de la prise en charge des traductions. Points saillants des changements fondamentaux pour l’utilisateur : * Amélioration du filtrage MP3. * Ajout de l’index filtré à la liste des marque-pages par défaut. * Correctif de la gestion des noms de fichiers contenant des espaces non-ASCII. * Menu déroulant alphabétisé de la configuration des langues. * Ajout de la prise en charge de la traduction en hongrois. La traduction avait été ajoutée précédemment, mais n’était en fait pas proposée. * Correctif de l’abandon des connexions à trafic restreint. Cela aide aux simulations. * Optimisation de l’ordre de chargement des feuilles de style en cascade de FProxy, et correctif de bogues qui empêchaient la mise en cache d’actifs statiques. La réactivité de l’interface Web s’en trouve améliorée.

source: 2016-05-03 - DuckDuckGo donated $25,000
fr: 2016-05-03 - DuckDuckGo a fait un don de 25 000 $

source: The Freenet Project is very excited to announce that [DuckDuckGo have donated][ddg_url] $25,000 to our project. This new funding will be used to advance our goal of ensuring true freedom of communication on the Internet. The project has always operated in a democratic manner, and we will use an open process to set priorities for how we allocate this funding, which will incorporate the views of Freenet’s users, developers, and supporters.
fr: Le Projet Freenet est très heureux d’annoncer que [DuckDuckGo a fait un don][ddg_url] de 25 000 $ à notre projet. Ce nouveau financement sera utilisé pour faire avancer notre objectif de garantir une réelle liberté de communication sur Internet. Le projet a toujours fonctionné démocratiquement, et nous ferons appel à un processus ouvert afin de définir les priorités qui nous amèneront à répartir ce financement, tout en prenant en compte les opinions des utilisateurs, des développeurs et des partisans de Freenet.

source: 2016-04-10 - Freenet testing build 1473-pre1 released
fr: 2016-04-10 - Parution de Freenet version de test 1473-pre1

source: Freenet unstable testing prerelease build 1473-pre1 is now available. It's the first build to require Java 7. Highlights: * Add The Filtered Index to the default bookmark list * Improve MP3 filter stability * Fix binary blob download over FCP * Fix handling of filenames with non-ASCII spaces For more details and information on how to test this release see the [development mailing list thread][devl_thread].
fr: La préversion instable de test Freenet 1473-pre1 est maintenant proposée. C’est la première version à exiger Java 7. Points saillants : * Ajout de l’index filtré à la liste des marque-pages par défaut * Amélioration de la stabilité du filtre MP3 * Correctif du téléchargement d’un grand objet binaire par FCP * Correctif de la gestion des noms de fichiers contenant des espaces non-ASCII Pour plus de détails et d’informations sur la procédure à suivre pour tester cette version, consulter le [fil de la liste de diffusion de développement][devl_thread].

source: 2016-03-19 - Freenet 0.7.5 build 1472 released
fr: 2016-03-19 - Parution de Freenet 0.7.5 version 1472

source: This is the last build to support Java 6! The next build will require Java 7 or higher. Nodes running Java 7 or higher and using the official update key will now use a new update key. Nodes on Java 6 remain using the old update key and will not be updated to further builds. Thanks to yadevel for fixing the regression this release was blocking on! This version was initially partially released as build 1471 - it was released on GitHub but not offered from the website or auto-update. Build 1472 fixes a bug which when using Java 6 prevented nodes from starting for the first time. It did not break existing installations. Highlights: - Fix uploads stalling when using MAXIMUM physical security. - Fix lots of "setNativePriority(X) has failed!", which was caused by a serious thread priority problem. This might fix nodes unexpectedly losing peers. - Order alerts within a category by time: if you have lots of messages from darknet peers they will remain nicely sorted. - There is now a [caching layer][caching] which should significantly reduce I/O load. - Update WebOfTrust from build 15 to build 18. [Its][wot16] [changelogs][wot17] [are][wot18] separate, but the changes reduce CPU load. Incremental score recomputation requires roughly 3 percent of the time of full recomputation, and queuing trust lists to disk lowers thread usage. Translations: - Add partial Greek translation. - Update German, Bokmål, Brazilian Portuguese, Simplified Chinese, and Traditional Chinese translations. - Fix Bokmål localization loading. Also: - Remove Gantros Index from the default bookmark list because it stopped updating. - Remove Linkageddon from the default bookmark list because it stopped updating. - New version of UPnP to fix some instability and compatibility problems. Thanks to 007pig we have a [new UPnP plugin][upnp2] in development which supports UPnP2, but it is not yet included. - New version of KeyUtils. WebOfTrust now has an updatable testing version built and maintained by xor. To use it, unload WebOfTrust, then load "WebOfTrust Testing Versions" on the Plugins page. Versions built by xor will not work with Java 6. Sites can set favicons with `<link rel="icon" type=... href=...>`. (`type` could be `"image/x-icon"`) Extensive review and improvement of English source strings and French and Spanish translations. Tests for and fixes of value substitution in translations. Thanks Vaughan Woodzell! The default theme is now sky-static instead of clean-dropdown. This looks less outdated, though not modern. Fix default bookmarks missing the "software" category since build 1470. If you don't see this category please re-add the default bookmark set from the bookmark editing page. IpToCountry database is updated. (This allows providing the country flags on the peers pages. It is local to each instance and does not contact an external service.) Add partial CSS3 support, including viewport lengths. Thanks, Ben Green!
fr: C’est la dernière version à accepter Java 6 ! La prochaine version exigera Java 7 ou ultérieure. Les nœuds fonctionnant sous Java 7 ou ultérieure, et utilisant la clé officielle de mise à jour utiliseront dorénavant une nouvelle clé de mise à jour. Les nœuds fonctionnant sous Java 6 continueront à utiliser l’ancienne clé et ne seront pas mis à jour vers les versions ultérieures. Merci à yadevel d’avoir corrigé la régression qui bloquait cette version ! Cette version est d’abord parue partiellement en tant que version 1471 - elle était proposée sur GitHub, mais pas sur le site Web, ni par la mise à jour automatique. La version 1472 corrige un bogue qui affectait les nœuds fonctionnant sous Java 6 en les empêchant de démarrer la première fois. Ce bogue n’affectait pas les installations existantes. Points saillants : - Correction du blocage des téléversements en niveau de sécurité physique MAXIMAL. - Correction de nombreux « setNativePriority(X) a échoué ! », qui étaient causés par un sérieux problème de fils d’exécution. Cela pourrait corriger la perte inattendue de pairs par les nœuds. - Tri chronologique des alertes d’une catégorie : si vous avez de nombreux messages provenant de pairs du réseau invisible, ils resteront bien rangés. - Il existe maintenant [une couche de cache][caching] qui devrait réduire considérablement la charge E/S. - Mise à jour de la toile de confiance « WebOfTrust » de la version 15 à la version 18. [Ses][wot16] [journaux de changements][wot17] [sont][wot18] séparés, mais les changements réduisent la charge de l’UCT. Le recalcul incrémentiel des scores prend environ 3 pour cent de la durée d’un recalcul complet, et la mise en attente des listes de confiance vers le disque réduit l’utilisation des fils d’exécution. Traductions : - Ajout d’une traduction partielle en grec . - Mise à jour des traductions en allemand, bokmål, portugais brésilien, chinois simplifié et chinois traditionnel. - Correction du chargement des paramètres régionaux bokmål. Aussi : - Retrait de l’index Gantros de la liste par défaut de marque-pages, car il a cessé de se mettre à jour. - Retrait de Linkageddon de la liste par défaut de marque-pages, car il a cessé de se mettre à jour. - Nouvelle version d’UPnP pour corriger certains problèmes d’instabilité et de compatibilité. Grâce à 007pig, un [nouveau greffon UPnP][upnp2] est en cours de développement, greffon qui prend en charge UPnP2, mais qui n’est pas encore inclus. - Nouvelle version d’UtilClé. La toile de confiance « WebOfTrust » propose maintenant une version de test pouvant être mise à jour, version compilée et maintenue par xor. Pour l’utiliser, décharger la toile de confiance « WebOfTrust », puis charger « Versions de test de WebOfTrust » sur la page des greffons. Les versions compilées par xor ne fonctionneront pas avec Java 6. Les sites peuvent définir des favoricônes avec `<link rel="icon" type=... href=...>`. (`type` peut être `"image/x-icon"`) Révision approfondie et amélioration des chaînes sources en anglais, ainsi que des traductions en français et en espagnol. Test et correction des valeurs de substitution dans les traductions. Merci à Vaughan Woodzell ! Le thème par défaut est maintenant « sky-static » au lieu de « clean-dropdown ». L’apparence est moins surannée, bien qu’elle ne soit pas moderne. Correction de l’absence de la catégorie « Logiciels » des marque-pages par défaut depuis la version 1470. Si vous ne voyez pas cette catégorie, veuillez ajouter de nouveau l’ensemble de marque-pages par défaut dans la page de modifications des marque-pages. La base de données IpToCountry a été mise à jour. (Cela permet d’afficher les drapeaux nationaux sur les pages des pairs. Elle est stockée localement et ne se contacte pas à un service externe). Ajout de la prise en charge partielle de CSS3, incluant la longueur des fenêtres d’affichage. Merci à Ben Green !

source: 2016-01-03 - Testing release build 1471-pre3
fr: 2016-01-03 - Version de test 1471-pre3
