Repository: hyphanet/website
Catalog: locales/*/LC_MESSAGES/freenet_site.po
Languages: fr

source: First of all, we **strongly** suggest that you install Freenet inside an encrypted drive using, for example, [Truecrypt](http://www.truecrypt.org/). It is not possible for Freenet to prevent all leaks of private data, especially if you download media files etc. Even if you only browse freesites and use the chat plugins, there will still be potentially incriminating data in your swapfile, which needs to be encrypted (on recent versions of Windows you could try the command "fsutil behavior set encryptpagingfile 1", but really the solution is to encrypt your whole system including swap). It is also essential that you use your web browser in privacy mode, or with cache and history turned off; we try to do this if you launch Freenet via the rabbit icon, but there are no guarantees as unfortunately this functionality seems buggy in current web browsers. Browser plugins could also be a problem, and you should use a separate browser for Freenet if in any doubt. Be careful with the files you download from Freenet - not only could anyone seizing your computer see you have them (media files are likely to be written to disk even if you open them directly in your web browser and never save them), but also they could contain threats to anonymity themselves, such as calling back to a malicious website etc; this is possible in for instance PDFs and some video formats. Freenet tries to warn you about this when it can't filter out such malicious content: Currently it can only filter HTML pages, GIF/PNG/JPEG images and CSS, and MP3s, but we will add support for Ogg soon and other formats later. And of course there are many other threats - you should take standard security precautions, such as not running operating systems that are no longer updated, not running software not from a trustworthy source, using appropriate security software etc (if you have a firewall make sure it allows the two UDP ports Freenet needs through). Because not all users will have installed encrypted drives at the time when they first install Freenet, Freenet itself attempts to encrypt all the potentially incriminating data that it stores on disk. Details are below but as explained, leaks are inevitable: you really should [encrypt your disks!]( http://www.truecrypt.org/)
fr: Avant tout, nous vous recommandons **fortement** d’installer Freenet sur un disque chiffré, par exemple [Truecrypt](http://www.truecrypt.org/). Freenet ne peut pas empêcher toutes les fuites des données confidentielles, particulièrement si vous téléchargez des fichiers de contenu multimédia, etc. Même si vous ne faites que parcourir des sitesFree et utiliser les greffons de clavardage, des données potentiellement incriminantes pourraient encore se trouver dans votre fichier d’échange, qu’il est nécessaire de chiffrer (sur les versions récentes de Windows, vous pourriez essayer la commande « fsutil behavior set encryptpagingfile 1 », mais la solution est vraiment de chiffrer tout votre système, fichier d’échange inclus). Il est aussi essentiel que vous utilisiez votre navigateur en mode privé, ou en désactivant le cache et l’historique ; nous essayons de le faire si vous lancez Freenet avec l’icône de lapin, mais il n’y a aucune garantie, car cette fonction semble boguée dans les navigateurs actuels. Les greffons des navigateurs pourraient aussi causer des problèmes, et si vous avez des doutes, vous devriez utiliser un navigateur séparé pour Freenet. Faites attention aux fichiers que vous téléchargez de Freenet - non seulement quelqu’un qui saisirait votre ordinateur pourrait les voir (les fichiers de contenu multimédia seront probablement écrits sur le disque même si vous les ouvrez directement dans votre navigateur et vous ne les enregistrez jamais), mais ils pourraient aussi contenir des menaces à votre anonymat, par exemple en rappelant un site malveillant, etc. ; cela est possible avec les PDF et certains formats vidéo. Freenet essaie de vous en avertir quand il ne peut pas filtrer de tels contenus malveillants : il ne peut actuellement filtrer que les pages HTML, les images GIF/PNG/JPEG, les feuilles de style CSS et les MP3, mais prendra aussi les Ogg en charge bientôt, et d’autres formats ultérieurement. Et il y a bien sûr de nombreuses autres menaces - vous devriez prendre les mesures habituelles de sécurité, telles que de ne pas utiliser des systèmes d’exploitation qui ne sont plus mis à jour, ne pas utiliser des logiciels ne provenant pas d’une source fiable, utiliser des logiciels de sécurité adéquats, etc. (si vous avez un pare-feu, assurez-vous qu’il autorise les deux ports UDP par lesquels Freenet s’achemine). Comme tous les utilisateurs n’auront pas installé des disques chiffrés lors de la première installation de Freenet, Freenet essaiera de chiffrer toutes les données potentiellement incriminantes qu’il stocke sur le disque. Les détails se trouvent ci-dessous, mais comme expliqué, les fuites sont inévitables : vous devriez vraiment [chiffrer vos disques !](http://www.truecrypt.org/)

source: The main datastore does not store data you request or insert (or that is requested or inserted by nearby nodes), because it can be probed by other nodes: This was introduced to fix [this attack]( http://www.theregister.co.uk/2005/05/13/freener_not_so_anonymous/) publicised by The Register. Freenet has a separate client-cache, which stores data which you have recently requested to avoid having to go back to the network every time (which would not only reduce speed but also security, by giving attackers more opportunities to see your requests). Also, Freenet stores the list of your downloads and uploads (which you can see on the Filesharing menu), their current progress, and various other data, in the file node.db4o (or node.db4o.crypt). The actual data is kept in the persistent-temp-* directory. Unless you set the physical security level to LOW, this data is encrypted. At MAXIMUM, the encryption keys are never written to disk, so the data is effectively wiped on restarting the node; otherwise the encryption keys are stored in a file called master.keys (on HIGH this is passworded). You can wipe the data by either using the panic button on the downloads/uploads page or by securely deleting master.keys. Freenet also creates temporary files for other requests, which are also encrypted unless physical seclevel is LOW, which are in temp-*. Also, some plugins may create their own data files, which may contain for instance messages you have posted or downloaded from chat forums, and currently bookmarks and recently completed files are stored in plain text. It is our intention to move these into node.db4o or store them in separate encrypted databases, as soon as we have automatic backups for node.db4o. See [here]( https://wiki.freenetproject.org/Program_files) for details on some of the files.
fr: Le magasin de données principal ne stocke pas les données que vous demandez ou insérez (ou qui sont demandées ou insérées par les nœuds à proximité), car il peut être sondé par les autres nœuds : cela a été mis en place pour corriger [cette attaque]( http://www.theregister.co.uk/2005/05/13/freener_not_so_anonymous/) publiée par « The Register ». Freenet a un cache client séparé qui stocke les données qui ont été demandées récemment afin d’éviter d’avoir à retourner au réseau à chaque fois (ce qui réduirait la vitesse, mais aussi la sécurité en donnant aux attaquants plus de possibilités de voir vos requêtes). De plus, Freenet stocke la liste de vos téléchargements et téléversements (que vous pouvez voir sur le menu Partage de fichiers), leur progression actuelle et autres données diverses dans le fichier node.db4o (ou node.db4o.crypt). Les données mêmes sont conservées dans le répertoire persistent-temp-*. À moins que vous ne définissiez le niveau de sécurité physique à FAIBLE, ces données sont chiffrées. À MAXIMAL, les clés de chiffrement ne sont jamais écrites sur le disque, afin que les données soient supprimées efficacement lors du redémarrage du nœud ; autrement les clés de chiffrement sont stockées dans un fichier appelé master.keys (qui est protégé par mot de passe avec le niveau ÉLEVÉ). Vous pouvez supprimer les données en utilisant le bouton d’urgence sur la page des téléchargements/téléversements, ou en supprimant de manière sûre master.keys. Freenet crée aussi des fichiers temporaires pour les autres requêtes, qui sont aussi chiffrés à moins que le niveau de sécurité physique ne soit défini à FAIBLE, et qui sont dans temp-*. Par ailleurs, certains greffons pourraient créer leurs propres fichiers de données, qui pourraient par exemple contenir des messages que vous avez publiés ou téléchargés de forums de clavardage, et actuellement, les marque-pages et les fichiers terminés récemment sont en texte en clair. Nous avons l’intention de les déplacer dans node.db4o ou de les stocker dans des bases de données chiffrées séparées dès que nous aurons des sauvegardes automatiques de node.db4o. Voir [ici]( https://wiki.freenetproject.org/Program_files) les détails de certains de fichiers.

source: Windows SmartScreen filter warns the Freenet installer might put my PC at risk. What's going on?
fr: Le filtre SmartScreen de Windows m’avertit que le programme d’installation de Freenet pourrait nuire à la sécurité de mon ordinateur. Que se passe-t-il ?

source: [SmartScreen][url_smartscreen] is sometimes incorrect in classifying a file as dangerous. We believe our installer is not infected with malicious software, and if you are a developer you can check the installer source code [here][url_installer].
fr: [SmartScreen][url_smartscreen] désigne parfois un fichier comme dangereux de manière erronée. Nous croyons que notre programme d’installation n’est pas infecté par un programme malveillant, et si vous êtes un développeur, vous pouvez en vérifier le code source [ici][url_installer].

source: Has anyone ever faced legal trouble for their anonymous activities conducted on Freenet?
fr: Quelqu’un a-t-il déjà été confronté à des problèmes juridiques pour ses activités anonymes menées sur Freenet ?

source: Yes. There is one such instance that we know of. United States law enforcement can identify anonymous users of [Freenet][f] and [Tor][t]. Without further information we do not know how they did this, but we suspect it affects people using the network security level "normal" or lower. It is reasonable to assume that other governments have access to the same technology, which is provided by private contractors. If you are concerned about governments, you should use Freenet's capacity to connect only to users you trust, ("high" network security level or higher) and bear in mind that no anonymity technology provides perfect protection. While we applaud law enforcement's apparent success in apprehending suspects allegedly sharing child abuse images, any security flaws they may have used are not limited to such noble usage. Many governments persecute and prosecute political dissidents for legitimate speech published online. Therefore we hope to discover and fix these flaws to protect those who fight for human rights, against corruption, for a peaceful future, and for other legitimate goals.
fr: Oui. Nous connaissons un cas. Les forces de l’ordre étatsuniennes peuvent identifier les utilisateurs anonymes de [Freenet][f] et de [Tor][t]. Sans de plus amples informations, nous ne savons pas comment ils l’ont fait, mais nous supposons que cela affecte les personnes utilisant le niveau de sécurité réseau « normal » ou inférieur. Il est raisonnable de présumer que d’autres gouvernements ont accès à la même technologie, technologie fournie par des entrepreneurs privés. Si les gouvernements vous inquiètent, vous devriez utiliser la capacité de Freenet de se connecter seulement aux utilisateurs en qui vous avez confiance (niveau de sécurité réseau « élevé » ou supérieur), et garder à l’esprit qu’aucune technologie d’anonymisation ne fournit de protection parfaite. Bien que nous félicitions le succès apparent des organismes d’application de la loi dans l’arrestation de personnes soupçonnées d’avoir partagé des images d’abus pédosexuels, les failles de sécurité qu’ils ont pu utiliser ne se limitent pas à une utilisation aussi noble. De nombreux gouvernements persécutent et poursuivent des dissidents politiques pour du contenu légitime publié en ligne. C’est pourquoi nous espérons découvrir et corriger ces failles afin de protéger ceux qui se battent pour les droits de la personne, contre la corruption, pour un futur de paix, et pour nos objectifs légitimes.

source: ### Additional information sources * [Wiki FAQ page][url_wiki] * [Security summary][url_security] * [High quality copy of the rabbit icon][url_rabbit_icon]
fr: ### Les sources complémentaires d’information * [FAQ du wiki][url_wiki] * [Résumé sur la sécurité][url_security] * [Version de grande qualité de l’icône de lapin][url_rabbit_icon]

source: Mailing lists
fr: Listes de diffusion

source: These are the mailing lists that can be used for support or general information about Freenet.
fr: Voici les listes de diffusion qui peuvent être utilisées pour de l’assistance ou des informations générales sur Freenet.

source: ### Subscribing To subscribe to one of the lists, click the list name and give your email address in the field below the **Subscribing to < mailinglist >** header. To enter a password is optional, and if you do not enter one, one will be automatically generated for you. Then press the **Subscribe** button. You will receive a confirmation email, and when that is answered, you will receive mails from the list.
fr: ### Abonnement Pour s’abonner à l’une des listes, cliquez sur le nom de la liste et donnez votre adresse courriel dans le champ sous l’en-tête **Subscribing to < mailinglist >**. Vous pouvez saisir un mot de passe (facultatif), et si vous n’en saisissez aucun, il sera généré automatiquement pour vous. Appuyez ensuite sur le bouton **Subscribe**. Vous recevrez un courriel de confirmation, et quand vous y aurez répondu, vous recevrez des courriels de la liste.

source: ### Unsubscribing To unsubscribe to one of the lists you are subscribed to, click the list name and give your subscription email address under the heading **< mailinglist > Subscribers** and press the button **Unsubscribe or edit options**. _**Note**: We constantly get requests of people who want to become unsubscribed._ **YOU** _have to do that yourself! Just click on the www link provided at the bottom of every mail, enter your e-mail address in the text field in section "Subscribers" and provide your password under the unsubscribe option. (You can get your password there as well, in case you forgot it.)_
fr: ### Se désabonner Pour se désabonner d’une des listes auxquelles vous êtes abonnés, cliquer sur le nom de liste, donner l’adresse courriel d’abonnement sous l’en-tête **< mailinglist > Abonnés** et cliquer sur le bouton **Se désabonner ou modifier les options**. _**Note** : nous recevons constamment des demandes de personnes qui veulent se désabonner._ **VOUS** _devez le faire vous-même ! Il suffit de cliquer sur le lien www indiqué en bas de chaque courriel, de saisir votre adresse courriel dans la zone texte de la section « Abonnés », et de fournir votre mot de passe sous l’option Se désabonner. (Vous pouvez aussi y obtenir votre mot de passe, au cas où vous l’auriez oublié.)_

source: ### The lists * [Support](https://emu.freenetproject.org/cgi-bin/mailman/listinfo/support/) ([archive](https://emu.freenetproject.org/pipermail/support/))<br/> Asking for or giving advice relating to getting Freenet working, bug reports, and suggestions on improving the user experience. Requests for help are more likely to be heard here than in the other mailing lists. **Note**: Emails sent to this mailing list from those not subscribed to the list must be manually approved, and this can impose a delay of several days. To avoid this delay, please [subscribe](https://emu.freenetproject.org/cgi-bin/mailman/listinfo/support/). * [Development](https://emu.freenetproject.org/cgi-bin/mailman/listinfo/devl/) ([archive](https://emu.freenetproject.org/pipermail/devl/))<br/> This list is for active developers to discuss bugs, and the implementation of near-term new features. _**Third party tools**: We are hosting some other mailing lists on our server. Here is the [full list][url_listinfo]._
fr: ### Les listes * [Assistance](https://emu.freenetproject.org/cgi-bin/mailman/listinfo/support/) ([archive](https://emu.freenetproject.org/pipermail/support/))<br/> Demander ou recevoir des conseils en rapport avec le fonctionnement de Freenet, les rapports de bogues, ou des suggestions sur l’amélioration de l’expérience utilisateur. Il y a plus de chances que les demandes d’assistance trouvent une réponse ici plutôt que sur les autres listes de diffusion. **Note** : les courriels envoyés à cette liste de diffusion par ceux qui n’y sont pas abonnés doivent être approuvés manuellement, et cela peut imposer un retard de plusieurs jours. Pour éviter ce retard, veuillez vous [abonner](https://emu.freenetproject.org/cgi-bin/mailman/listinfo/support/). * [Développement](https://emu.freenetproject.org/cgi-bin/mailman/listinfo/devl/) ([archive](https://emu.freenetproject.org/pipermail/devl/))<br/> Sur cette liste, les développeurs actifs peuvent discuter de bogues et de la mise en œuvre à très court terme de nouvelles fonctions. _**Outils tiers** : nous hébergeons d’autres listes de diffusion sur notre serveur. Voici la [liste complète][url_listinfo]._

source: Get Support
fr: Obtenir du soutien

source: If you need help installing Freenet for the first time, or have trouble using Freenet and can't find an answer to your problem in the [FAQ][faq_link] above or in the [Knowledge Base][kb_link], please create a new discussion on our support forum. When writing your support request, please make sure you include a full description of the problem, your current version of Java, your operating system and current Freenet version.
fr: Si vous avez besoin d’aide pour installer Freenet une première fois, ou si éprouvez des difficultés lors de l’utilisation de Freenet et ne trouvez aucune réponse à votre problème dans la [FAQ][faq_link] ci-dessus ou dans la [base de connaissances][kb_link], veuillez créer une nouvelle discussion de soutien dans notre forum de soutien. En rédigeant votre demande de soutien, veuillez vous assurer d’inclure une description exhaustive de votre problème, votre version actuelle de Java, votre système d’exploitation et votre version actuelle de Freenet.

source: Create a support discussion
fr: Créer une discussion de soutien

source: Chat with us
fr: Clavarder avec nous

source: Many of the developers and users of Freenet are on the [IRC]( https://en.wikipedia.org/wiki/IRC) channel #freenet on chat.freenode.net.
fr: De nombreux développeurs et utilisateurs de Freenet se trouvent sur le canal [IRC](https://en.wikipedia.org/wiki/IRC) #freenet sur chat.freenode.net.

source: Setup
fr: Configuration

source: Help
fr: Assistance

source: Leap over censorship<br> Escape total surveillance
fr: Contourner la censure<br> Échapper à la surveillance totale

source: Freenet is a peer-to-peer platform for censorship-resistant communication and publishing. Browse websites, post on forums, and publish files within Freenet with strong privacy protections.
fr: Freenet est une plateforme pair à pair de communication et de publication qui résistent à la censure. Parcourir des sites Web, participer à des forums et publier des fichiers, Freenet vous le permet avec une protection robuste de vos données personnelles.

source: read more…
fr: en apprendre plus…

source: Help keep Internet freedom alive and expand human liberty! Support another year of paid development. [Learn more about our fundraiser.][url_fundraiser]
fr: Aidez à préserver la liberté sur Internet tout en promulguant la liberté humaine ! Soutenez une autre année de développement payé. [Apprenez-en davantage sur notre campagne de financement.][url_fundraiser]

source: Donate!
fr: Faire un don !

source: The Freenet Project Inc is a non-profit 501(c)(3) organization.
fr: « The Freenet Project Inc » est un organisme sans but lucratif 501(c)(3).

source: Donations are tax-deductible.
fr: Les dons sont déductibles du revenu imposable.

source: Secret Identity
fr: Identité secrète

source: Create a secret identity so nobody knows who you are.
fr: Créez une identité secrète afin que personne ne sache qui vous êtes.

source: Browse Websites
fr: Parcourir des sites Web

source: Freenet is home to sites ranging from programming to sustainable living.
fr: Freenet accueille des sites allant de la programmation aux modes de vie durable.

source: Ask questions and exchange ideas.
fr: Posez des questions et échangez des idées.

source: Publish
fr: Publier

source: Publish anonymously without need for a server.
fr: Publiez anonymement sans avoir besoin d’un serveur.

source: Share Files
fr: Partager des fichiers

source: Easy upload & download.
fr: Téléversements et téléchargements facilités.

source: Platform
fr: Plateforme

source: Write your own applications on the Freenet platform.
fr: Écrivez vos propres applications sur la plateforme Freenet.

source: Resistant
fr: Résistant

source: Freenet has been designed to be resistant to attacks and censorship.
fr: Freenet a été conçu pour être résistant aux attaques et à la censure.

source: Distributed
fr: Distribué

source: No central points of failure, efficient caching of popular content.
fr: Aucun point central de défaillance, mise en cache efficace du contenu populaire.

source: Proven
fr: Éprouvé

source: Based on solid research and in practical use for 15 years.
fr: Reposant sur une recherche solide et utilisé depuis 15 ans.

source: Share, Chat, Browse. Anonymously.
fr: Partager, clavarder, naviguer. Anonymement.

source: Latest News
fr: Dernières nouvelles

source: Overview
fr: Vue d’ensemble

source: Donate today.
fr: Faire un don aujourd’hui.

source: 2016-06-25 - Freenet build 1475 released
fr: 2016-06-25 - Parution de Freenet version 1475

source: (This news item was not published until July 16th. Sorry for the delay.) Freenet 0.7.5 build 1475 is now available. Build 1474 was an emergency release which [fixed a denial of service attack][announcement1474] which prevented the node from processing other requests after processing a malicious request. This build contains the months of work which were not included in the emergency release. It will become mandatory on July 15th. Highlights: - Warn that Java 7 is End of Life. (Please update!) - Improve load balancing. - Add support for HTML5 audio tags. - Fix a major bug that might explain the poor connectivity since 1473. For more details see the [announcement email][announcement1475].
fr: (Cet article n’a pas été publié avant le 16 juillet. Désolé du retard.) Freenet 0.7.5 version 1475 est maintenant proposé. La version 1474 était une version d’urgence [corrigeant une attaque par déni de service][announcement1474] qui empêchait aux nœuds de traiter les autres requêtes avoir traité une requête malveillante. Cette version contient les mois de travail qui n’avaient pas été inclus dans la version d’urgence. Elle deviendra obligatoire à partir du 15 juillet. Points saillants : - Avertir que Java 7 est en fin de vie (Veuillez mettre à jour !) - Améliorer l’équilibrage de charge. - Ajouter la prise en charge des balises audio HTML5. - Corriger un bogue majeur qui pourrait expliquer la mauvaise connectivité depuis 1473. Pour plus de détails , consultez le [courriel d’annonce][announcement1475].

source: 2016-05-26 - Police department's tracking efforts based on false statistics
fr: 2016-05-26 - Un service de police publie ses efforts de pistage, fondés sur de fausses statistiques
