Repository: hyphanet/website
Catalog: locales/*/LC_MESSAGES/freenet_site.po
Languages: fr

source: How do I use this software? I downloaded it, but when I run it there's no GUI.
fr: Comment utiliser ce logiciel ? Je l’ai téléchargé, mais quand je l’exécute, il n’y a pas d’interface graphique.

source: Fred (the Freenet REference Daemon) runs as a daemon, or service, in the background. You normally talk to it through a Freenet client. One built-in client is fproxy, which lets you talk to Freenet with a web browser. Freenet should have installed a Browse Freenet shortcut on the desktop and/or the start menu, or a system tray icon (rabbit) with an Open Freenet menu item. Failing that, point your web browser to [http://127.0.0.1:8888/]( http://127.0.0.1:8888/) for the gateway page. Try clicking the various links in the bookmark list to reach an initial set of sites.
fr: Fred, le démon de référence de Freenet (Freenet REference Daemon) s’exécute comme démon ou service, en arrière-plan. Vous lui parlez habituellement grâce à un client Freenet. fproxy, un client intégré vous laisse parler à Freenet avec un navigateur Web. Freenet devrait avoir installé un raccourci « Parcourir Freenet » sur le bureau ou dans le menu démarrer, ou une icône dans la zone de notification (un lapin) proposant un élément de menu « Ouvrir Freenet ». Si ce n’est pas le cas, rendez-vous à [http://127.0.0.1:8888/]( http://127.0.0.1:8888/) avec votre navigateur afin d’obtenir la page d’accès. Essayez de cliquer sur les divers liens de la liste de marque-pages pour atteindre un premier ensemble de sites.

source: Why is Freenet so slow?
fr: Pourquoi Freenet est-il si lent ?

source: When you first install Freenet, it will be slow, and you may see Data Not Found or Route Not Found errors for freesites. This is normal, and Freenet will speed up significantly over time. For best performance you should try to run Freenet as close to 24 hours a day as possible. This is why we install Freenet as a service. Please bear in mind that Freenet is inherently high latency: it can take a while to (for example) load a page for the first time, even if it is capable of reasonable speeds (as anonymous systems go!) for large popular files. You can also improve performance for freesite browsing by using a separate browser and [increasing its connection limit](#connections). You should also set the datastore size and bandwidth limit as high as possible. But protecting your anonymity does cost a certain amount of performance. You can configure how much to a degree by changing the security levels on the page under Configuration.
fr: Après une première installation, Freenet sera lent et l’affichage de sitesFree pourrait retourner des erreurs « Data Not Found » (données introuvables) ou « Route Not Found » (route introuvable). Cela est normal, et Freenet accélérera grandement avec le temps. Pour des performances optimales, vous devriez essayer autant que possible d’exécuter Freenet en continu. C’est pourquoi nous installons Freenet en tant que service. Veuillez garder à l’esprit qu’une latence élevée est inhérente à Freenet. Par exemple, le chargement initial d’une page peut prendre du temps, même si Freenet est capable de vitesses acceptables (pour un système anonyme !) pour les gros fichiers populaires. Vous pouvez aussi améliorer les performances de navigation des sitesFree en utilisant un navigateur séparé et en [augmentant ses limites de connexion](#connections). Si possible, vous devriez aussi définir un magasin de données de grande taille et une limite de bande passante élevée. Toutefois, la protection de votre anonymat a un coût en matière de performances. Dans une certaine mesure, vous pouvez déterminer ce coût en changeant les niveaux de sécurité dans la page Configuration.

source: Is Freenet searchable?
fr: Peut-on effectuer des recherches dans Freenet ?

source: Yes, there are a few different search mechanisms. To search the Freenet web (freesites), you should be able to just use the search box on the homepage, or go to Search Freenet on the Browse submenu. If it's not there, go to the Plugins page under Configuration, and load the Library plugin. Alternatively, Frost and Thaw also provide searching for messages and files. Note that searching on Freenet is a good deal more difficult than on other networks because of Freenet's different architecture and design goals.
fr: Oui, il existe quelques mécanismes de recherche différents. Pour effectuer une recherche dans la toile Freenet (sitesFree), vous devriez pouvoir simplement utiliser la boîte de recherche de l’accueil, ou Rechercher dans Freenet du sous-menu Parcourir. Si vous ne le trouvez pas, rendez-vous à la page Greffons, sous Configuration, et chargez le greffon Bibliothèque. Par ailleurs, Frost et Thaw proposent aussi une recherche des messages et des fichiers. Il est à noter qu’il est bien plus difficile de chercher sur Freenet que sur d’autres réseaux, à cause de l’architecture différente de Freenet et des objectifs de conception.

source: How do I get Freenet working with a Firewall/NAT?
fr: Comment puis-je faire fonctionner Freenet avec un pare-feu/une traduction d’adresses réseau ?

source: Mostly, Freenet should just work with a NAT. However, you should forward the ports manually if you can. Click on the [Connectivity]( http://127.0.0.1:8888/connectivity/) page. At the top you will see a list of ports used by the node. You should forward (for UDP) the Darknet FNP and Opennet FNP ports. You may need to look up your router's documentation to figure out how to do this. Freenet should have forwarded them itself through [Universal Plug and Play]( https://en.wikipedia.org/wiki/Universal_Plug_and_Play), but this doesn't always work (and it never works if you don't have the UPnP plugin loaded, or have one router behind another). If you have a dyndns address or other domain name pointing to the computer you run your Freenet node on, tell the node about it. Go to [the core settings config page](http://127.0.0.1:8888/config/node?mode=2) (in advanced mode), and find the option "IP address override". Put your domain name in that box, and apply the settings.
fr: Essentiellement, Freenet devrait juste fonctionner avec une traduction d’adresses réseau. Cependant, vous devriez réacheminer les ports manuellement si vous le pouvez. Cliquez sur la page [Connectivité](http://127.0.0.1:8888/connectivity/). En haut, vous trouverez une liste des ports utilisés par le nœud. Vous devriez réacheminer (pour UDP) les ports FNP - réseau invisible et FNP - réseau ouvert. Vous aurez peut-être à consulter la documentation de votre routeur pour trouver comment faire. Freenet devrait les avoir réacheminés grâce au [« Universal Plug and Play »]( https://fr.wikipedia.org/wiki/Universal_Plug_and_Play), mais cela ne fonctionne pas toujours (et ça ne fonctionne jamais si le greffon UPnP n’est pas chargé, ou si votre routeur est derrière un autre routeur). Si vous avez une adresse dyndns ou un nom de domaine qui renvoie vers l’ordinateur sur lequel vous exécutez votre nœud Freenet, informez-en le nœud. Allez à la [page de configuration des paramètres de base]( http://127.0.0.1:8888/config/node?mode=2) (dans le mode avancé), et trouvez l’option « Adresse IP forcée ». Saisissez votre adresse IP dans cette boîte et appliquez les paramètres.

source: Do I need a permanent Internet connection to run a node?
fr: Ai-je besoin d’une connexion Internet permanente pour faire fonctionner un nœud ?

source: No, but it is preferred. You can run the software and test it from a "transient" connection (e.g. dial up/mobile modem), but for the network as a whole to be most useful, we will need as many permanent nodes as possible ( most cable modem or DSL setups are sufficiently "permanent" for this). A later version of Freenet may take better advantage of transient nodes.
fr: Non, mais cela est préférable. Vous pouvez exécuter le logiciel et le tester à partir d’une connexion « transitoire » (p. ex. liaison commutée/modem mobile), mais pour que le réseau dans son ensemble soit le plus utile, nous aurons besoin d’autant de nœuds permanents que possible (la plupart des modems câble ou des configurations xDSL sont suffisamment « permanents » pour cela.) Une version ultérieure de Freenet tirera peut-être meilleur parti des nœuds transitoires.

source: Why does Freenet only download 1 or 2 files at a time?
fr: Pourquoi Freenet télécharge-t-il seulement 1 ou 2 fichiers à la fois ?

source: Many browsers limit the number of simultaneous connections to something far too low for efficiently browsing Freenet (since Freenet pages often have much higher latency than web pages). This can usually be reconfigured. For example, for Mozilla Firefox, type **about:config** in the address field of the browser and replace the value of the following settings to the one stated. Filter on **"connections"** to get only the relevant settings:
fr: De nombreux navigateurs limitent beaucoup trop le nombre de connexions simultanées pour pouvoir naviguer efficacement sur Freenet (puisque les pages Freenet ont souvent une latence bien plus élevée que les pages Web). Cela peut habituellement être reconfiguré. Par exemple, pour Firefox de Mozilla, saisissez « about:config » dans la barre d’adresse du navigateur, puis remplacez la valeur des paramètres suivants par celle indiquée. Recherchez « connections » pour afficher uniquement les paramètres pertinents :

source: Note that these settings will cause mozilla to use more connections for all your browsing, which may not be desirable from a network congestion point of view. But you should ideally be using a separate browser for Freenet anyway, for best security.
fr: Veuillez noter que ces paramètres obligeront Firefox de Mozilla à utiliser plus de connexions pour tout type de navigation, ce qui pourrait ne pas être souhaitable du point de vue de la congestion du réseau. Mais vous devriez de toute façon utiliser un navigateur séparé pour Freenet afin d’assurer une sécurité meilleure.

source: Why can't Freenet store data permanently?
fr: Pourquoi Freenet ne peut-il pas stocker les données de façon permanente ?

source: Because we can't find a way to do this without compromising Freenet's other goals. For example, people often suggest that someone's node could just never drop data they want to cache permanently. This, however, won't work because even if the data is still available on their node, there is no way to ensure that requests for that data will be routed to that node. We have considered many other ways that Freenet could store data permanently, but they either won't work, or compromise Freenet's core goals of anonymity, and scalability. Content which is popular should persist indefinitely, for example most freesites linked from the main indexes are still retrievable years later (at least their front pages are). If the content isn't very popular the best way to keep it available is to regularly re-insert (re-upload) it. An interesting option is the "Keepalive" plugin, which will do this for you - even if you didn't upload the file/site in the first place. Improvements are planned, such as a special kind of request that allows us to probe whether a file is available from a random point on the network.
fr: Parce que nous ne trouvons pas de façon de le faire sans compromettre les autres objectifs de Freenet. Par exemple, on nous suggère souvent que le nœud de quelqu’un pourrait juste ne jamais abandonner les données que cet utilisateur voudrait mettre en cache de façon permanente. Cela ne fonctionnerait cependant pas, car même si les données sont encore accessibles sur le nœud en question, il est impossible de garantir que si ces données étaient demandées, ces requêtes seraient acheminées vers ce nœud. Nous avons étudié bien d’autres possibilités qui permettraient à Freenet de stocker des données de manière permanente, mais soit elles ne fonctionneraient pas, soit elles compromettraient les objectifs de base de Freenet, à savoir l’anonymat et l’extensibilité. Un contenu populaire devrait persister indéfiniment. Par exemple, la plupart des sitesFree accessibles à partir des index principaux sont encore récupérables des années plus tard (du moins, leur page d’accueil l’est). Si le contenu n’est pas très populaire, la meilleure façon de le garder accessible est de le réinsérer (retéléverser). Une option intéressante est le greffon « keepalive » qui le fera pour vous, même si vous n’avez pas téléversé le fichier/site en premier lieu. Des améliorations sont prévues, telles qu’un type spécial de requête qui nous permettrait de vérifier si un fichier est accessible d’un point aléatoire sur le réseau.

source: Why is Freenet implemented in Java?
fr: Pourquoi Freenet est-il réalisé en Java ?

source: Opinions differ about the choice of Java for the reference implementation of Freenet (even among the core developers). [Ian Clarke](about.html#people) and several other developers are Java proponents and the choice for Java was made. Even if everybody could be convinced to switch to a different language reimplementing the current Freenet protocol would be quite a big task, and take up a significant amount of time, while there is only a limited amount of developer-time available. Flame wars on the development list about the language choice aren't welcome, people willing to implement Freenet in other languages however are very much encouraged to try. Don't underestimate the amount of work however.
fr: Les opinions divergent quant au choix de Java pour l’implémentation de référence de Freenet (même parmi les développeurs principaux). [Ian Clarke](about.html#people) et plusieurs autres développeurs sont des partisans de Java, et le choix de Java fut fait. Même si tout le monde pouvait être convaincu de changer pour un langage différent, la réécriture du protocole Freenet actuel serait une très grosse tâche et prendrait beaucoup de temps, alors que la quantité de temps de développement est limitée. Les fusillades sur la liste de diffusion de développement à propos du choix de langage ne sont pas les bienvenues. Toutefois, les personnes voulant implémenter Freenet en d’autres langages sont fortement encouragées à tenter l’expérience. Il ne faut cependant pas sous-estimer la quantité de travail.

source: How do I allow connections to FProxy from other computers?
fr: Comment puis-je autoriser des connexions à FProxy à partir d’autres ordinateurs ?

source: If you want everyone to be able to use your node you have the following options: * Go to the [web interface configuration page](http://127.0.0.1:8888/config/fproxy) and enable advanced mode * Stop your node and edit freenet.ini manually In both cases change the following parameters: `fproxy.bindTo=0.0.0.0 fproxy.allowedHosts=* ` Of course, this leaves your node wide open, unless you control access with a firewall of some sort. If you'd prefer to use access controls within Freenet, then you can use lines like this: `fproxy.bindTo=0.0.0.0 fproxy.allowedHosts=127.0.0.1,192.168.1.0/24 ` Or even (find your IP address from ipconfig/ifconfig/winipcfg and substitute it for 192.168.1.1): `fproxy.bindTo=127.0.0.1,192.168.1.1 fproxy.allowedHosts=127.0.0.1,192.168.1.0/24 ` And if you want to grant full access (i.e. change config settings, restart, etc) to the node (WARNING: Be very careful who you give full fproxy access to!): `fproxy.allowedHostsFullAccess=127.0.0.1,192.168.1.0/24 `
fr: Si vous voulez que tout le monde puisse utiliser votre nœud, les options suivantes s’offrent à vous : * Aller sur le [page de configuration de l’interface Web](http://127.0.0.1:8888/config/fproxy) et activer le mode avancé * Arrêter votre nœud et modifier manuellement freenet.ini Dans les deux cas, les paramètres suivants seront à modifier : `fproxy.bindTo=0.0.0.0 fproxy.allowedHosts=* ` Bien sûr, cela ouvrira complètement votre nœud, à moins que nous ne contrôliez l’accès par le biais de quelque pare-feu. Si vous préférez utiliser le contrôle d’accès intégré de Freenet, vous pouvez alors utiliser des lignes telles que : `fproxy.bindTo=0.0.0.0 fproxy.allowedHosts=127.0.0.1,192.168.1.0/24 ` Ou même (trouvez votre adresse IP avec ipconfig/ifconfig/winipcfg et substituez-la à 192.168.1.1) : `fproxy.bindTo=127.0.0.1,192.168.1.1 fproxy.allowedHosts=127.0.0.1,192.168.1.0/24 ` Et si vous voulez octroyer un accès complet (c.-à-d. modifier les paramètres de configuration, redémarrer, etc.) au nœud (AVERTISSEMENT : faites très attention à qui vous donner un accès complet à fproxy !) : `fproxy.allowedHostsFullAccess=127.0.0.1,192.168.1.0/24 `

source: What's new? Is there a changelog?
fr: Qu’y a-t-il de nouveau ? Y a-t-il un journal des changements ?

source: On every new build, a brief summary of all the main changes is posted to the support and devl lists and the eng.freenet board on Freetalk. This is usually relayed to FMS and Frost too. Alternatively, for a much more detailed view, check out the [git repositories](https://github.com/freenet/). Also, you should check the developer blogs (from the default bookmarks, or over the web, e.g. [toad](http://amphibian.dyndns.org/flogmirror/)), but be warned they are often not regularly updated and frequently go off on rants on unrelated topics!
fr: Pour chaque nouvelle version, un résumé de tous les changements principaux est publié dans les listes support et devl, et sur le tableau eng.freenet de Freetalk. Il est habituellement aussi relayé vers FMS et Frost. Autrement, pour un portrait beaucoup plus détaillé, rendez-vous sur les [dépôts Git](https://github.com/freenet/). Vous devriez aussi consulter les blogues des développeurs (à partir des marque-pages par défaut, ou par le Web, p. ex. [toad]( http://amphibian.dyndns.org/flogmirror/)), mais soyez averti que souvent ils ne sont pas mis à jour régulièrement et qu’ils présentent fréquemment de longues diatribes sur des sujets sans rapport !

source: Why are there so many messages in my logfile with a backtrace attached?
fr: Pourquoi y a-t-il tant de messages dans mon fichier journal avec une trace de débogage jointe ?

source: Freenet logs messages excessively during normal operation. It's something we're aware of and are working on.
fr: Freenet journalise des messages de façon excessive pendant un fonctionnement normal. Nous en sommes conscients et nous y travaillons.

source: I have Kaspersky anti-virus, and Freenet doesn't install, or shows "Download/upload queue database corrupted!"
fr: J’ai l’antivirus Kaspersky, et Freenet ne s’installe pas ou affiche « La base de données de la file d’attente de téléchargement/téléversement est corrompue ! »

source: Kaspersky can be a problem with Freenet. See [here][url_kaspersky]. We recommend you turn off Kaspersky during install and during node startup, and exclude the directory you installed Freenet in (most likely {freenet_install_dir_1} or {freenet_install_dir_2}).
fr: Kaspersky peut poser des problèmes avec Freenet. Voir [ici][url_kaspersky]. Nous vous recommandons d’arrêter Kaspersky pendant l’installation et pendant le démarrage du nœud, et aussi d’exclure le répertoire dans lequel Freenet est installé (vraisemblablement {freenet_install_dir_1} ou {freenet_install_dir_2}).

source: I set a password and now I forgot it, what can I do?
fr: J’ai oublié le mot de passe que j’avais défini, que puis-je faire ?

source: The password protects your downloads and uploads and the client-cache (cache of what you've recently browsed on Freenet). It is stored in the file master.keys. There is no way to recover the password, but if you forget it you can wipe your downloads and uploads and the client cache by securely deleting the file master.keys. See [the question on private data and local security](#privatedata) for more information.
fr: Le mot de passe protège vos téléchargements, vos téléversements et le cache du client (mise en cache de vos navigations récentes sur Freenet). Il est stocké dans le fichier master.keys. Il est impossible de récupérer le mot de passe, mais si vous l’oubliez, vous pouvez purger vos téléchargements, vos téléversements et le cache du client en supprimant de façon sécuritaire le fichier master.keys. Consulter [la question sur les données personnelles et la sécurité locale]( #privatedata) pour plus de détails.

source: Freenet keeps complaining about clock skew
fr: Freenet se plaint d’un décalage d’horloge

source: Freenet will have problems if your clock is constantly being rewound. Usually this happens when something is resetting your clock regularly in big jumps. On Linux, you should run ntpd to make sure your clock isn't too far off (this isn't vital but it's helpful), but if you see clock skew errors, try adding the -x option to it to avoid big backwards jumps. Also, running ntpdate on startup so there is one big jump before Freenet starts is a good idea. This can also happen on Windows sometimes, let us know how you managed to fix it ... generally it's not all that serious though, especially if big jumps in the clock are only once a day.
fr: Freenet éprouvera des problèmes si votre horloge est constamment réajustée. Cela arrive habituellement quand quelque chose réajuste votre horloge régulièrement de beaucoup. Sous Linux, vous devriez exécuter ntpd afin de garantir que votre horloge n’est pas trop déréglée (ce n’est pas essentiel, mais utile), mais si vous remarquez des décalages, essayez d’y ajouter l’option -x afin d’éviter les gros bonds en arrière. Une autre bonne idée serait d’exécuter ntpdate lors du démarrage afin qu’il y ait un grand bond avant que Freenet démarre. Cela peut aussi se produire parfois sous Windows. Indiquez-nous comment vous avez réussi à le corriger... bien que ce ne soit généralement pas si sérieux que ça, particulièrement si les grands bonds d’horloge ne se produisent qu’une fois par jour.

source: Publishing
fr: Publication

source: If I publish something in Freenet, how will people find it? Don't they have to know the key I used?
fr: Si je publie quelque chose sur Freenet, comment les autres pourront-ils le trouver ? Ne doivent-ils pas connaître la clé que j’ai utilisée ?
