Repository: hyphanet/website
Catalog: locales/*/LC_MESSAGES/freenet_site.po
Languages: fr

source: In addition to its anonymity features, as a content distribution network Freenet has the following strengths: * **Totally decentralized** Information can be inserted into Freenet for download without any reliance on a centralized server. All the inserter needs to do is give the content's "key" to someone else and they will be able to download it. * **Adaptive caching** Many CDN architectures only allow peers which have already downloaded a file to share it with other peers. Freenet will adaptively cache information on peers as necessary to meet demand regardless of what that peer has downloaded. This allows Freenet to "scale-up" much more quickly than most solutions for popular files, and improves load-balancing. * **Strong Security** Freenet has long-supported the concept of "Content Hash Keys" which guarantee the integrity of retrieved data. This approach has since been adopted by other architectures. Freenet also supports "Signed Subspace Keys" which allow content to be digitally signed. This also allows content integrity to be guaranteed, but is more flexible than CHKs. * **Forward Error Correction** In common with some other CDN architectures, Freenet employs "Forward Error Correction", which allows a file to be reconstructed even if some of the parts of that file can't be retrieved. Uniquely, Freenet also supports "healing", which involves the reconstruction and reinsertion of missing file components. This page contains links to freely available content on Freenet. If you would like to add a new link please email it to [us]( https://emu.freenetproject.org/cgi-bin/mailman/listinfo/support) - remember that we will only link to content that can be legally distributed in the United States of America.
fr: En plus de ses fonctions d’anonymat, comme réseau de distribution de contenu, Freenet offre les atouts suivants : * **Totalement décentralisé** Des informations peuvent être insérées dans Freenet dans le but d’être téléchargées sans dépendre aucunement d’un serveur centralisé. Il suffit que la personne qui les insère donne la « clé » du contenu à quelqu’un d’autre pour que le téléchargement soit possible. * **Mise en cache adaptative** Dans plusieurs architectures de réseaux de diffusion de contenu, seuls les pairs ayant déjà téléchargé un fichier peuvent le partager avec d’autres pairs. Quand cela est requis, Freenet effectuera une mise en cache adaptative des informations sur les pairs pour satisfaire à la demande, indépendamment de ce que le pair a téléchargé. Cela permet à Freenet de « s’adapter » beaucoup plus rapidement que la plupart des solutions pour fichiers populaires, et améliore la répartition de la charge. * **Sécurité rigoureuse** Freenet gère depuis longtemps le concept de « clés de hachage du contenu » ce qui garantit l’intégrité des données obtenues. Cette approche a depuis été adoptée par d’autres architectures. Freenet gère aussi les « clés de sous-espace signé » ce qui permet la signature numérique du contenu. Cela permet également la garantie de l’intégrité du contenu, tout en étant plus souple que les CHK. * **Contrôle continu** Comme d’autres architectures de réseaux de diffusion de contenu, Freenet utilise un « contrôle continu » qui permet la reconstruction d’un fichier même si certaines parties du fichier ne peuvent pas être récupérées. Freenet est le seul à gérer également la « réparation » qui implique une reconstruction et une réinsertion de composants de fichiers manquants. Cette page contient des liens vers du contenu proposé librement sur Freenet. Si vous souhaitez ajouter un nouveau lien, veuillez [nous] l’envoyer par courriel à (https://emu.freenetproject.org/cgi-bin/mailman/listinfo/support) - Nous n’ajouterons que des liens vers du contenu distribuable légalement aux États-Unis d’Amérique.

source: Understand
fr: Comprendre

source: Freenet can be thought of as a large storage device. When you store a file in it, you receive a key which can be used to retrieve the file. When you supply Freenet with a key, it returns the appropriate file (if it is located). The storage space is distributed among all connected nodes on Freenet. Freenet is a peer-to-peer network which is both decentralized and anonymized. The nodes that you connect to only know their nearest neighbours and have no idea about how the network as a whole is structured.
fr: Freenet peut être considéré comme un gros périphérique de stockage. Quand vous y stockez un fichier, vous recevez une clé qui peut être utilisée pour récupérer le fichier. Quand vous fournissez une clé à Freenet, il retourne le fichier approprié (s’il est repéré). L’espace de stockage est distribué parmi tous les nœuds connectés sur Freenet. Freenet est un réseau pair à pair, qui est à la fois décentralisé et anonymisé. Les nœuds auxquels vous vous connectez ne connaissent que leurs voisins les plus proches et n’ont aucune idée de la structure générale du réseau.

source: ### Small world network Freenet is built on the principle of small world networks. By connecting to nodes of people you already know, and the people you know in turn connect to people they know, one should be able to reach all nodes in a Freenet network.
fr: ### Le réseau « petit monde » Freenet est conçu d’après le principe des réseaux « petit monde ». En vous connectant aux nœuds de personnes que vous connaissez déjà, et qu’à leur tour les personnes que vous connaissez se connectent aux personnes qu’elles connaissent, tous les nœuds d’un réseau Freenet devraient être accessibles.

source: ### The datastore All Freenet nodes contribute a part of their hard drive space to store encrypted pieces of files. They are stored in the **datastore** directory in the Freenet installation directory.
fr: ### Le magasin de données Tous les nœuds Freenet consacrent une partie de l’espace de leur disque dur au stockage de morceaux chiffrés de fichiers. Ils sont stockés chiffrés dans le répertoire **datastore** du répertoire d’installation de Freenet.

source: Unlike other peer-to-peer networks, you as a user have little or no control over what is stored in your datastore. Instead, files are kept or deleted depending on how popular they are. This allows Freenet to be censorship-resistant. There is no "delete file" operation.
fr: Contrairement aux autres réseaux pair à pair, vous, en tant qu’utilisateur, n’avez que peu ou pas de contrôle sur ce qui est stocké dans votre magasin de données. Les fichiers sont plutôt conservés ou supprimés selon leur popularité. Cela permet à Freenet de résister à la censure. Il n’y a pas d’opérations « supprimer le fichier ».

source: It is hard, but not impossible, to determine what the encrypted file pieces stored in your local Freenet datastore are part of. This allows plausible deniability.
fr: Il est difficile, mais pas impossible, de déterminer de quoi font partie les morceaux chiffrés de fichiers stockés dans votre magasin de données Freenet local. Cela permet un déni plausible.

source: Freenet suggests an initial size based on how much space is available, and you can change the store size at any time. A larger store uses more RAM, but makes for better browsing for you and helps Freenet as a whole.
fr: Freenet suggère une taille initiale d’après la quantité d’espace disponible. Vous pouvez changer la taille du magasin en tout temps. Un magasin plus gros utilise plus de mémoire vive, mais améliore votre navigation et aide Freenet dans son ensemble.

source: ### Freenet Routing Initially, each node has no information about the performance of the other nodes it knows about. This means that routing of requests is essentially random. But since different nodes have different randomness, they will disagree about where to send a request, given a key. So the data in a newly-started Freenet will be distributed somewhat randomly.
fr: ### Le routage dans Freenet Au départ, chaque nœud n’a aucune information sur les performances des autres nœuds qu’il connaît. Cela signifie que l’acheminement de requêtes est essentiellement aléatoire. Mais dans la mesure où le caractère aléatoire est différent d’un nœud à l’autre, ils seront en désaccord sur où envoyer une requête si une clé leur est donnée. Donc, pour un Freenet nouvellement démarré, les données seront distribuées un peu aléatoirement.

source: As more documents are inserted by the same node, they will begin to cluster with data items whose keys (see below) are similar, because the same routing rules are used for all of them. More importantly, as data items and requests from different nodes "cross paths", they will begin to share clustering information as well.
fr: Au fur et à mesure que des documents sont insérés par le même nœud, ils commenceront à se regrouper avec des éléments de données dont les clés (voir ci-dessous) sont similaires, car les mêmes règles de routage sont utilisées pour tous. Plus important encore, alors que les éléments de données et les requêtes de différents nœuds se croisent, ils commenceront à aussi partager des informations de regroupement.

source: The result is that the network will self-organize into a distributed, clustered structure where nodes tend to hold data items that are close together in key space. There will probably be multiple such clusters throughout the network, any given document being replicated numerous times, depending on how much it is used.
fr: Il en résulte une auto-organisation du réseau en une structure distribuée et groupée où les nœuds ont tendance à conserver les éléments de données proches les uns des autres dans l’espace de clé. Il y aura probablement plusieurs de ces regroupements dans le réseau, tout document étant reproduit de nombreuses fois d’après suivant son degré d’utilisation.

source: ### Freenet keys Each file that exists on Freenet has a key associated with it. Freenet 0.7 has various types of keys. Keys are used for everything on Freenet, and are a kind of [URI](https://en.wikipedia.org/wiki/Uniform_Resource_Identifier) ( e.g. freenet:=KSK@sample.txt).
fr: ### Les clés Freenet Pour chaque fichier qui existe sur Freenet, une clé y est associée. Freenet 0.7 utilise différents types de clés. Dans Freenet, les clés sont utilisées pour tout, et sont une sorte d’[URI](https://fr.wikipedia.org/wiki/Uniform_Resource_Identifier) ( p. ex. freenet:=KSK@sample.txt).

source: Most keys are hashes: there is no notion of semantic closeness when speaking of key closeness. Therefore there will be no correlation between key closeness and similar popularity of data as there might be if keys did exhibit some semantic meaning, thus avoiding bottlenecks caused by popular subjects.
fr: La plupart des clés sont des hachages : il n’y a pas de notion de ressemblance sémantique dans les cas de clés qui se ressemblent. Par conséquent, il n’y aura pas de corrélation entre ressemblance de clés et popularité de données similaire, comme il pourrait y avoir si les clés présentaient une signification sémantique, empêchant ainsi les embouteillages causés par les sujets populaires.

source: ### Accessing data To access a particular piece of data on Freenet, you can use FProxy. You need to know the key to the data, and enter it like this (or click a link containing the key): <pre> http://localhost:8888/[Freenet Key]</pre> There are four types of keys in Freenet: * **CHK** - Content Hash Keys * **SSK** - Signed Subspace Keys * **USK** - Updatable Subspace Keys * **KSK** - Keyword Signed Keys
fr: ### L’accès aux données Vous pouvez utiliser FProxy pour accéder à des données particulières sur Freenet. Vous devrez en connaître la clé et la saisir ainsi (ou cliquer sur un lien contenant la clé) : <pre> http://localhost:8888/[Clé Freenet]</pre> Il y a quatre types de clés dans Freenet : * **CHK** - Clés de hachage du contenu * **SSK** - Clés de sous-espace signé * **USK** - Clés de sous-espace actualisable * **KSK** - Clés signées par mot-clé

source: CHKs are the most fundamental. All files over 1kB are ultimately divided into one or more 32kB CHKs. CHKs' filenames are determined only by their contents. SSKs are the other basic type. These combine a public key with a human-readable filename and therefore allow for freesites. KSKs are a variant of SSKs where everything is determined by a simple human readable filename ( e.g. =KSK@sample.txt). These are spammable but convenient in some cases. And USKs are a form of updatable keys especially useful for freesites and **Address Resolution Keys**.
fr: Les CHK sont les plus fondamentales. Tous les fichiers de plus de 1 ko sont en fin de compte divisés en une ou plusieurs CHK de 32 ko. Les noms des fichiers CHK sont seulement déterminés par leur contenu. Les SSK sont l’autre type fondamental. Elles combinent une clé publique à un nom de fichier interprétable par l’utilisateur et les deux permettent donc les sitesFree. Les KSK sont une variante des SSK où tout est déterminé par un simple nom de fichier interprétable par l’utilisateur ( p. ex. : KSK@échantillon.txt). Ils peuvent être pollués, mais sont commodes dans certains cas. Et les USK sont une forme de clés actualisables particulièrement utiles pour les sitesFree et les **clés de résolution d’adresse**.

source: An Address Resolution Key (ARK) is an Updatable Subspace Key (USK) inserted by the node whenever its IP address changes. It contains the reference for the node - its cryptographic details, and in particular its IP address(es). ARKs are a way to help people connect to Freenet if they have problems caused by firewalls, routers or changing IP addresses. If someone cannot accept incoming traffic it can make it difficult to connect. ARKs are an implementation detail and you don't need to know anything about them to use Freenet.
fr: Une clé de résolution d’adresse (ARK) est une clé de sous-espace actualisable (USK) insérée par le nœud quand son adresse change. Elle contient la référence du nœud - ses détails cryptographiques, et en particulier son/ses adresse(s) IP. Les ARK sont une façon d’aider les utilisateurs à se connecter à Freenet s’ils éprouvent des problèmes causés par des pare-feu, des routeurs ou des adresses IP changeantes. Si quelqu’un ne peut pas accepter du trafic entrant, il peut être difficile de se connecter. Les ARK sont un détail de mise en œuvre et vous n’avez rien à connaître à leur sujet pour utiliser Freenet.

source: ### Content Hash Keys Content Hash Keys are for files with static content, like an .mp3 or a PDF-document. These keys are hashes of the content of the file. A hash is a reproducible method of turning a specific piece of data into a relatively small number that serve as a sort of *fingerprint* for the data. If the file content changes, even ever so little, the hash of the file changes radically. This makes the data hard to tamper with without anyone noticing. A CHK uniquely identifies a file, it should not be possible for two files with different content to have the same CHK. The CHK consists of three parts: 1. the hash for the file 2. the decryption key that unlocks the file, and 3. the cryptographic settings used
fr: ### Les clés de hachage du contenu Les clés de hachage du contenu sont pour les fichiers à contenu statique, comme les .mp3 ou les documents PDF. Ces clés sont des hachages du contenu du fichier. Un hachage est une méthode reproductible pour transformer un élément de données en un nombre relativement petit qui servira en quelque sorte d’« empreinte » pour les données. Si le contenu du fichier est modifié un tant soit peu, le hachage du fichier changera radicalement. Il est ainsi difficile d’altérer les données sans que quelqu’un s’en aperçoive. Une CHK identifie un fichier de façon unique, et il ne devrait pas être possible que deux fichiers avec un contenu différent aient la même CHK. Il y a trois parties dans une CHK : 1. le hachage du fichier 2. la clé de déchiffrement qui déverrouille le fichier, et 3. les paramètres cryptographiques utilisés

source: A typical CHK key looks like this: CHK@file hash,decryption key,crypto settings or for example: CHK@SVbD9~HM5nzf3AX4yFCBc-A4dhNUF5DPJZLL5NX5Brs,bA7qLNJR7IXRKn6uS5PAySjIM6azPFvK~18kSi6bbNQ,AAEA--8 The decryption key is part of the key for the file, and is not included in requests for the file's pieces. It is thus not possible to decrypt the file without the CHK key. To access the file, the whole key must be pasted behind the FProxy address (cut to fit screen): http://localhost:8888/CHK@SVbD9~[..]X5Brs,bA7qLN[..]Si6bbNQ,AAEA--8
fr: Une CHK typique ressemble à ceci : CHK@hachage de fichier,clé de déchiffrement,paramètres cryptographiques ou par exemple : CHK@SVbD9~HM5nzf3AX4yFCBc-A4dhNUF5DPJZLL5NX5Brs,bA7qLNJR7IXRKn6uS5PAySjIM6azPFvK~18kSi6bbNQ,AAEA--8 La clé de déchiffrement fait partie de la clé pour le fichier, et n’est pas incluse dans les requêtes de morceaux de ce fichier. Il est ainsi impossible de déchiffrer le fichier sans la clé CHK. Pour accéder au fichier, la clé entière doit être collée derrière l’adresse FProxy (rogné pour affichage): http://localhost:8888/CHK@SVbD9~[..]X5Brs,bA7qLN[..]Si6bbNQ,AAEA--8

source: ### Signed Subspace Keys Signed Subspace Keys are usually for sites that are going to change over time. For example, a website that may need news to be updated or information to be corrected, added or deleted. They work in such a way that someone else can't put up a newer version of your site and pretend it was you who did it. It works by using public-key cryptography so you can sign your site. Only the person with the secret key can add updated versions of your site to Freenet.
fr: ### Les clés de sous-espace signé Les clés de sous-espace signé sont habituellement pour des sites qui changeront avec le temps. Par exemple, un site Web dont les nouvelles doivent être mises à jour, ou dont des informations doivent être corrigées, ajoutées ou encore supprimées. Elles fonctionnent de manière à ce que quelqu’un d’autre ne puisse pas mettre en ligne une nouvelle version de votre site, et prétendre que vous l’avez fait. Elles utilisent une cryptographie par clé publique afin que vous puissiez signer votre site. Seule la personne possédant la clé secrète peut ajouter des versions mises à jour de votre site sur Freenet.

source: Also the SSK consists of five parts: * **public key hash** - This part is all that is required to uniquely identify the file (but not decrypt it), so nodes need only store this bit. The actual public key is stored (unencrypted) with the (encrypted) data. * **document decryption key** - This is only known to clients and not to the nodes storing the data, so nodes cannot decrypt the data they store without the full address. * **crypto settings** - Cryptographic algorithm used, etc. * **user selected name** - a word or sentence chosen by the site author. * **version** - the current version of the site. The version number is increased each time a new version of the site is created and inserted into Freenet. This approach is used since it is not currently possible to update already inserted data in Freenet. Updateable Subspace Keys makes this more transparent to the user, see below. A typical SSK key looks like this: SSK@public key hash,decryption key,crypto settings/user selected name-version For example (cut for screen purposes): SSK@GB3wuHmt[..]o-eHK35w,c63EzO7u[..]3YDduXDs,AQABAAE/mysite-4
fr: De plus, il y a cinq parties dans une SSK : * **le hachage de la clé publique** - Cette partie est la seule exigée pour identifier le fichier de façon unique (mais pas pour le déchiffrer), et les nœuds n’ont que ça à stocker. La clé publique est en fait stockée (déchiffrée) avec les données (chiffrées). * **la clé de déchiffrement du document** - Elle n’est connue que par les clients, mais pas par les nœuds qui stockent les données. Ainsi les nœuds ne peuvent pas déchiffrer les données qu’ils stockent sans l’adresse complète. * **les paramètres cryptographiques** - l’algorithme cryptographique utilisé, etc. * **le nom choisi par l’utilisateur** - un mot ou une phrase choisis par l’auteur du site. * **la version** - la version actuelle du site. Le numéro de version est augmenté chaque fois qu’une nouvelle version du site est créée et insérée dans Freenet. Cette approche est utilisée, car il n’est actuellement pas possible de mettre à jour des données déjà insérées dans Freenet. Les clés de sous-espace actualisable rendent cela plus transparent pour l’utilisateur, voir ci-dessous. Une SSK typique ressemble à ceci : SSK@hachage de la clé publique,clé de déchiffrement,paramètres cryptographiques/nom choisi par l’utilisateur Par exemple (coupé pour affichage à l’écran) : SSK@GB3wuHmt[..]o-eHK35w,c63EzO7u[..]3YDduXDs,AQABAAE/monsite-4

source: ### How Signed Subspace Keys work * The author generates a cryptographic keypair: a **private key** for signing files and a **public key** for verifying the signature. * The author also generates a single **symmetric key** (one that is used for both encrypting and decrypting). * When a file is inserted into Freenet, it is encrypted with the **symmetric key** and signed with the **private key**. The signature is stored with the file. Nodes don't store the **symmetric key**, only the **public key** part of the SSK, as an index to the data. This is so they can plausibly deny knowledge of the data on their node. The SSK is made up of a hash of the public key, and the symmetric key. The hash of the public key acts as the index to the data for searching purposes. Also, the actual public key is stored with the data. This is so that Freenet nodes can verify the signature when the SSK file comes into their node, and also so that clients can verify the signature when retrieving the file. The symmetric key is so that clients can decrypt the file. Signed Subspace Key sites have largely been superseded by Updatable Subspace Key (USK) sites, which are based on SSKs but allow for links that try to always retrieve the most up-to-date version of the site.
fr: ### Comment les clés de sous-espace signé fonctionnent-elles ? * L’auteur génère une biclé cryptographique : une **clé privée** pour la signature des fichiers et une **clé publique** pour vérifier la signature. * L’auteur génère aussi une seule **clé symétrique** (utilisée à la fois pour le chiffrement et le déchiffrement). * Quand un fichier est inséré dans Freenet, il est chiffré avec la **clé symétrique** et signé avec la **clé publique**. La signature est stockée avec le fichier. Les nœuds ne stockent pas la **clé symétrique**, seulement la partie **clé publique** de la SSK, comme index des données. Il en est ainsi afin que les utilisateurs puissent plausiblement nier avoir connaissance des données sur leur nœud. La SSK est composée d’un hachage de la clé publique, et de la clé symétrique. Le hachage de la clé publique agit en tant qu’index des données pour les recherches. De plus, la clé publique elle-même est stockée avec les données. Il en est ainsi afin que les nœuds Freenet puissent vérifier la signature quand le fichier SSK arrive sur leur nœud, et aussi afin que les clients puissent vérifier la signature quand ils obtiennent le fichier. La clé symétrique permet aux clients de déchiffrer le fichier. Les sites utilisant les clés de sous-espace signé ont largement été supplantés par les sites utilisant les clés de sous-espace actualisable (USK), qui sont fondées sur les SSK, mais permettent des liens qui tentent de toujours récupérer la version la plus à jour du site.
