Repository: hyphanet/website
Catalog: locales/*/LC_MESSAGES/freenet_site.po
Languages: fr

source: PS for an example of how dependant Tor is on centralised hidden services, see [this](http://www.twitlonger.com/show/n_1rlo0uu) [bust](http://arstechnica.com/tech-policy/2013/08/alleged-tor-hidden-service-operator-busted-for-child-porn-distribution/). Half the hidden services on Tor were using a single hosting service, whose owner has now been arrested. While we don't approve of these sites, it does illustrate the point: A centralised network is a vulnerable network. Unfortunately, decentralised networks are hard, but in the long run they are more secure.
fr: Pour un exemple de la dépendance de Tor des services centralisés cachés, lire [ceci](http://www.twitlonger.com/show/n_1rlo0uu) [bust](http://arstechnica.com/tech-policy/2013/08/alleged-tor-hidden-service-operator-busted-for-child-porn-distribution/). La moitié des services cachés de Tor utilisaient un seul service d’hébergement dont le propriétaire a été arrêté. Bien que nous n’approuvions aucunement ces sites, cela illustre bien le point suivant : un réseau centralisé et un réseau vulnérable. Malheureusement, les réseaux centralisés sont difficiles à mettre en place, mais à long terme ils sont plus sûrs.

source: Who is behind Freenet?
fr: Qui est derrière Freenet ?

source: Freenet grew out of a design for an anonymous publication system created by Ian Clarke while a student at the University of Edinburgh, Scotland. Since then many other people have contributed towards making Ian's proposal a reality.
fr: Freenet est né à partir du concept de système de publication anonyme créé par Ian Clarke alors qu’il était étudiant à l’Université d’Édimbourg en Écosse. Depuis, beaucoup d’autres personnes ont contribué à faire de la proposition d’Ian une réalité.

source: If authors are anonymous how can you trust information?
fr: Si les auteurs sont anonymes, comment pouvez-vous faire confiance aux informations ?

source: Cryptographic signing of information allows people to prove authorship, this technique is frequently used to authenticate authorship of emails. Moreover, you can actually sign information while remaining anonymous, thus having an anonymous persona. You can prove that you wrote different pieces of information on Freenet, without revealing your identity. In this way you can build up an anonymous reputation for reliability.
fr: La signature cryptographique des informations permet aux gens de prouver leur paternité. Cette technique est fréquemment utilisée pour attester la paternité de courriels. De plus, vous pouvez en fait signer des informations tout en restant anonyme, ce qui vous permet de rester un personnage public anonyme. Vous pouvez prouver que vous avez rédigé plusieurs éléments d’informations sur Freenet, sans révéler votre identité. De cette manière, vous pouvez vous bâtir une réputation anonyme de fiabilité.

source: Do I have to donate disk space and bandwidth?
fr: Dois-je donner de l’espace disque et de la bande passante ?

source: You aren't really donating in the sense that you lose the disk space and the bandwidth; but you aren't really sharing either (at least not the same way as with filesharing programs). It is more like pitching in to the common Freenet resource pool.
fr: Vous ne donnez vraiment rien dans la mesure où vous perdez de l’espace disque et de la bande passante ; mais vous ne partagez pas vraiment non plus (en tout cas pas de la même manière qu’avec des programmes de partage de fichiers). Vous apportez plutôt votre contribution au bassin de ressources de Freenet.

source: I don't have to donate anything when using filesharing application X and I get to leech more.
fr: Je n’ai pas à donner quoi que ce soit quand j’utilise l’application de partage de fichiers X et je tire plus profit des informations des autres.

source: Do you get to do that anonymously? Freenet is designed with anonymity in mind, performance comes second.
fr: Pouvez-vous le faire anonymement ? Freenet est conçu dans un esprit d’anonymat, et les performances viennent ensuite.

source: All my friends donate very little space and bandwidth. Should I donate more?
fr: Tous mes amis ne donnent que très peu d’espace et de bande passante. Devrais-je en donner plus ?

source: If you are happy with what you are getting then no. But if you want more you should consider donating more and running your node as close to 24x7 as possible, and you should ask your friends to do the same.
fr: Si vous êtes satisfait de ce que vous obtenez, alors non. Mais si vous en voulez davantage, vous devriez penser à en donner plus et à faire tourner votre nœud presque jour et nuit, et vous devriez demander à vos amis d’en faire autant.

source: If I donate a lot will my experience improve significantly?
fr: Si j’en donne beaucoup, mon expérience sera-t-elle sensiblement améliorée ?

source: Your experience will definitely get better, but for a really great improvement we need more people to start thinking like you. Bandwidth counts more than diskspace.
fr: Votre expérience sera certainement meilleure, mais pour une amélioration vraiment importante, plus de gens doivent penser comme vous. La bande passante compte plus que l’espace disque.

source: Is Freenet legal?
fr: Freenet est-il légal ?

source: We don't currently know of any prosecutions for merely using Freenet. Some people claim that the [DADVSI](https://en.wikipedia.org/wiki/DADVSI) makes Freenet illegal in France; the German data retention law might have required logging, but [was struck down](http://en.wikipedia.org/wiki/Telecommunications_data_retention#Germany). Also, the German supreme court has found that [not securing your wifi properly](http://merlin.obs.coe.int/iris/2010/7/article13.en.html) makes you responsible for other people's downloads over it; this might or might not be extended to prohibiting anonymous peer to peer filesharing such as Freenet. [ACTA](http://en.wikipedia.org/wiki/ACTA) might have wide-ranging effects, including on Freenet, should it pass, and similar laws such as IPRED2 have been tried in the past. There have also been attempts to force peer to peer systems to provide wiretapping capabilities in the USA, and there are [worrying developments](http://www.bbc.co.uk/news/uk-politics-19968068) in the UK that might result in it being blocked, but not being made illegal per se. As far as we know none of these things - apart from the first two - have passed. Many of these are arguable either way (depending on how broadly the legislation is applied) and will have to be decided in caselaw. The law can be an ass sometimes. You can read the EFF's (US-centric) advice to peer to peer developers [here]( https://www.eff.org/wp/iaal-what-peer-peer-developers-need-know-about-copyright-law). If you need legal advice, talk to a lawyer. Also read the next section especially if you are in China; blocking the protocol may suggest the authorities don't like us!
fr: Nous ne connaissons aucun cas de poursuite judiciaire pour avoir seulement utilisé Freenet. Certaines personnes prétendent que la [loi DADVSI](https://fr.wikipedia.org/wiki/Loi_relative_au_droit_d%27auteur_et_aux_droits_voisins_dans_la_soci%C3%A9t%C3%A9_de_l%27information) rend Freenet illégal en France ; la loi allemande sur la conservation des données aurait pu rendre la journalisation obligatoire, mais elle [a été abrogée](http://en.wikipedia.org/wiki/Telecommunications_data_retention#Germany). La Cour suprême allemande a jugé qu’[en ne sécurisant pas correctement votre connexion Wi-Fi](http://merlin.obs.coe.int/iris/2010/7/article13.en.html) vous êtes tenu responsable des téléchargements d’autrui par cette connexion. Cela pourrait ou non être étendu à l’interdiction du partage anonyme pair à pair de fichiers tel que Freenet. L’[ACAC](https://fr.wikipedia.org/wiki/Accord_commercial_anti-contrefa%C3%A7on) pourrait avoir, s’il est adopté, de vastes conséquences, notamment sur Freenet, et des lois semblables, telles qu’IPRED2, ont été proposées par le passé. Aux É.-U., il a aussi été tenté d’obliger les systèmes pair à pair de fournir des dispositifs susceptibles de surveiller, et il y a des [évolutions inquiétantes](http://www.bbc.co.uk/news/uk-politics-19968068) au R.-U. qui pourraient entraîner son blocage, sans toutefois le rendre illégal. À notre connaissance rien de tout cela, à part les deux premières lois, n’a été adopté. De nombreux éléments peuvent être soutenus (suivant l’étendue d’application de la loi) et devront faire l’objet d’une jurisprudence. La loi peut parfois être ridicule. Vous pouvez lire [ici]( https://www.eff.org/wp/iaal-what-peer-peer-developers-need-know-about-copyright-law) les recommandations de l’EFF (pour les É.-U.) pour les développeurs de systèmes pair à pair. Si vous avez besoin de conseils juridiques, consultez un avocat. Veuillez aussi lire l’article suivant, particulièrement si vous êtes en Chine ; le blocage du protocole pourrait suggérer que les autorités ne nous affectionnent pas !

source: Is Freenet blocked by national firewalls?
fr: Freenet est-il bloqué par les pare-feu nationaux ?

source: The Chinese national firewall (Golden Shield) has blocked our website for many years, and was observed in 2005 to block the 0.5 protocol as well. This suggests China doesn't like us, so be careful if you run Freenet in China. Some other countries (e.g. France) are known to be hostile to peer to peer, and may eventually force ISPs to block peer to peer networks (but right now Freenet works fine in France and we have many French users!). Technically, Freenet 0.7 has some minimal defences against blocking; the protocol is relatively hard to identify (we are working on ["transport plugins"](https://wiki.freenetproject.org/Transport_plugins), which would [make it much harder to detect Freenet](http://en.wikipedia.org/wiki/Steganography). Freenet supports a [darknet](https://wiki.freenetproject.org/Darknet) mode (i.e. only connecting to your friends) which makes automated harvesting and blocking of nodes very difficult. Note that many mobile internet providers block all peer to peer networks along with other content, and many corporate or academic networks may block Freenet (but even if they don't, see [you shouldn't run Freenet at work](#trouble) for non-work purposes!).
fr: Le pare-feu national chinois (bouclier d’or) bloque notre site Web depuis des années, et il a été observé en 2005 qu’il bloquait aussi le protocole 0.5. Cela laisse à penser que la Chine ne nous aime pas, et soyez donc prudent si vous utilisez Freenet en Chine. D’autres pays (p. ex. la France) sont reconnus pour leur hostilité envers le pair-à-pair, et pourraient un jour forcer les FAI à bloquer les réseaux pair à pair (mais pour l’instant, Freenet fonctionne très bien en France et nous avons de nombreux utilisateurs français !). Techniquement parlant, Freenet 0.7 n’incluait que des défenses minimes contre le blocage ; le protocole est assez difficile à identifier (nous travaillons sur des [« greffons de transport »](https://wiki.freenetproject.org/Transport_plugins), qui devraient [rendre la détection de Freenet beaucoup plus difficile](https://fr.wikipedia.org/wiki/St%C3%A9ganographie). Freenet prend en charge un mode [réseau invisible](https://wiki.freenetproject.org/Darknet) (c.-à-d. ne se connectant qu’à vos amis) qui rend le moissonnage et le blocage des nœuds très difficiles. Il est à noter que de nombreux fournisseurs d’accès Internet mobile bloquent tous les réseaux pair à pair, ainsi que d’autres contenus, et que de nombreux réseaux d’entreprise et scolaires pourraient bloquer Freenet (et même s’ils ne le font pas, consultez [vous ne devriez pas utiliser Freenet au travail](#trouble) pour des fins non professionnelles !).

source: There has been discussion in the US and UK of legislation to require backdoors and presumably blocking of anything that can't be backdoored. This is unlikely to pass, especially in the US, where similar laws have been proposed periodically and are probably unconstitutional. However, even if the government came to us and demanded a back door, we would be legally unable to secretly distribute a trojan'ed build, because Freenet is open source, numerous people have contributed code to it, so legally we have to give you the source code, including that for any government mandated back doors - which wouldn't be secret for long! If this happened it is likely that [ Freenet Project Incorporated](donate.html), the non-profit organisation that runs this website and handles donations, would shut down, but the Freenet network itself would live on just fine, the only difference being not being able to pay full time developers as easily. See [net neutrality](http://en.wikipedia.org/wiki/Network_neutrality) and [the EFF](https://www.eff.org/) or equivalent organisations in your country for the politics of all this and how you can stop such laws.
fr: Il a été question aux États-Unis et au Royaume-Uni de lois exigeant des portes dérobées et apparemment de bloquer tout ce qui n’en a pas. Il y a peu de chance qu’elles soient adoptées, particulièrement aux É.-U. où des lois semblables ont été proposées régulièrement, lois qui seraient probablement inconstitutionnelles. Cependant, même si le gouvernement nous approchait et nous demandait une porte dérobée, nous ne pourrions légalement pas distribuer une version contenant un cheval de Troie, car Freenet est à code source ouvert, que de nombreuses personnes ont contribué au code, et que légalement nous devons vous remettre le code, incluant celui de toute porte dérobée rendue obligatoire par le gouvernement - ce qui ne resterait pas secret pour longtemps ! Si cela arrivait, il est probable que [Freenet Project Incorporated](donate.html), l’organisme sans but lucratif qui dirige ce site Web e t gère les dons, fermerait ses portes. Mais le réseau Freenet même continuerait de vivre, la seule différence serait alors de ne pas pouvoir rémunérer les développeurs à temps plein aussi facilement. Consulter [neutralité du réseau](https://fr.wikipedia.org/wiki/Neutralit%C3%A9_du_r%C3%A9seau) et [l’EFF](https://www.eff.org/) ou tout organisme équivalent dans votre pays qui pourrait vous renseigner sur l’aspect politique de tout cela, et sur comment bloquer de telles lois.

source: Can I get trouble if I run a node?
fr: Puis-je avoir des ennuis si je fais tourner un nœud ?

source: This is related to ["Is Freenet legal?"](#legal). We have done everything we can to make it extremely difficult for any sane legal system to justify punishing someone for running a Freenet node, and there is little precedent for such action in today's developed countries. Many legal systems recognize the importance of freedom of speech, which is Freenet's core goal. Having said that, there is risk in doing anything that your government might not agree with; you should make an informed decision as to whether to take that risk. Furthermore, your ISP or hosting provider may have a problem with Freenet. At least one French hosting provider has been known to ban Freenet ( along with Tor and others) from their servers; please read your terms and conditions to make sure you are allowed to run Freenet. Note also that Freenet can use rather a lot of bandwidth, at least 20GB/month, and this may be a problem on a cheap or shared connection. And of course running it at work could get you into trouble too, unless it's for work purposes!
fr: Cela est lié à [« Freenet est-il légal ?»](#legal). Nous avons fait notre possible afin qu’aucun système judiciaire lucide ne puisse justifier de punir quelqu’un qui ferait tourner un nœud Freenet, et il n’y a guère de précédents de telle action de nos jours dans les pays développés. De nombreux systèmes judiciaires reconnaissent l’importance de la liberté d’expression, qui est l’objectif principal de Freenet. Cela dit, il y a un risque à faire quelque chose qui ne conviendrait pas à votre gouvernement ; vous devriez prendre une décision éclairée quant à prendre ce risque. De plus, votre FAI ou fournisseur d’hébergement pourrait s’opposer à Freenet. L’on sait qu’au moins un fournisseur d’hébergement français interdit Freenet (ainsi que Tor et autres) sur ses serveurs ; veuillez lire vos conditions générales d’utilisation pour vous assurer d’avoir la permission de faire tourner Freenet. Veuillez aussi prendre note que Freenet peut être plutôt gourmand en bande passante, au moins 20 Go/mois, et cela pourrait être un problème sur une connexion de mauvaise qualité ou partagée. Et bien sûr, il pourrait aussi être problématique de le faire tourner au travail, à moins que ce ne soit pour des raisons professionnelles !

source: What about copyright?
fr: Qu’en est-il des droits d’auteur ?

source: There are some excellent thoughts on this subject on the [Philosophy]( about.html#philosophy) page. Specific copyright-related laws may be a problem, please read [Is Freenet legal?](#legal) and [Is Freenet blocked by national firewalls?](#blocked).
fr: D’excellentes réflexions sur ce sujet se trouvent sur la page [Philosophie](about.html#philosophy). Des lois particulières sur les droits d’auteur pourraient être un problème. Veuillez lire [« Freenet est-il légal ? »](#legal) et [« Freenet est-il bloqué par les pare-feu nationaux ? »](#blocked).

source: What about child porn, offensive content or terrorism?
fr: Qu’en est-il de la pornographie juvénile, des contenus offensants ou de terrorisme ?

source: While most people wish that child pornography and terrorism did not exist, humanity should not be deprived of their freedom to communicate just because of how a very small number of people might use that freedom.
fr: Alors que la plupart des gens souhaitent que la pornographie juvénile et le terrorisme n’existent pas, l’humanité ne devrait pas être privée de sa liberté de communiquer à cause de la manière dont un très petit nombre de personnes pourrait utiliser cette liberté.

source: I don't want my node to be used to harbor child porn, offensive content, or terrorism. What can I do?
fr: Je ne veux pas que mon nœud soit utilisé pour héberger de la pornographie juvénile, des contenus offensants ou du terrorisme. Que puis-je faire ?

source: This is a problem that sadly any censorship-resistance tool faces. If the capacity to remove content existed, it might only be used to remove things one finds offensive, but it could be used to remove anything. From a technological point of view one cannot have censorship-resistance with exceptions. Freenet is merely a tool that by itself doesn't do anything to promote offensive content. How people choose to use the tool is their sole responsibility. As a communication medium, Freenet cannot be considered responsible for what people use it for — just like Internet Service Providers, telecoms, or postal services cannot be held responsible for their users either. Note that files are encrypted and split into pieces. They are not stored on your machine in their entirety. Your instance of Freenet will likely have very few encrypted pieces of a given file, if any. These pieces cannot be used as parts of the file they were made from without additional information. Reassembling a file requires knowing both what pieces to use and the key to decrypt them, neither of which is included with each piece.
fr: C’est malheureusement un problème auquel n’importe quel outil de résistance à la censure est confronté. Si la possibilité de supprimer du contenu existait, elle ne pourrait être utilisée que pour retirer des éléments que quelqu’un trouverait dérangeants, mais elle pourrait être utilisée pour retirer n’importe quoi. D’un point de vue technologique, il ne peut y avoir de résistance à la censure avec des exceptions. Freenet est tout simplement un outil qui, en lui même, ne fait rien pour promouvoir du contenu offensif. Les gens sont seuls responsables de la manière dont ils choisissent d’utiliser l’outil. En tant que support de communication, Freenet ne peut pas être tenu responsable de l’utilisation qu’en font les gens, comme les fournisseurs d’accès Internet, les compagnies de télécommunication ou les services postaux ne peuvent pas non plus être tenus responsables. Il faut comprendre que les fichiers sont chiffrés et divisés en morceaux. Ils ne sont pas entièrement stockés sur votre machine. Votre installation de Freenet ne détiendra en toute vraisemblance que très peu de morceaux chiffrés d’un fichier donné, si elle en détient. Ces morceaux ne peuvent pas être utilisés comme parties du fichier dont ils proviennent, sans informations complémentaires. Pour assembler un ficher de nouveau, il faut savoir quels morceaux utiliser et connaître la clé pour les déchiffrer. Aucune de ces informations n’est incluse dans chaque morceau.

source: How about encryption export restrictions?
fr: Qu’en est-il des restrictions à l’exportation de technologies de chiffrement ?

source: The Freenet Project has notified the US authorities that it will be exporting crypto. As long as your country doesn't prohibit the use of encryption you are fine. Further, there is now an exception in the export laws for software doing exactly what Freenet does! However, Oracle limits the encryption strength available on the JVM that runs Freenet; you should install the Unlimited Strength Policy Files for Java if possible to improve performance. Freenet will however work even without this, by using its built-in encryption code.
fr: Le Projet Freenet a informé les autorités étatsuniennes qu’il exportera de la cryptographie. Tant que votre pays n’interdit pas l’utilisation du chiffrement, vous ne risquez rien. De plus, les lois d’exportation présentent maintenant une exception pour les logiciels qui font exactement ce que Freenet fait ! Cependant, Oracle limite la puissance de chiffrement proposée par la machine virtuelle Java qui exécute Freenet ; vous devriez si possible installer les fichiers de puissance illimitée pour Java (Unlimited Strength Policy Files) afin d’améliorer les performances. Freenet fonctionnera malgré tout sans ces fichiers, en utilisant son propre code de chiffrement.

source: I have nothing to hide and don't need anonymity. Is there anything else Freenet can offer?
fr: Je n’ai rien à cacher et je n’ai pas besoin d’anonymat. Freenet peut-il offrir autre chose ?

source: Yes, in fact even without the anonymity feature Freenet is very useful because of the unique way it handles content distribution and information load. In simple terms that means you can publish a website without worrying about how big the site will be and without having to put someone else's ad banners on it. While it is unlikely that freesites will ever load faster than regular websites, they do adapt to sudden surges of visitors better ( which often happen when relatively unknown sites get linked to from a big site), and reasonable download speeds for big files are feasible too. Just don't expect very low latency.
fr: Oui, en fait, même sans la fonction d’anonymat, Freenet est très utile, grâce à sa façon unique de gérer la distribution de contenu et la charge d’informations, Plus simplement, cela signifie que vous pouvez publier un site Web sans vous soucier de la taille du site, et sans avoir à y afficher les bannières publicitaires de quelqu’un d’autre. Bien qu’il est improbable que les sitesFree ne chargent jamais plus rapidement que des sites habituels, ils s’adaptent mieux aux augmentations soudaines de visiteurs (ce qui est fréquent quand des sites relativement inconnus sont reliés à partir d’un gros site), et il est possible d’atteindre des vitesses de téléchargement raisonnables pour les gros fichiers. Ne vous attendez juste pas à un court temps d’attente.

source: Technical
fr: Technique
