Repository: hyphanet/website
Catalog: locales/*/LC_MESSAGES/freenet_site.po
Languages: fr

source: <p> The Freenet team is very happy to announce the stable release of Freenet 0.7.5 build 1468. </p> <p> <b>Important notes</b>: downgrading from build 1468 is not supported; if you want to go back to build 1467 without losing the upload and download queues, <b>before</b> upgrading, back-up the following files and directories: master.keys, persistent-temp-*/, and node.db4o (see https://wiki.freenetproject.org/Program_files ). Please note that running transfers will be restarted from scratch too. A reminder to those testing auto-update to 1468-pre4: please restore your auto-update key to the default. One way to do this is to stop Freenet, remove the "node.updater.URI" line from freenet.ini, and start Freenet again. </p> <p> In this release, the way Freenet stores data locally has changed drastically by no longer using the now-deprecated db4o object storage. It is replaced with the product of toad's summer of work - a custom on-disk format that is much more robust against corruption and more efficient. </p> <ul> <li>Existing unfinished downloads and uploads will be imported to a new format, which requires restarting them from the beginning.</li> <li>Space for downloads is now all allocated at the start, so machines very low on disk space may run out, which causes downloads to temporarily fail until more space is available.</li> <li>CHKs will change due to metadata bugfixes.</li> <li>Some unofficial plugins will need to be updated because of API changes. Sone already works, as do all official plugins.</li> <li>The queue format changes should make it extremely rare to lose the entire queue: the impact of corruption will almost always be localized.</li> <li>Multi-container / site uploads can now be persistent, making it more practical to upload large sites.</li> <li>Passworded physical security is now much stronger. (Full-disk encryption is still preferable.)</li> </ul> <ul> <li>The Windows installer now defaults to starting Freenet on login.</li> <li>There is a <a href="https://github.com/freenet/wintray">new Windows tray app</a> with some useful features that is included with new installations. If you are using the existing Windows tray app you can download the new one <a href="https://downloads.freenetproject.org/alpha/installer/FreenetTray.exe.build01468">here</a>. No need to put it in a specific directory - it will try the default installation location and prompt if it can't find it.</li> </ul> <ul> <li>The list of download keys moved from downloads/listFetchKeys.txt to downloads/listKeys.txt.</li> <li>A list of upload keys is now available at uploads/listKeys.txt</li> </ul> <ul> <li>Gantros' index is now in the default bookmarks. It uses the same software as Enzo's index, which is no longer updated.</li> </ul> <ul> <li>The obsolete and deprecated XMLLibrary and XMLSpider plugins are no longer officially supported. They will still load for those who have them added, but are no longer shown on the plugin page.</li> <li>In the interests of releasing this build more quickly, the new version of FlogHelper does not support exporting and importing backups from the web UI. The old backup code did not work with the new Freenet version after removing db4o. People can instead back up "plugins.floghelper.FlogHelper" files in the plugin-data directory. These can be dropped into the directory after unloading FlogHelper to restore a backup.</li> <li>ThawIndexBrowser works again. Thanks saces!</li> </ul> <ul> <li>Fred translations are updated.</li> </ul> <ul> <li>Add two seed nodes, one sponsored by meshnet.pl - the Polish radio/meshnet darknet users group, and another run by ArneBab. Thanks!</li> <li>Update existing seed node references.</li> </ul> <p> Thank you for using Freenet! </p>
fr: <p> L’équipe Freenet est très heureuse de vous annoncer la version stable de Freenet 0.7.5 version 1468. </p> <p> <b>Notes importantes</b> : la mise à jour inférieure à partir de la version 1468 n’est pas prise en charge ; si vous souhaitez revenir à la version 1467 sans perdre les files de téléversement et de téléchargement, <b>avant</b> de mettre à niveau, sauvegardez les fichiers et répertoires suivants : master.keys, persistent-temp-*/, et node.db4o (voir https://wiki.freenetproject.org/Program_files ). Veuillez prendre note que les transferts en cours seront aussi relancés de zéro. Rappel à ceux qui testent la mise à jour automatique vers 1468-pre4 : veuillez restaurer votre clé de mise à jour automatique à la valeur par défaut. Une façon de le faire est d’arrêter Freenet, de supprimer la ligne « node.updater.URI » dans freenet.ini, et de relancer Freenet. </p> <p> Dans cette version, la manière dont Freenet stocke localement les données a complètement changé et n’utilise plus le stockage d’objets db4o qui est maintenant déconseillé. Il a été remplacé par le fruit de l’été de labeur de toad, un format sur disque personnalisé qui résiste beaucoup mieux à la corruption tout en étant plus efficace. </p> <ul> <li>Les téléchargements et téléversements existants non terminés seront importés dans un nouveau format qui exige qu’ils soient relancés de zéro.</li> <li>L’espace pour les téléchargements est maintenant attribué au début, et les machines avec peu d’espace pourraient être à court, se qui entraînera l’échec temporaire des téléchargements jusqu’à ce que plus d’espace soit libéré.</li> <li>Les correctifs de bogues des métadonnées entraîneront un changement des CHK.</li> <li>Certains greffons non officiels devront être mis à jour, à cause de changements d’API. Sone fonctionne déjà, ainsi que tous les greffons officiels.</li> <li>Les changements des files d’attente rendront quasiment impossible la perte d’une file dans son entier : l’impact d’une corruption sera presque toujours local.</li> <li>Les multiconteneurs / téléversements de site peuvent maintenant être persistants, ce qui facilite le téléversement de sites volumineux.</li> <li>La sécurité physique protégée par mot de passe est encore plus robuste. (Le chiffrement intégral du disque est encore préférable).)</li> </ul> <ul> <li>Le programme d’installation pour Windows démarre maintenant Freenet par défaut lors de la connexion.</li> <li>Une <a href="https://github.com/freenet/wintray">nouvelle appli de zone de notification pour Windows</a> proposant des fonctions utiles est incluse dans les nouvelles installations. Si vous utilisez l’appli de zone de notification pour Windows existante, vous pouvez télécharger la nouvelle <a href="https://downloads.freenetproject.org/alpha/installer/FreenetTray.exe.build01468">ici</a>. Il est inutile de la mettre dans un répertoire particulier, elle essaiera l’emplacement d’installation par défaut et vous demandera si elle ne peut pas le trouver.</li> </ul> <ul> <li>La liste de clés de téléchargements a été déplacée de downloads/listFetchKeys.txt à downloads/listKeys.txt.</li> <li>Une liste de clés de téléversement est maintenant accessible à uploads/listKeys.txt</li> </ul> <ul> <li>L’index de Gantros se trouve maintenant dans les marque-pages par défaut. Il utilise les mêmes logiciels que l’index d’Enzo, qui n’est plus mis à jour.</li> </ul> <ul> <li>Les greffons XMLLibrary et XMLSpider qui sont obsolètes et déconseillés ne sont plus pris en charge officiellement. Ils se chargeront encore pour ceux qui les ont ajoutés, mais ne sont plus proposés sur la page des greffons.</li> <li>Afin de pouvoir publier cette version plus rapidement, la nouvelle version de FlogHelper ne prend pas en charge l’exportation et l’importation de sauvegardes à partir de l’IU Web. L’ancien code de sauvegarde n’a pas fonctionné avec la nouvelle version de Freenet après avoir enlevé db4o. Les utilisateurs peuvent à la place sauvegarder les fichiers « plugins.floghelper.FlogHelper » dans le répertoire plugin-data. Ils peuvent être déposés dans le répertoire après avoir déchargé FlogHelper pour restaurer une sauvegarde.</li> <li>ThawIndexBrowser fonctionne à nouveau. Merci à saces !</li> </ul> <ul> <li>Les traductions de Fred ont été mises à jour.</li> </ul> <ul> <li>Ajout de deux nœuds de propagation, l’un commandité par meshnet.pl - le groupe d’utilisateurs radio/réseau maillé réseau invisible polonais, un autre par ArneBab. Merci !</li> <li>Les références des nœuds de propagation existants ont été mises à jour.</li> </ul> <p> Nous vous remercions d’utiliser Freenet ! </p>

source: 2015-06-27 - New Windows installer and tray app
fr: 2015-06-27 - Nouveau programme d’installation et nouvelle appli de zone de notification pour Windows

source: <p> The Windows installer is updated with Java 8u45, a <a href="https://github.com/freenet/wintray#freenet-tray-application">new tray application</a>, and is newly translated into: </p> <ul> <li>Czech</li> <li>German</li> <li>Greek</li> <li>Indonesian</li> <li>Italian</li> <li>Polish</li> <li>Brazilian Portuguese</li> <li>Simplified Chinese</li> </ul>
fr: <p> Le programme d’installation pour Windows est mis à jour vers Java 8u45, présente une <a href="https://github.com/freenet/wintray#freenet-tray-application"> nouvelle appli de zone de notification</a>, et est maintenant traduit en : </p> <ul> <li>Tchèque</li> <li>Allemand</li> <li>Grec</li> <li>Indonésien</li> <li>Italien</li> <li>Polonais</li> <li>Portugais (Brésil)</li> <li>Chinois simplifié</li> </ul>

source: 2015-06-24 - Upcoming installer and testing releases
fr: 2015-06-24 - Programme d’installation à venir et versions de test

source: <p> This weekend we will release an updated Windows installer for build 1467 along with a <a href="https://github.com/freenet/wintray/blob/master/README.md">new Windows tray application</a>. We will also release 1468-pre4, which if all goes according to plan will be the last prerelease before a stable release two weeks later. </p> <p> If you'd like to help with translations before then please do so! The Windows-related resources are: </p> <ul> <li><a href="https://www.transifex.com/projects/p/freenet/resource/windows-installer/">Windows installer</a></li> <li><a href="https://www.transifex.com/projects/p/freenet/resource/windows-tray-commands/">Windows tray commands</a></li> <li><a href="https://www.transifex.com/projects/p/freenet/resource/windows-tray-common/">Windows tray common</a></li> <li><a href="https://www.transifex.com/projects/p/freenet/resource/windows-tray-crash/">Windows tray crash</a></li> <li><a href="https://www.transifex.com/projects/p/freenet/resource/windows-tray-preferences/">Windows tray preferences</a></li> </ul> <p> Some of the Windows tray resources contain many strings tagged notranslate; to hide these search for Tags: translate. </p>
fr: <p> Cette fin de semaine, paraîtra un programme d’installation pour Windows mis à jour pour la version 1467, ainsi qu’une <a href="https://github.com/freenet/wintray/blob/master/README.md">nouvelle appli de zone de notification pour Windows</a>. La version 1468-pre4 paraîtra aussi, et si tout va comme prévu, elle sera la dernière préversion avant la version stable deux semaines plus tard. </p> <p> Si vous souhaitez nous aider à traduire avant cela, n’hésitez pas ! Les ressources Windows sont : </p> <ul> <li><a href="https://www.transifex.com/projects/p/freenet/resource/windows-installer/">Programme d’installation pour Windows</a></li> <li><a href="https://www.transifex.com/projects/p/freenet/resource/windows-tray-commands/">Commandes - zone de notification Windows</a></li> <li><a href="https://www.transifex.com/projects/p/freenet/resource/windows-tray-common/">Commun - zone de notification Windows</a></li> <li><a href="https://www.transifex.com/projects/p/freenet/resource/windows-tray-crash/">Plantage - zone de notification Windows</a></li> <li><a href="https://www.transifex.com/projects/p/freenet/resource/windows-tray-preferences/">Préférences - zone de notification Windows</a></li> </ul> <p> Certaines ressources de la zone de notification Windows contiennent de nombreuses chaînes marquées « notranslate » ; pour les faire disparaître, chercher Tags: translate. </p>

source: 2015-05-22 - UN Report: Encryption and Anonymity Deserve Strong Protection
fr: 2015-05-22 - Rapport de l’ONU : le chiffrement et l’anonymat méritent une protection solide (Encryption and Anonymity Deserve Strong Protection)

source: The UN Special Rapporteur published [a report on encryption, anonymity, and the human rights framework](http://www.ohchr.org/EN/Issues/FreedomOpinion/Pages/CallForSubmission.aspx) ([doc](http://www.ohchr.org/EN/HRBodies/HRC/RegularSessions/Session29/Documents/A.HRC.29.32_AEV.doc), [companion pdf](http://www.ohchr.org/Documents/Issues/Opinion/Communications/States/Selected_References_SR_Report.pdf)). From the summary: > encryption and anonymity enable individuals to exercise their rights to freedom of opinion and expression in the digital age. The reports concludes that > 63\. The use of encryption and anonymity tools and better digital literacy should be encouraged. The Special Rapporteur, recognizing that the value of encryption and anonymity tools depends on their widespread adoption, encourages States, civil society organizations and corporations to engage in a campaign to bring encryption by design and default to users around the world and, where necessary, to ensure that users at risk be provided the tools to exercise their right to freedom of opinion and expression securely. We with the Freenet Project welcome the official recognition of our mission as important part of securing human rights in the digital age and we invite everyone - especially reporters and civil society organizations - to install Freenet and its communication tools to provide a point of contact for users at risk.
fr: Le rapporteur spécial de l’ONU a oublié [un rapport sur le chiffrement, l’anonymat et le cadre des droits de la personne](http://www.ohchr.org/EN/Issues/FreedomOpinion/Pages/CallForSubmission.aspx) ([document](http://www.ohchr.org/EN/HRBodies/HRC/RegularSessions/Session29/Documents/A.HRC.29.32_AEV.doc), [PDF d’accompagnement](http://www.ohchr.org/Documents/Issues/Opinion/Communications/States/Selected_References_SR_Report.pdf)). Extrait du résumé : > le chiffrement et l’anonymat permettent aux individus d’exercer leurs droits à la liberté d’opinion et d’expression à l’ère numérique. Les rapports concluent que > 63\. L’utilisation d’outils de chiffrement et d’anonymat et une meilleure littératie numérique devraient être encouragées. Le rapporteur spécial, reconnaissant que la valeur des outils de chiffrement et d’anonymat dépend de leur adoption généralisée, encourage les états, les organisations de la société civile et les entreprises à s’engager dans une campagne visant à offrir le chiffrement dès la conception et par défaut aux utilisateurs du monde entier et, où cela est nécessaire, de garantir que les outils permettant d’exercer leurs droits de liberté d’opinion et d’expression en toute sécurité soient fournis aux utilisateurs en danger . Nous, avec le Projet Freenet, saluons la reconnaissance officielle de notre mission comme majeure pour garantir les droits de la personne à l’ère numérique, et nous invitons tout le monde, particulièrement les reporteurs et les organisations de la société civile, à installer Freenet et ses outils de communication afin de fournir un point de contact pour les utilisateurs en danger.

source: 2015-04-14 - SUMA Award Acceptance Speech (video)
fr: 2015-04-14 - Discours d’acceptation du trophée SUMA (vidéo)

source: The video from the talk given when Freenet [received the SUMA Award 2015](#20150211) for being the best project against surveillance and espionage on the Internet is available on [the Award page][url_award] and [on YouTube][url_youtube]: {embed_youtube} The Freenet Project receives the SUMA award and Arne Babenhauserheide accepts the prize as representative of the project. Arne then presents the current capabilities of Freenet to regain confidential and pseudonymous speech on the Internet, along with a vision of how whistleblowers could use Freenet to contact journalists without spilling their identity.
fr: La vidéo de la présentation donnée quand [le Trophée SUMA 2015 a été remis](#20150211) à Freenet en tant que meilleur projet contre la surveillance et l’espionnage sur Internet se trouve sur [la page des récompenses][url_award] et [sur YouTube][url_youtube]: {embed_youtube} Le Projet Freenet reçoit le Trophée SUMA et Arne Babenhauserheide accepte la récompense à titre de représentant du projet. Arne présente ensuite les capacités actuelles de Freenet pour rétablir une expression confidentielle et pseudonyme sur Internet, ainsi qu’une vision dans laquelle les lanceurs d’alerte utiliseraient Freenet afin de contacter des journalistes sans dévoiler leur identité.

source: 2015-03-29 - New Linux/Unix/OS X installer
fr: 2015-03-29 - Nouveau programme d’installation pour Linux/Unix/OS X

source: The installer for Linux, Unix, and Mac OS X is updated to better detect Java.
fr: Le programme d’installation pour Linux, Unix, et Mac OS X est mis à jour afin de mieux détecter Java.

source: 2015-03-15 - Progress toward build 1468
fr: 2015-03-15 - Progrès vers la version 1468

source: Build 1468 continues to make progress toward release. What is done: * Replace the unreliable db4o database. (Yay!) * Create more flexible Windows tray app. * Update Windows installer translations for Finnish and French. * Add Windows installer translations for Czech, German, Italian, Polish, Brazilian Portuguese, and Simplified Chinese. * Improve the reliability of starting Freenet under changing Java installations on Linux/OS X/POSIX. * Update WebOfTrust with bug fixes and a new API. What remains to be done: * <del>Finish reviewing the synchronous plugin communication API. Review is split between [GitHub](https://github.com/freenet/fred/pull/319) and more recently the [development mailing list](https://emu.freenetproject.org/pipermail/devl/2015-February/037986.html).</del> -- Done 2015-03-28 * Update all plugins (KeyUtils and WebOfTrust are already ready) for the API breakage in this version. * Add a .NET 3.5 install to the Windows installer, along with the new tray app. (This is necessary for it to always work for those not on Windows 7.) * Everything on [this list](https://bugs.freenetproject.org/roadmap_page.php?version_id=85). Because this is such a large release new installers for build 1467 will be released shortly to test those changes. Once everything on this list is complete, there will be a release candidate, then finally the stable release.
fr: La version 1468 continue à progresser vers la version finale. Ce qui est fait : * Remplacement de la base de données db4o non fiable. (Hourra !) * Création d’une appli de zone de notification plus souple pour Windows. * Mise à jour des traductions en finnois et en français du programme d’installation pour Windows. * Ajout des traductions en tchèque, allemand, italien, polonais, portugais (Brésil) et chinois simplifié du programme d’installation pour Windows. * Amélioration de la fiabilité du démarrage de Freenet sous des installations de Java changeantes sous Linux/OS X/POSIX. * Mise à jour de la toile de confiance « WebOfTrust », avec des correctifs de bogues et une nouvelle API. Ce qu’il reste à faire : * <del>Finir la révision de l’API de communication des greffons synchrones. La révision est partagée entre [GitHub](https://github.com/freenet/fred/pull/319) et plus récemment la [liste de diffusion de développement](https://emu.freenetproject.org/pipermail/devl/2015-February/037986.html).</del> -- Fait le 2015-03-28. * Mise à jour de tous les greffons (UtilClé et WebOfTrust sont déjà prêts) pour le bris d’API dans cette version. * Ajout d’une installation de .NET 3.5 au programme d’installation sous Windows, ainsi que la nouvelle appli de zone de notification. (Nécessaire pour que cela fonctionne toujours pour ceux qui ne sont pas sous Windows 7.) * Tout ce que est sur [cette liste](https://bugs.freenetproject.org/roadmap_page.php?version_id=85). Cette version est tellement imposante que de nouveaux programmes d’installation pour la version 1467 paraîtront sous peu afin de tester ces changements. Une fois que tout ce qui est sur liste sera terminé, il y aura une version d’évaluation, puis enfin la version stable.

source: 2015-03-14 - Freenet translation joins Localization Lab
fr: 2015-03-14 - Freenet s’associe au Labo de localisation pour ses traductions

source: The Freenet Project has joined the [Localization Lab](http://www.localizationlab.org) organization on Transifex. This allows a larger team of translators, translating into more languages, and access to paid support. If this transition has caused any problems please let us know!
fr: Le Projet Freenet s’est associé au [Labo de localisation](http://www.localizationlab.org) sur Transifex, où de plus grandes équipes linguistiques traduisent en plus de langues, tout en offrant l’accès à une assistance payante. Si cette transition vous a causé des problèmes, informez-nous-en !

source: 2015-02-15 - New Windows tray app for testing
fr: 2015-02-15 - Nouvelle appli de zone de notification à tester

source: The Windows tray application distributed as of build 1467 is written in the automation scripting language AutoHotKey. It has not been well-maintained and is also often falsely detected by antivirus by virtue of the language it uses. We are pleased to announce a new Windows tray application written in C# which has some additional features: * Allow choosing which browser to launch. * Allow starting Freenet without the tray on startup. * Allow opening the Downloads folder from the menu. * Give a more actionable response to crashes. * Can be hidden while keeping Freenet running. * Can be located other places than in the Freenet installation folder. If all goes well we plan for this tray app to be distributed with build 1468. Testing is appreciated! If you'd like to try it for yourself you can find it [here](https://downloads.freenetproject.org/FreenetTray-testing-eaf31ea.exe). Please let us know how it goes and if you'd like to see any changes.
fr: L’application de zone de notification pour Windows distribuée dès la version 1467 est écrite dans le langage de script d’automation AutoHotKey. Il n’a pas été bien maintenu et est aussi souvent détecté à tort par les antivirus compte tenu du langage qu’il utilise. Nous sommes heureux d’annoncer une nouvelle application de zone de notification pour Windows écrite en C# et qui offre des fonctions supplémentaires : * Permettre de choisir quel navigateur lancer. * Permettre de lancer Freenet au démarrage sans zone de notification. * Permettre d’ouvrir le dossier des Téléchargements à partir du menu. * Donner une réponse au plantage qui propose des actions. * Peut être dissimulée lors de l’exécution de Freenet. * Peut se situer ailleurs que dans le dossier d’installation de Freenet. Si tout va bien, nous prévoyons que cette appli sera distribuée avec la version 1468. Nous vous invitons à la tester ! Si vous souhaitez l’essayer, vous pouvez la trouver [ici](https://downloads.freenetproject.org/FreenetTray-testing-eaf31ea.exe). Veuillez nous indiquer comment elle fonctionne et si vous souhaiteriez des changements.

source: 2015-02-11 - Freenet received the SUMA Award 2014/15
fr: 2015-02-11 - Freenet a reçu le Trophée SUMA 2014/15
