Repository: hyphanet/website
Catalog: locales/*/LC_MESSAGES/freenet_site.po
Languages: fr

source: Although countless people have given their time and skill to the project since its inception, The Freenet Project relies on your donations to cover hosting and administrative costs (i.e. domain registrations and certificates). If we have enough funds, we can hire developers to work on Freenet. Freenet is a platform for censorship-resistant communication and publishing. For the past 15 years the project has built tools to fight for freedom of speech and information. Our software provides a decentralized peer-to-peer network designed to hide who publishes or accesses potentially controversial information - or even that it exists - especially useful for those living in oppressive political regimes. While development is primarily driven by volunteers, the project has also employed paid developers to provide more focused work. Over the past 2 years, the project's paid developer has made great progress improving “Web of Trust” functionality to combat spam, which is a central problem in any anonymous system. Unfortunately, the Freenet Project no longer has enough money to retain his services, so he is now a volunteer. This greatly reduces his capacity to continue this important work. We are excited for the future of Freenet and the projects built on top of it. There is so much more work to do, and full-time developers greatly benefit the project. Help us keep Internet freedom alive and expand human liberty. [Learn more about our fundraiser.][url_fundraiser] All support is very much appreciated.
fr: Bien qu’un nombre incalculable de personnes aient consacré leur temps et leurs talents au projet depuis sa création, le Projet Freenet dépend de vos dons afin de couvrir les coûts d’hébergements et administratifs (c.-à-d. les enregistrements de domaines et les certificats). Si nous disposons de fonds suffisants, nous pouvons embaucher des développeurs afin de travailler sur Freenet. Freenet est une plateforme de communication et de publication qui résiste à la censure. Depuis 15 ans, le projet a développé des outils pour préserver la liberté d’expression et de circulation de l’information. Notre logiciel fournit un réseau pair à pair décentralisé conçu pour dissimuler qui publie ou accède à des informations potentiellement controversées — ou bien même qu’elles existent — ce qui est particulièrement utile pour les personnes qui vivent sous le joug de régimes politiques oppressifs. Bien que le développement soit principalement mené par des bénévoles, le projet a aussi employé des développeurs rémunérés afin de fournir un travail plus ciblé. Au cours des deux dernières années, le développeur rémunéré du projet a grandement amélioré le fonctionnement de toile de confiance « Web of Trust » afin de combattre le pollupostage qui est un problème majeur de tout système anonyme. Malheureusement, le Projet Freenet n’a plus assez d’argent pour recourir à ses services, et il est donc maintenant bénévole, ce qui diminue considérablement sa capacité à poursuivre ce travail important. Le futur de Freenet et des projets qui en découlent nous enthousiasme. Il y a tant à accomplir, et des développeurs à temps plein profitent grandement au projet. Aidez-nous à préserver la liberté sur Internet tout en promulguant la liberté humaine. [Apprenez-en davantage sur notre collecte de fonds.][url_fundraiser] Tout soutien est grandement apprécié.

source: Sponsors
fr: Commanditaires

source: The following persons, organisations and companies have generously sponsored this project through donations or discounts on hardware and services:
fr: Les personnes, organismes et compagnies suivantes ont généreusement commandité Freenet par leurs dons et remises sur le matériel et les services :

source: * [John Pozadzides][url_john_pozadzides] John is the founder of HTMLHelp.com and former Vice President of Sales for SAVVIS Communications. John has donated $10,000 to the Freenet Project to fund ongoing development of the Freenet software.
fr: * [John Pozadzides][url_john_pozadzides] John est le fondateur de HTMLHelp.com et ancien vice-président des ventes pour SAVVIS Communications. John a contribué 10 000 $ au Projet Freenet pour financer le développement continu du logiciel Freenet.

source: * [Web Hosting Search][url_web_hosting_search] WebHostingSearch is a top rated guide to various world wide web hosting companies. Mr Chris Reynolds and the friendly team behind this company have become one of our proud promoters.
fr: * [Web Hosting Search][url_web_hosting_search] WebHostingSearch est l’un des premiers guides en matière de compagnies d’hébergement du Web. M. Chris Reynolds et l’équipe amicale derrière l’entreprise sont devenus un de nos fiers promoteurs.

source: * [John Gilmore][url_john_gilmore] John Gilmore is one of the founders of the Electronic Frontier Foundation, the Cypherpunks mailing list, and Cygnus Solutions. He created the alt.* hierarchy in Usenet and is a major contributor to the GNU project. He has donated $10,000.
fr: * [John Gilmore][url_john_gilmore] John Gilmore est l’un des fondateurs de la fondation Frontière électronique, de la liste de diffusion « Cypherpunks » et de « Cygnus Solutions ». Il a créé la hiérarchie alt.* dans Usenet et a contribué de manière importante au projet GNU. Il a fait un don de 10 000 $.

source: * [Bytemark Hosting][url_bytemark_hosting] Bytemark provides discounted hosting facilities to Freenet and comes with our highest recommendation.
fr: * [Bytemark Hosting][url_bytemark_hosting] Bytemark fournit des installations d’hébergements à prix préférentiel à Freenet et nous les recommandons vivement.

source: * [zoozle Torrent Search][url_zoozle] zoozle is a search engine for BitTorrent and P2P networks. It is also available in [german][url_zoozle_german] and [french][url_zoozle_french]. They have donated $1,500.
fr: * [Recherche Torrent zoozle][url_zoozle] zoozle est un moteur de recherche pour les réseaux BiTorrent et P2P. Il est aussi proposé en [allemand][url_zoozle_german] et en [français][url_zoozle_french]. Ils ont fait un don de 1 500 $.

source: * [YourKit, LLC][url_yourkit] YourKit is kindly supporting Freenet by providing us a free of charge license of its full-featured Java Profiler. YourKit, LLC is the creator of innovative and intelligent tools for profiling Java applications. You can learn more about [YourKit Java Profiler][url_yourkit_profiler] following the link.
fr: * [YourKit, LLC][url_yourkit] YourKit offre un soutien aimable à Freenet en nous fournissant une licence gratuite de leur profileur Java complet. YourKit, LLC est le créateur d’outils innovants et intelligents permettant le profilage d’applications Java. Vous pouvez en apprendre davantage sur le [profileur Java YourKit][url_yourkit_profiler] en suivant ce lien.

source: * [Google][url_google] Google [open source][url_google_opensource] have three times donated $18,000, as well as paying for students to work with us over summer since 2006 through the [Google Summer of Code][url_google_soc] program.
fr: * [Google][url_google] Google [« open source »][url_google_opensource] a fait trois dons de 18 000 $, et a aussi rémunéré les étudiants qui ont travaillés avec nous durant l’été depuis 2006 par le biais du programme de travail d’été [« Google Summer of Code »][url_google_soc].

source: * [Finanzvergleich][url_finanzvergleich] Finanzvergleich is a German financial services comparison site, who have contributed $1,500.
fr: * [Finanzvergleich][url_finanzvergleich] Finanzvergleich est un site allemand de comparaison de services financiers. Ils ont participé à hauteur de 1 500 $.

source: * [TopDir][url_topdir] TopDir is a human edited web directory with informations about interesting topics and websites in the German language.
fr: * [TopDir][url_topdir] TopDir est un annuaire rédigé par des personnes, et présentant des informations sur des sujets et sites Web intéressants, en allemand.

source: * [All Filters][url_allfilters] - another generous sponsor.
fr: * [Tous les filtres][url_allfilters] - un autre commanditaire généreux.

source: * [A German Site for Gardening and Plants][url_gartenheinz] - another generous sponsor.
fr: * [Un site allemand sur le jardinage et les plantes][url_gartenheinz] - un autre commanditaire généreux.

source: * [Simple Car Rentals][url_simple_carrentals] Simple Car Rentals has generously supported Freenet by helping us with some of our administrative expenses over the years.
fr: * [Simple Car Rentals][url_simple_carrentals] « Simple Car Rentals » a généreusement soutenu Freenet en nous aidant à payer une partie de nos frais administratifs au cours des années.

source: * [The Sports Den][url_sportsden] The Sports Den has a wide variety of outdoor sports equipment, they are based in Ireland but can ship to the UK, Europe, and the United States.
fr: * [The Sports Den][url_sportsden] « The Sports Den » propose une vaste gamme d’équipements de sports d’extérieur. Ils se trouvent en Irlande, mais peuvent aussi expédier leurs produits vers le R.-U., l’Europe et les États-Unis.

source: * ![][logo_intellij_idea] [JetBrains][url_jetbrains] has kindly provided a license for the Ultimate edition of [IntelliJ IDEA][url_intellij_idea].
fr: * ![][logo_intellij_idea] [JetBrains][url_jetbrains] nous a aimablement fourni une licence pour la version « Ultimate » d’[IntelliJ IDEA][url_intellij_idea].

source: Freenet Project Inc does not necessarily endorse the business activities of all of the companies listed on this page. Donation inquiries please contact Ian Clarke: {donate_email}
fr: « Freenet Project Inc » ne cautionne pas nécessairement les activités commerciales de toutes les compagnies listées sur cette page. Pour toute demande concernant les dons, veuillez contacter Ian Clarke : {donate_email}

source: Store
fr: Boutique

source: Thanks for your donation!
fr: Nous nous remercions de votre don !

source: We have received your generous donation. It will be used at the direction of the Freenet Board to advance the interests of the Freenet Project. If you have any questions about how your donation will be used please contact Ian Clarke: {donate_email}.
fr: Nous avons reçu votre don généreux. Le conseil d’administration de Freenet l’utilisera afin de promouvoir les intérêts du Projet Freenet. Si vous avez des questions concernant l’utilisation de votre don, veuillez contacter Ian Clarke : {donate_email}.

source: Thanks
fr: Remerciements

source: Download
fr: Téléchargement

source: To access Freenet, you first need to install the main application. Freenet will run in the background and you can use your browser to change settings and access content. There are other applications that you can install at a later time to add more functionality. Steps: * [Download and install Freenet][autostart] * [Add friends (or connect to strangers)][add_friends] * [Start using Freenet!][usage]
fr: Pour accéder à Freenet, vous devez d’abord installer l’application principale. Freenet s’exécutera en arrière-plan et vous pourrez utiliser votre navigateur pour en changer les paramètres et accéder au contenu. Il existe d’autres applications que vous pourrez installer ultérieurement afin d’ajouter d’autres fonctions. Étapes : * [Télécharger et installer Freenet][autostart] * [Ajouter des amis (ou se connecter à des inconnus)][add_friends] * [Commencer à utiliser Freenet !][usage]

source: Show installation instructions for:
fr: Montrer les instructions d’installation pour :

source: *Freenet is free and open source software available under GPLv2+. The source code is on [GitHub][github_freenet].*
fr: *Freenet est un logiciel libre et ouvert, proposé sous licence GPLv2+. Le code source se trouve sur [GitHub][github_freenet].*

source: ### Windows Download and run [the installer](assets/jnlp/FreenetInstaller.exe)
fr: ### Windows Télécharger et exécuter [le programme d’installation](assets/jnlp/FreenetInstaller.exe)

source: Download Freenet
fr: Télécharger Freenet

source: ([try this if the first link is blocked](https://downloads.freenetproject.org/latest/FreenetInstaller.exe)) ([gpg signature][url_gpg_sig]; [keyring][url_keyring]) It will automatically install Freenet and other required components for you. When done, your default browser will automatically open up to Freenet's web-based user interface. ![](assets/img/install/1-langselect-windows.png) Freenet requires Windows XP or later.
fr: ([essayez ceci si le premier lien est bloqué](https://downloads.freenetproject.org/latest/FreenetInstaller.exe)) ([signature gpg][url_gpg_sig] ; [trousseau][url_keyring]) Il installera automatiquement Freenet et les autres composants exigés. Une fois terminé, votre navigateur par défaut s’ouvrira automatiquement sur l’interface Web de Freenet. ![](assets/img/install/1-langselect-windows.png) Freenet exige Windows XP ou ultérieure.

source: ### OS X Download and run [the installer][url_mac_installer] ([gpg signature][url_gpg_sig]; [keyring][url_keyring]).
fr: ### OS X Télécharger et exécuter [le programme d’installation][url_mac_installer] ([signature gpg][url_gpg_sig]; [trousseau][url_keyring]).

source: Download Freenet for OSX
fr: Télécharger Freenet pour OS X

source: It will automatically install Freenet and other required components for you. When done, your default browser will automatically open up to Freenet's web-based user interface. ![](assets/img/mactray/osx_installer_step2_transparent.png) Freenet requires OS X 10.8 or later.
fr: Il installera automatiquement Freenet et les autres composants exigés. Une fois terminé, votre navigateur par défaut s’ouvrira automatiquement sur l’interface Web de Freenet. ![](assets/img/mactray/osx_installer_step2_transparent.png) Freenet exige OS X 10.8 ou ultérieure.

source: ### GNU/Linux & POSIX Try the [Java Web Start installer](assets/jnlp/freenet.jnlp).
fr: ### GNU/Linux et POSIX Essayer le [programme d’installation Java Web Start](assets/jnlp/freenet.jnlp).

source: Install Freenet
fr: Installer Freenet

source: Now follow the installer: ![](assets/img/install/1-langselect.png) If it doesn't work: You need to have a recent **Java Runtime Environment** (JRE). We have experienced best results with Oracle's Java Runtime Environment which can be obtained via your [package manager]( https://en.wikipedia.org/wiki/Package_manager) or from [ http://www.java.com/](http://www.java.com/). Java version {java_required} or higher is required, and version {java_recommended} or higher is strongly recommended. You should keep Java up to date to avoid problems and for better performance. Open a terminal and run:
fr: Suivez maintenant le programme d’installation : ![](assets/img/install/1-langselect.png) Si cela ne fonctionne pas : Il vous faut un **environnement d’exécution Java*** (JRE) récent. Nous avons obtenu les meilleurs résultats avec l’environnement d’exécution Java d’Oracle que vous pouvez obtenir grâce à votre [gestionnaire de paquets]( https://fr.wikipedia.org/wiki/Gestionnaire_de_paquets) ou sur [ http://www.java.com/](http://www.java.com/). Java version {java_required} ou ultérieure est exigée, et la version {java_recommended} ou ultérieure est fortement recommandée. Vous devriez garder Java à jour afin d’éviter les problèmes et obtenir de meilleures performances. Ouvrez un terminal et exécutez :

source: Alternatively, downloading [the installer](assets/jnlp/freenet_installer.jar) ([gpg signature][jar_sig]; [keyring][url_keyring]) and then clicking on the file may work on some systems, but if there are problems we recommend the above command lines. If wget is not installed, it can be installed with a package manager, such as sudo apt-get install wget on Debian or Ubuntu. If the link above is blocked, you could download it from our server [here](https://downloads.freenetproject.org/latest/new_installer_offline.jar). But please use the other link if you can. **Note**: Many GNU/Linux distributions no longer ship with Java Web Start enabled. We would like to make distribution packages for easier installation, and have an in-development (and not maintained) [Debian package]( https://github.com/freenet/debian), but haven't gotten it stable or made official ones for other distributions. If you are a developer and would like to join us and help it would be much appreciated! If this doesn't work on a headless server, try "java -jar new_installer_offline.jar -console", and follow the prompts to tell it where to install Freenet etc.
fr: Par ailleurs, télécharger [le programme d’installation](assets/jnlp/freenet_installer.jar) ([signature gpg][jar_sig] ; [trousseau][url_keyring]) et cliquer par la suite sur le fichier pourrait fonctionner sur certains systèmes, mais si des problèmes apparaissent, nous recommandons les lignes de commandes ci-dessus. Si wget n’est pas installé, il peut l’être grâce à un gestionnaire de paquets, tel que sudo apt-get install wget sur Debian ou Ubuntu. Si le lien ci-dessus est bloqué, vous pouvez le télécharger [ici](https://downloads.freenetproject.org/latest/new_installer_offline.jar) de notre serveur. Mais veuillez si possible utiliser l’autre lien. **Note :** de nombreuses distributions GNU/Linux ne contiennent plus Java Web Start. Nous aimerions assembler des paquets de distribution pour faciliter l’installation, et proposer un [paquet Debian]( https://github.com/freenet/debian) en développement (mais non maintenu), mais nous n’en avons pas de stable, ni n’en avons assemblé d’officiels pour d’autres distributions. Si vous êtes un développeur et souhaitez vous joindre à nous afin de nous aider, ce serait très apprécié ! Si cela ne fonctionne pas sur un serveur sans affichage, essayez « java -jar new_installer_offline.jar -console », et suivez les invites pour indiquer où installer Freenet, etc.

source: ### Mirrored installation If you have a working Freenet installation directory that you have mirrored from one Unix machine to another (e.g. via rsync or unison), enabling the mirrored installation is not difficult. Nothing in a Freenet installation cares about its host's IP address; it can't, or Freenet would fail on machines that get IP addresses from a DHCP pool. All you actually need to do is tell the system you've mirrored to that it should start the Freenet proxy daemon for you on boot. Do `crontab -l` on the source machine, find the line that is tagged "FREENET AUTOSTART" and add that to your crontab on the mirrored machine. However: each installation has a unique identity key generated at installation time. If you try to run two instances with the same identity _at the same time_, both proxy demons will become confused and upset. Don't do this!
fr: ### L’installation miroir Si vous disposez du répertoire d’une installation fonctionnelle de Freenet que vous avez copié d’une machine Unix à l’autre (p. ex. par rsync ou unison), il est facile d’activer l’installation miroir. Dans une installation Freenet, rien ne fait attention à l’adresse IP de son hôte ; ça ne se peut juste pas ou Freenet ne fonctionnerait pas sur les machines qui obtiennent leurs adresses IP d’un bassin commun DHCP. Tout ce que vous avez vraiment besoin de faire est de dire au système que vous avez copié qu’il devrait lancer pour vous le démon de serveur mandataire de Freenet au démarrage. Exécutez « crontab -l » sur la machine source, trouvez la ligne étiquetée « FREENET AUTOSTART » et ajoutez-la au crontab de la machine copiée. Cependant, chaque installation à une clé d’identité unique générée au moment de l’installation. Si vous tentez d’exécuter deux instances portant la même identité -au même moment-, les deux démons de serveur mandataire seront confus et contrariés. Ne le faites pas !

source: Using Freenet
fr: Utiliser Freenet

source: Please try the [step by step guide][url_freesocial] to setting up Freenet and various Freenet apps, especially if installing on OS X. We are not responsible for unofficial third party apps it recommends (including FMS), but many Freenet users and developers use them.
fr: Veuillez essayer le [guide pas à pas][url_freesocial] sur comment configurer Freenet et diverses applis Freenet, particulièrement lors de l’installation sur OS X. Nous ne sommes pas responsables des applis tierces non officielles qu’il recommande (incluant FMS), mais de nombreux utilisateurs et développeurs les utilisent.

source: ### Firewalls and routers Freenet should work fine with most routers, but if you are having problems and you have a firewall or router, click [**here**](help.html#firewall) for some info.
fr: ### Les pare-feu et routeurs Freenet devrait fonctionner sans problème avec la plupart des routeurs, mais si vous éprouvez des problèmes et si vous avez un pare-feu ou un routeur, cliquez [**ici**](help.html#firewall) pour obtenir des renseignements.
