Repository: hyphanet/website
Catalog: locales/*/LC_MESSAGES/freenet_site.po
Languages: fr

source: The documentation on Freenet is forever changing, since this is a project in development. However, here under the Documentation menu, you may find usage documents on how to setup Freenet and use the most popular Freenet tools as well as a user driven Wiki and an extensive Frequently Asked Questions department. * [**Install**](#install) Contains detailed instructions on how to install Freenet using the new installer. * [**Connect**](#connect) How to connect to Freenet. * [**Content**](#content) Freenet as a Content Distribution System. * [**Understand**](#understand) Explains the workings of Freenet, and a glossary with the most frequently used terms. * [**Social**](#social) How to setup email, forums and microblogging over Freenet. * [**jSite**](#jsite) jSite is a Freenet website (a.k.a. Freesite) insertion tool. * [**Wiki**](https://wiki.freenetproject.org/) The Freenet Wiki is a user driven space where new features may be described before finding their way into the website. It is a good source of information about all sorts of Freenet related issues.
fr: La documentation de Freenet est en changement perpétuel dans la mesure où Freenet est un projet en développement. Cependant, sous le menu Documentation, vous trouverez des documents couvrant le paramétrage de Freenet et l’utilisation des outils Freenet les plus populaires, ainsi qu’un wiki axé sur les utilisateurs et une vaste foire aux questions. * [**Installer**](#install) Contient des instructions détaillées sur l’installation de Freenet grâce au nouveau programme d’installation. * [**Se connecter**](#connect) Comment se connecter à Freenet. * [**Contenu**](#content) Freenet en tant que système de distribution de contenu. * [**Comprendre**](#understand) Explique les rouages de Freenet et présente un glossaire des termes les plus usités. * [**Social**](#social) Comment paramétrer le courriel, les forums et le microblogage sur Freenet. * [**jSite**](#jsite) jSite est un outil d’insertion de sites Web Freenet (aussi appelé sitesFree). * [**Wiki**](https://wiki.freenetproject.org/) Le wiki Freenet est un espace axé sur les utilisateurs, où les nouvelles fonctions peuvent être décrites avant d’aboutir dans le site Web. C’est une bonne source d’informations sur toutes sortes de choses reliées à Freenet.

source: Install
fr: Installer

source: To install Freenet might not be as difficult as you might have heard. There are three ways to install Freenet: * Graphical install * Headless install * Enabling a mirror copy of a Freenet installation If you want to install the Freenet software on a computer which lacks a GUI, see the [Headless install](download.html#unix) instructions. If you have mirrored a working Freenet installation to a machine without explicitly installing it, see [Mirrored install](download.html#mirrored). Otherwise, continue reading.
fr: Installer Freenet est peut-être plus simple que vous ne le pensez. Il y a trois façons d’installer Freenet : * Installation graphique * Installation sans affichage * En activant une copie miroir d’une installation de Freenet Si vous désirez installer le logiciel Freenet sur un ordinateur dépourvu d’IUG, consultez les instructions d’[Installation sans affichage](download.html#unix). Si vous avez effectué la copie miroir d’une installation fonctionnelle de Freenet sur une machine sans vraiment l’installer, consultez [Installation miroir](download.html#mirrored). Autrement, poursuivez la lecture.

source: #### Graphical install **The information below does not apply to Windows systems**. For Windows you should use [the installer for Windows](assets/jnlp/FreenetInstaller.exe) as described on [the download page](download.html). You can also get the installer for Windows from [here](https://downloads.freenetproject.org/latest/FreenetInstaller.exe). For a graphical installation you have to have: * a working Java Runtime Environment * a downloaded copy of [new_installer_offline.jar](assets/jnlp/freenet_installer.jar) (if this does not work try [here](https://downloads.freenetproject.org/latest/new_installer_offline.jar)) * a working graphical user interface (GUI) You should save the new_installer.jar file somewhere where you can find it again. Your home-directory should be a good place. The next step requires you to know where you stored the file (the path to it), so it is quite important that you do that step thoroughly.
fr: #### L’installation graphique **L’information ci-dessous est périmée pour les systèmes Windows**. Pour Windows, vous devriez utiliser [le programme d’installation pour Windows](assets/jnlp/FreenetInstaller.exe) tel que décrit sur [la page de téléchargement](download.html). Vous pouvez aussi obtenir le programme d’installation pour Windows [ici](https://downloads.freenetproject.org/latest/FreenetInstaller.exe) . Pour une installation graphique, vous devriez avoir : * un moteur d’exécution Java fonctionnel * une nouvelle copie téléchargée de [new_installer_offline.jar](assets/jnlp/freenet_installer.jar) (si cela ne fonctionne pas, essayez [ce lien](https://downloads.freenetproject.org/latest/new_installer_offline.jar)) * une interface utilisateur graphique fonctionnelle (IUG) Vous devriez enregistrer le fichier new_installer.jar file dans un emplacement où vous pourrez le trouver de nouveau, par exemple, votre répertoire personnel. La prochaine étape exige que vous sachiez où vous avez stocké le fichier (son chemin), et il est donc important de bien accomplir cette étape.

source: To start the installation, open a command line interface/terminal/shell window. Exchange the **/path/to** to the real path (for example: /home/username/download/new_installer.jar) to the new_installer.jar-file and type: <pre> $ java -jar /path/to/new_installer_offline.jar</pre> The first window you should see is the one below, which allows you to select your preferred language for the installation program. ![](assets/img/install/1-langselect.png) Next is shown an about-box, some information about the version of Freenet and authors. Just click **Next** to proceed. ![](assets/img/install/2-about.png) The next step is to choose the directory in which to install Freenet. The default location on GNU/Linux & POSIX operating systems is **/home/username/Freenet** as shown below. Change it to something appropriate or leave "as is". Click **Next** when you are finished. ![](assets/img/install/4-Install_directory.png) Select the packages that you want to install with your Freenet software. Since it takes up virtually no extra disk-space, it is recommended that you leave all packages selected and press **Next**. ![](assets/img/install/5-select_packages.png) In the next stage, the packages are installed, and a progress meter runs across the window. When it is finished, press **Next** to continue to the next step. ![](assets/img/install/6-Install_packages.png) After that, the Freenet software is installed and/or upgraded, plugins are enabled and the environment is started. When completed, press **Next** to proceed. ![](assets/img/install/7-install_progress.png) For some graphical environments, shortcuts in the menu-structure can be created. This is not the case for all of the platforms that Freenet run on. However, there should be created shortcuts on the desktop in all supported environments. Change the application group according to your needs and press **Next** when finished. ![](assets/img/install/8-create_shortcuts.png) After that, the installation is finished. Click **Done** to close the window. ![](assets/img/install/9-Install_finished.png) If all has gone well, a browser window should have opened in the background. This will ask you a bunch of questions to configure Freenet, and then you should be able to use it.
fr: Pour lancer l’installation, ouvrez une interface en ligne de commande interface/terminal/shell window. Changez le chemin **/path/to** pour le chemin réel (par exemple : /home/nomd’utilisateur/Téléchargements/new_installer.jar) du fichier new_installer.jar-file et tapez : <pre> $ java -jar /path/to/new_installer_offline.jar</pre> La première fenêtre que vous devriez voir est celle qui se trouve ci-dessous, et qui vous permettra de choisir votre langue préférée pour le programme d’installation. ![](assets/img/install/1-langselect.png) Une boîte sera affichée ensuite, quelques informations sur la version de Freenet et sur les auteurs. Vous n’aurez qu’à cliquer sur **Suivant** pour continuer. ![](assets/img/install/2-about.png) La prochaine étape sera le choix du répertoire dans lequel Freenet sera installé. L’emplacement par défaut sur les systèmes d’exploitation GNU/Linux et POSIX est **/home/nomd’utilisateur/Freenet** tel que montré ci-dessous. Changez-le pour quelque chose de plus approprié ou laissez-le tel quel. Cliquez sur ** Suivant** une fois terminé. ![](assets/img/install/4-Install_directory.png) Choisissez les paquets que vous souhaitez installer avec votre logiciel Freenet. Dans la mesure où cela ne prend à peu près aucun espace disque supplémentaire, il vous est recommandé de laisser tous les paquets cochés et de cliquer sur **Suivant**. ![](assets/img/install/5-select_packages.png) À l’étape suivante, les paquets seront installés et une barre de progression avancera dans la fenêtre. Une fois terminé, cliquez sur **Suivant** pour passer à la prochaine étape. ![](assets/img/install/6-Install_packages.png) Ensuite, le logiciel Freenet sera installé et/ou mis à niveau, les greffons seront activés et l’environnement initialisé. Une fois terminé, cliquez sur **Suivant** pour continuer. ![](assets/img/install/7-install_progress.png) Avec certains environnements graphiques, des raccourcis peuvent être créés dans la structure du menu. Ce n’est pas le cas pour toutes les plateformes sur lesquelles Freenet tourne. Cependant, il devrait y avoir des raccourcis sur le bureau dans tous les environnements pris en charge. Modifiez le groupe d’applications selon vos besoins et cliquez sur **Suivant** une fois terminé. ![](assets/img/install/8-create_shortcuts.png) L’installation sera alors complète. Cliquez sur **Terminé** pour fermer la fenêtre. ![](assets/img/install/9-Install_finished.png) Si tout s’est bien passé, une fenêtre de navigateur s’ouvrira en arrière-plan. On vous y posera des questions pour configurer Freenet, et vous devriez ensuite pouvoir vous en servir.

source: It will ask about network security level - "protection from strangers attacking you over the internet". If you choose LOW or NORMAL, Freenet should "just work", connecting in a few minutes. If you choose HIGH or MAXIMUM, Freenet will need you to add friends before you can use it. These must be people you personally know. Adding people you don't know will not improve security.
fr: L’on vous questionnera sur le niveau de sécurité du réseau - « la protection contre les inconnus qui vous attaquent par Internet ». Si vous choisissez FAIBLE ou NORMAL, Freenet devrait « juste fonctionner », se connectant en quelques minutes. Si vous choisissez ÉLEVÉ ou MAXIMAL, Freenet aura besoin que vous ajoutiez des amis avant de pouvoir l’utiliser. Ce doit être des personnes que vous connaissez personnellement. L’ajout de personnes que vous ne connaissez pas n’améliorera pas la sécurité.

source: Connect
fr: Se connecter

source: There are two ways to connect to Freenet: * You can enable insecure mode (the installation wizard will ask you) and Freenet will automatically find nodes to connect to - Strangers. * You can connect to nodes run by people you know - Friends. Note that these should be people you actually know on some level, in order to maintain good network topology and maximum security. In practice, you should probably use both of these options, unless you are really paranoid, in which case you should of course only connect to people you trust. Insecure mode should work automatically once enabled, so the rest of this page is about connecting to Friends. To connect to your friends' nodes, you have to exchange Node references with them. The references must be added on **both sides** to be established. That is, you need to add his/hers, and he/she needs to add yours.
fr: Il y a deux façons de se connecter à Freenet : * Vous pouvez activer le mode non fiable (l’assistant d’installation vous le demandera) et Freenet trouvera automatiquement des nœuds auxquels se connecter - des inconnus. * Vous pouvez vous connecter à des nœuds exécutés par des personnes que vous connaissez - des amis. Prenez note que ce devrait être des personnes que vous connaissez effectivement d’une certaine manière afin de conserver une bonne topologie de réseau et une sécurité maximale. En pratique, vous devriez probablement utiliser ces deux options, à moins que vous ne soyez vraiment paranoïaque, auquel cas vous devriez bien sûr ne vous connecter qu’à des personnes de confiance ! Le mode non fiable devrait fonctionner automatiquement après son activation, et le reste de cette page couvre la connexion à des amis. Pour vous connecter aux nœuds de vos amis, vous devez échanger vos références de nœud. Ces références doivent être ajoutées **de part et d’autre** afin d’être établies. C’est-à-dire que vous devez ajouter les références de votre ami(e), et lui/elle les vôtres.

source: *When you have a freshly connected node, you have no data cached in your datastore, and very few connections even if insecure mode is enabled. Requests are sent out in a random fashion. **This makes some (or all) requests time out before retrieving anything.** It takes a couple of days for your Freenet node to get up to speed, so please don't get discouraged by this.* You should have at least three nodes that are connected to you at all times, ideally at least five to seven. Since some nodes may be unreachable at times, you need to connect to some more nodes to get the expected number. The nodes that are connected directly to you are the only nodes on Freenet that might see what kind of traffic passes through to your Freenet node. But if insecure mode is enabled, any node can find yours; this is the big advantage of **not** enabling insecure mode: you are effectively invisible except to your friends. In practice most people start off with insecure mode and gradually add friends, and hopefully turn off insecure mode once they have at least 10 friends.
fr: *Si un nœud est fraîchement connecté, aucune donnée n’est dans le cache de votre magasin de données, et vous n’avez que peu de connexions, même si le mode non fiable est activé. Les requêtes sont envoyées de manière aléatoire. **Certaines requêtes (ou toutes) dépassent leur temps avant de ressayer quoi que soit.** Il faut plusieurs jours avant que votre nœud Freenet n’atteigne sa vitesse de croisière, alors ne vous découragez pas.* Au moins trois nœuds devraient être connectés à vous en tout temps, idéalement au moins cinq ou sept. Dans la mesure où certains nœuds pourraient parfois ne pas être accessibles, vous devez vous connecter à d’autres nœuds afin d’atteindre le nombre souhaité. Les nœuds connectés directement à vous sont les seuls nœuds qui pourraient voir quelle sorte de trafic est dirigé vers votre nœud Freenet. Mais si le mode non fiable est activé, n’importe quel nœud peut trouver le vôtre ; c’est le gros avantage de ne **pas** activer le mode non fiable : vous êtes effectivement invisible, sauf pour vos amis. En pratique, la plupart des utilisateurs commencent en mode non fiable, ajoutent progressivement des amis, et désactiveront, espérons-le, le mode non fiable une fois qu’ils auront au moins 10 amis.

source: ![](assets/img/Freenet-architecture-small.png) *Figure 1: Visible Freenet connections* **Node A** in the figure also has a number of nodes connected to it, but they are all (except from your own node) invisible to you. The traffic routing algorithm is therefore only able to direct traffic to one of the few nodes that you know of that it thinks is most able to find what you are looking for. The traffic is encrypted, so it is quite difficult for the nodes that you connect to to see what your Freenet traffic consists of, but it is far from impossible. It is therefore important that you connect only to people you know. If that is not possible, then at least people you've talked to. There are a number of ways to add peer node references.
fr: ![](assets/img/Freenet-architecture-small.png) *Figure 1 : Connexions Freenet visibles* Dans la figure, un certain nombre de nœuds sont aussi connectés au **nœud A**, mais pour vous, ils sont tous invisibles (sauf à partir de votre propre nœud). Par conséquent, l’algorithme de routage du trafic ne peut que diriger le trafic vers l’un des quelques nœuds que vous connaissez qu’il juge le plus à même de trouver ce que vous cherchez. Le trafic est chiffré, et ainsi, les nœuds auxquels vous vous connectez ne peuvent que très difficilement connaître la teneur de votre trafic Freenet, mais cela est loin d’être impossible. Il est par conséquent important de vous connecter seulement à des personnes que vous connaissez. Si cela est impossible, alors au moins à des personnes à qui vous avez parlé. Il existe plusieurs façons d’ajouter les références de nœuds pairs.

source: ### Fproxy Connecting peer nodes with FProxy can be done in several ways. Common for all these are that they are all done under the **Darknet** menu item or using the [http://127.0.0.1:8888/friends/](http://127.0.0.1:8888/friends/) link. Below is the thing that makes it all happen: ![](assets/img/add_peers.png) As you can see, there are three ways of getting a node reference from someone else: * Pasting it "as is", in the top field, * a URL pointing at the reference, or * a file, containing the reference. [http://dark-code.bulix.org/](http://dark-code.bulix.org/) is a so called **paste-bin**, where you can add your node reference, make sure that the **private** box is checked, and press **Paste**. The paste-bin then returns an URL (e.g. http://dark-code.bulix.org/yuf01h-34676?raw), which can be shared with others. Make sure that you add **?raw** to the link. This makes the link point only to the actual pasted data, with no extra design elements. Your own Freenet reference can be found on the [ http://127.0.0.1:8888/friends/](http://127.0.0.1:8888/friends/) page, under the caption **My Node Reference**. It might look something like this (cut to fit on the screen):
fr: ### Fproxy Connecter des nœuds pairs avec FProxy peut être fait de plusieurs façons. Dans tous les cas, l’on utilisera l’élément de menu **Réseau invisible** ou le lien [http://127.0.0.1:8888/friends/](http://127.0.0.1:8888/friends/). Ci-dessous, ce qui rend cela possible : ![](assets/img/add_peers.png) Comme vous pouvez le voir, il y a trois manières d’obtenir une référence de nœud de quelqu’un d’autre : * La coller "telle quelle" dans le champ supérieur * une URL dirigée vers la référence * un fichier, contenant la référence [http://dark-code.bulix.org/](http://dark-code.bulix.org/) est un **paste-bin**, où vous pouvez ajouter votre référence de nœud. Assurez-vous que la boîte **private** est cochée, puis cliquez sur **Paste**. Le « paste-bin » retourne alors une URL (p. ex. http://dark-code.bulix.org/yuf01h-34676?raw), qui peut être partagée avec d’autres. Assurez-vous d’ajouter **?raw** au lien. Ainsi il ne pointera effectivement que vers les données collées, sans élément supplémentaire. Votre propre référence Freenet peut être trouvée sur la page http://127.0.0.1:8888/friends/](http://127.0.0.1:8888/friends/), sous **Ma référence de nœud**. Elle pourrait ressembler à ceci (rogné pour affichage) :

source: Remember that both you and the node you are connecting to must add references to make the connection work. This means that if you add a persons node reference on your side, but that person does not add your reference on his/her side, the connection **does not work**.
fr: Souvenez-vous que le nœud auquel vous vous connectez et vous-même devez ajouter mutuellement vos références afin que la connexion fonctionne. Cela signifie que si vous ajoutez de votre côté la référence de nœud d’une personne, mais que cette dernière n’ajoute pas votre référence de son côté, la connexion **ne fonctionnera pas**.

source: ### Darknet peers When you have a number of connections, you can visit the Darknet page. It should look something like this: ![](assets/img/Freenet-darknet_peers.png) There are a number of status messages that can be seen here: * CONNECTED - the node is connected and ready to take your request * BACKED OFF - the node is choked with traffic and unable to respond * DISCONNECTED - the node is not connected to your node, and probably turned off * NEVER CONNECTED - the connection between the nodes has not been established. This can be because of firewall problems/restrictions, one side not adding the other sides node reference or that the nodes have not been online at the same time yet in order to confirm the connection. If the problem persists over a long time and both sides have added each other, try to redo the connection. In the Idle column, you can see how much time has passed since the last status message.
fr: ### Les pairs du réseau invisible Si vous avez plusieurs connexions, vous pouvez visiter la page du réseau invisible. Voici à quoi elle devrait ressembler : ![](assets/img/Freenet-darknet_peers.png) Divers messages d’état peuvent y être affichés : * CONNECTÉ - le nœud est connecté et prêt à accepter votre requête * SURCHARGÉ - le trafic étouffe le nœud qui ne peut pas répondre * DÉCONNECTÉ - le nœud n’est pas connecté à votre nœud et est probablement éteint * JAMAIS CONNECTÉ - la connexion entre les nœuds n’a pas été établie. Cela peut provenir de problèmes/restrictions de pare-feu, un côté n’ajoutant pas la référence de nœud de l’autre, ou bien que les nœuds n’ont pas encore été en ligne en même temps afin de confirmer la connexion. Si le problème persiste sur une longue période et que chaque côté a ajouté l’autre, essayez de refaire la connexion. Dans la colonne Inactif, vous pouvez voir le délai depuis le dernier message d’état.

source: Content
fr: Contenu
