Repository: hyphanet/website
Catalog: locales/*/LC_MESSAGES/freenet_site.po
Languages: fr

source: <div style="float: right"><img src="assets/img/suma2015_badge_transparent_3.png" alt="SUMA Award 2014/15"/></div> At this year's [congress](http://searchstudies.org/de/suma2015.html) of [SUMA-EV](http://suma-ev.de/en/index.html), association for free access to knowledge, the [SUMA award](http://suma-awards.de/en/index.html) was awarded in the venerable Karl-H.-Ditze lecture hall of the Hamburg University of Applied Sciences. The topic of the award, was the surveillance scandal, revealed by whistleblower Edward Snowden: 'protection against total surveillance'. From submissions of about 50 projects for the SUMA award 2014/15 the panel of SUMA-EV selected the Freenet Project as the winner. The prize money of 2500 euro will be used like regular [donations](donate.html) to fund our one paid developer. > ![](assets/img/news/suma_award_2015_handover.jpg) > Wolfgang Sander-Beuermann with Arne Babenhauserheide, long-term Freenet contributor, as representative of the award winner. Photo: Michael Christen in Hamburg, Lizenz: CC0.
fr: <div style="float: right"><img src="assets/img/suma2015_badge_transparent_3.png" alt="Trophée SUMA 2014/15"/></div> Au [congrès](http://searchstudies.org/de/suma2015.html) de cette année de [SUMA-EV](http://suma-ev.de/en/index.html), association pour un accès libre à la connaissance, le [Trophée SUMA](http://suma-awards.de/en/index.html) a été remis dans la salle de conférence du vénérable Karl-H.-Ditze de la faculté des sciences appliquées de Hambourg. Le thème de ce trophée était le scandale de la surveillance, révélé par le lanceur d’alerte Edward Snowden : « la protection contre la surveillance totale ». Parmi les quelque 50 projets proposés pour le Trophée SUMA 2014/15, le comité de SUMA-EV a choisi le Projet Freenet comme gagnant. Le prix de 2 500 euros sera utilisé comme un [don](donate.html) ordinaire pour financer notre seul développeur rémunéré. > ![](assets/img/news/suma_award_2015_handover.jpg) > Wolfgang Sander-Beuermann avec Arne Babenhauserheide, contributeur de longue date, en tant que représentant du récipiendaire du trophée. Photo : Michael Christen à Hambourg, Lizenz : CC0.

source: 1st January 2015 - apt-get over Freenet
fr: 1er janvier 2015 - apt-get par Freenet

source: Developers of the privacy-focused Debian derivative Mempo report that it can download updates over Freenet! For details, see their page on [Apt over Freenet](http://deb.mempo.org/#install_apt_freenet). Key Points: * use Freenet to distribute online updates * most secure hosting option That means it is now possible to get reproducibly built kernels checked by anonymous (and therefore hard to pressure) contributors and update them over Freenet without disclosing that you use them. This applies to the packages provided by Mempo - other apt-get activity like installing GIMP is still public. It would be possible to host the entire Debian repository in Freenet, but this is not yet on the agenda for Mempo because this other activity does not disclose the potentially sensitive information that you want additional privacy. > The practical cool result now, is that Mempo repository can not be censored, DDoSed or taken offline, despite having just 1 tiny server (or no server at all) - rfreeman (one of the mempo developers)
fr: Les développeurs de Mempo, une version dérivée de Debian mettant l’accent sur la confidentialité, rapportent qu’elle peut télécharger des mises à jour par Freenet ! Pour plus de détails, consulter leur page sur [Apt par Freenet](http://deb.mempo.org/#install_apt_freenet). Éléments clés : * utiliser Freenet pour distribuer des mises à jour en ligne * l’option d’hébergement la plus sûre Cela signifie qu’il est maintenant possible d’obtenir des noyaux construits de façon reproductible vérifiés par des contributeurs anonymes (et par conséquent difficile à forcer), et les mettre à jour par Freenet sans révéler que vous les utilisez. Cela s’applique aux paquets fournis par Mempo. Une autre activité apt-get telle que l’installation de GIMP reste publique. Il serait possible d’héberger l’intégralité du dépôt Debian dans Freenet, mais ce n’est pas encore à l’ordre du jour pour Mempo, car cette autre activité ne révèle pas l’information potentiellement délicate que vous souhaitez une confidentialité accrue. > Maintenant, le résultat concret fort intéressant est que le dépôt Mempo ne peut ni être censuré, ni être la cible d’une attaque par déni de service, ni être mis hors ligne, malgré le fait qu’il n’a qu’un minuscule serveur (ou pas de serveur du tout) - rfreeman (un des développeurs de Mempo)

source: 2014-11-23 - Freenet 0.7.5 build 1467 released
fr: 2014-11-23 - Parution de Freenet 0.7.5 version 1467

source: This release fixes a bug introduced in build 1466 which can erase the list of plugins to load when Freenet starts if it crashes. If you are affected by this bug and can no longer connect, try adding the UPnP or JSTUN plugins again. This release also has updated Finnish, French, Dutch, and Brazilian Portuguese translations thanks to [volunteers on Transifex][url_transifex]. The Windows installer is updated: * It now disables the Java installer's sponsor offers. Thanks artart78! * It gained a Finnish translation. Thanks oselotti! Thank you for using Freenet! - Steve Dougherty
fr: Cette version corrige un bogue apparu dans la version 1466, bogue pouvant effacer la liste des greffons à charger au démarrage de Freenet s’il plante. Si vous êtes touché par ce bogue et que vous ne pouvez plus vous connecter, essayez d’ajouter à nouveau les greffons UPnP ou JSTUN. Cette version présente aussi des traductions mises à jour en finnois, en français, en néerlandais et en portugais brésilien grâce aux [bénévoles de Transifex][url_transifex]. Le programme d’installation pour Windows est mis à jour : * Il désactive maintenant les offres des commanditaires du programme d’installation de Java. Merci à artart78 ! * Ajout d’une traduction en finnois. Merci à oselotti ! Nous vous remercions d’utiliser Freenet ! - Steve Dougherty

source: 2014-11-09 - Freenet 0.7.5 build 1466 released
fr: 2014-11-09 - Parution de Freenet 0.7.5 version 1466

source: This release is planned to be the second-to-last version of Freenet to support Java 6\. The version after this one will refuse to upgrade unless running on Java 7 or later. Support for this behavior is part of a larger effort to allow separate official update channels - stable, testing, and unstable - as well as make it easier to publish unofficial update channels and further improve deployment security. Highlights for this build: * Add Hungarian Windows installer translation. Thanks drezzium!* Allow hiding the Java version End Of Life alert. (I'm sorry for the excessive annoyingness. Still - please upgrade Java!) * Upgrades to the next version (that is, when running this build's upgrade code) should no longer get [stuck in an upgrade loop][url_bug3208]. * Increase opennet peer limit to 142 peers. This now has [more math behind it][url_peermath] and will change when network parameters are adjusted. * Add more opennet seed nodes. Thanks saces and juiceman! * This build will be mandatory starting 2014-11-16, because old nodes will reject new nodes with more than 110 peers. Updates only take a few hours to spread, so this should only cause short term disruption. Additionally Matthew's (toad_'s) summer work on a custom on-disk format is done. This release lays the groundwork to include the results of that work [in the next release][url_toad]. This is designed for less disk activity and better behavior when corrupted. This release coincides with the 25th anniversary of the demolition of the Berlin wall (Mauerfall), which marked the beginning of the end of a large censorship and surveillance regime. May censorship be demolished everywhere! Thank you for using Freenet! - Steve Dougherty and Arne Babenhauserheide The link to http://127.0.0.1:8888 works for default Freenet nodes, but will not work for some setups. If you have a nonstandard setup, you should know the correct URL to use.
fr: Il est prévu que cette version soit l’avant-dernière version de Freenet à prendre en charge Java 6. La version qui suivra refusera de se mettre à niveau si vous n’utilisez pas Java 7 ou ultérieure. La prise en charge de ce comportement fait partie d’un plus vaste effort en vue de permettre des canaux de mise à jour officiels - stable, test, et instable - mais aussi de faciliter la publication de canaux de mise à jour non officiels et d’améliorer encore la sécurité des déploiements. Points saillants de cette version : * Ajout de la traduction en hongrois du programme d’installation pour Windows. Merci à drezzium ! * Permettre de cacher l’alerte de fin de vie de la version de Java. (Je suis désolé pour cette gêne excessive. Néanmoins, veuillez mettre Java à niveau !) * Les mises à niveau vers la prochaine version (à savoir, en exécutant le code de mise à niveau de cette version) ne devraient plus [rester bloquées dans une mise à niveau en boucle][url_bug3208]. * Augmentation de la limite de pairs du réseau ouvert à 142. Il y a maintenant [plus de calculs][url_peermath] et cela changera quand les paramètres réseau seront ajustés. * Ajout de nœuds de propagation supplémentaires dans le réseau ouvert. Merci à saces et juiceman ! * Cette version sera obligatoire à partir de 2014-11-16, car les anciens nœuds rejetteront les nouveaux nœuds qui auront plus de 110 pairs. Les mises à niveau se répandent en quelques heures seulement, et donc cela ne devrait causer qu’une courte perturbation. De plus, les travaux d’été de Matthew’s (toad_’s) sur un format sur disque personnalisé sont terminés. Cette version jette les bases afin d’inclure les résultats de ces travaux [dans la prochaine version][url_toad]. Ce format est conçu pour réduire l’activité sur disque et pour améliorer le comportement en cas de corruption. Cette version coïncide avec le 25e anniversaire de la démolition du mur de Berlin (Mauerfall), qui a marqué le début de la fin d’un vaste régime de censure et de surveillance. Que la censure soit démolie, partout ! Nous vous remercions d’utiliser Freenet ! - Steve Dougherty et Arne Babenhauserheide Le lien vers http://127.0.0.1:8888 fonctionne pour les nœuds Freenet par défaut, mais ne fonctionnera pas dans certains cas. Si votre système n’est pas standard, vous devriez savoir quelle URL correcte utiliser.

source: 2013-08-05 - Statement on the recent Freedom Hosting (Tor) bust
fr: 2013-08-05 - Déclaration sur l’intervention des forces de l’ordre contre « Freedom Hosting » (Tor)

source: According to [the press](http://arstechnica.com/tech-policy/2013/08/alleged-tor-hidden-service-operator-busted-for-child-porn-distribution/), half of the hidden sites on Tor are now down, apparently connected to the arrest of a man allegedly behind Freedom Hosting, a hosting service for Tor hidden services. Some of these sites were said to offer illegal content and were apparently run by the FBI for two weeks, using a Javascript-based browser exploit to try to find their users. This has had no effect on Freenet and could not happen on Freenet. Tor hidden services are centralised: A hidden service on Tor is run by a single server somewhere, and if this server is found, the whole site can be shut down, or compromised. In this case half the hidden sites on Tor were run on the same group of servers! See the [Tor blog](https://blog.torproject.org/blog/hidden-services-current-events-and-freedom-hosting) and [mailing list](https://lists.torproject.org/pipermail/tor-announce/2013-August/000089.html). On Freenet, anything you upload is distributed across the network across thousands of separate nodes all over the world, and will remain available for as long as it remains sufficiently popular: Freenet is a distributed data storage network designed to prevent censorship, provide anonymity and be hard to block. To see more information on the difference between Freenet and Tor, see [our explanation in the FAQ](https://freenetproject.org/faq.html#tor). Also, the Javascript exploit mentioned would not have worked on Freenet because Freenet removes Javascript by default. The Tor Browser Bundle has an option to block Javascript. We recommend that you enable this if you use Tor. Furthermore, there was no attack against Tor itself: As far as we know, no users of the major "darknets" (Freenet, Tor and I2P) has been traced by attacking the networks, by law enforcement or anyone else. In this case, it appears to have been user error, not a problem with Tor itself. Similarly on Freenet, users need to be careful, and Freenet will often tell you when you are about to do something risky. Having said that, Freenet's security is not perfect, and there are some known (but theoretical) weaknesses, so it might be possible for an attacker with relatively limited resources to trace individual Freenet contributors. Most of Freenet's weaknesses can be addressed by making long-lived connections with people that you trust, i.e. building a friend-to-friend "darknet". This functionality is already a part of the regular Freenet software, but we need more users who use Freenet in friend-to-friend mode to improve anonymity. We have planned further improvements, which should greatly improve security (censorship resistance, anonymity and resistance to blocking), speed and usability. The expanding online surveillance from both governments (e.g. PRISM) and private corporations clearly show that tools such as Freenet, TOR and I2P are essential for a healthy democracy. Please help us secure freedom of access to information by contributing to the Freenet-project with code, donations, translations, or just by running a node or creating content (anonymously)! Volunteers - especially developers - are always very welcome. Feel free to contact us, through [IRC online chat](help.html#irc), [the mailing lists](help.html#mailing-lists), or on Freenet itself in the "freenet" board on FMS. For press enquiries please contact [Ian Clarke](mailto:ian@freenetproject.org).
fr: D’après [la presse](http://arstechnica.com/tech-policy/2013/08/alleged-tor-hidden-service-operator-busted-for-child-porn-distribution/), la moitié des sites cachés de Tor sont maintenant hors service, apparemment en rapport à l’arrestation d’un homme soupçonné d’être derrière « Freedom Hosting », un service d’hébergement pour les services cachés de Tor. Certains de ces sites auraient offert du contenu illégal, et le FBI en a apparemment pris le contrôle pendant deux semaines, utilisant une vulnérabilité des navigateurs basés sur JavaScript pour tenter d’en trouver les utilisateurs. Cela n’a eu aucun effet sur Freenet et n’aurait pas pu arriver sur Freenet. Les services cachés de Tor sont centralisés : un service caché de Tor est exécuté par un seul serveur, quelque part, et si ce serveur est trouvé, le site entier peut être mis hors ligne, ou être compromis. Dans le cas présent, la moitié des sites cachés de Tor tournaient sur le même groupe de serveurs ! Consulter [le blogue](https://blog.torproject.org/blog/hidden-services-current-events-and-freedom-hosting) et [la liste de diffusion](https://lists.torproject.org/pipermail/tor-announce/2013-August/000089.html) de Tor. Sur Freenet, tout ce que vous téléversez est distribué à l’échelle réseau, sur des milliers de nœuds séparés dans le monde entier, et sera toujours accessible tant que ce contenu sera suffisamment populaire : Freenet est un réseau de stockage de données distribué conçu pour contrer la censure, préserver l’anonymat, et résister fortement au blocage. Pour accéder à plus d’informations sur les différences entre Freenet et Tor, consulter [notre explication dans la FAQ](https://freenetproject.org/faq.html#tor). La vulnérabilité JavaScript mentionnée n’aurait pas fonctionné avec Freenet, car Freenet supprime JavaScript par défaut. L’offre de navigation Tor propose une option pour bloquer JavaScript. Nous vous recommandons de l’activer si vous utilisez Tor. De plus, l’attaque n’était pas dirigée contre Tor même. Autant que nous sachions, aucun utilisateur des « réseaux invisibles » principaux (Freenet, Tor et I2P) n’a été suivi à la trace lors d’attaques des réseaux, par les forces de l’ordre ou par qui que ce soit d’autre. Dans ce cas, il semble qu’il y a eu erreur d’utilisateur, et non un problème impliquant Tor même. Sur Freenet aussi les utilisateurs doivent faire attention, et souvent Freenet vous informera quand vous êtes sur le point de faire quelque chose de risqué. Cela dit, la sécurité de Freenet n’est pas parfaite, et des faiblesses connues (mais théoriques) existent. Donc un attaquant aux ressources relativement limitées pourrait suivre à la trace des contributeurs individuels de Freenet. La plupart des faiblesses de Freenet peuvent être réglées en établissant des connexions à long terme avec des personnes de confiance, c.-à-d. en construisant un « réseau invisible » d’ami à ami. Cette fonctionnalité fait déjà partie du logiciel Freenet de base, mais il est primordial que plus d’utilisateurs utilisent Freenet en mode ami à ami afin d’améliorer l’anonymat. De grandes améliorations de la sécurité (résistance à la censure, anonymat et résistance aux blocages), de la vitesse et de la convivialité sont prévues. La surveillance en ligne grandissante des gouvernements (e.g. PRISM) et des entreprises privées montrent clairement que des outils tels que Freenet, Tor et I2P sont essentiels à la santé d’une démocratie. Aidez-nous à garantir un accès libre à l’information en contribuant au Projet Freenet. Vous pouvez proposer du code, des traductions, faire des dons, ou encore juste faire tourner un nœud, ou créer du contenu (anonymement) ! Les bénévoles, particulièrement les développeurs, sont toujours les bienvenus. N’hésitez pas à nous contacter sur notre [clavardage IRC en ligne](help.html#irc), [les listes de diffusion](help.html#mailing-lists), ou sur Freenet même « freenet »sur FMS. Les représentants des médias sont invités à communiquer avec [Ian Clarke](mailto:ian@freenetproject.org).

source: 2013-06-26 - Freenet gets a second paid developer to fix the Web of Trust!
fr: 2013-06-26 - Freenet obtient un second développeur rémunéré pour corriger la toile de confiance « Web of Trust »!

source: Long time coder xor (also known as p0s) has agreed to work, in a paid role, for us on fixing the Web of Trust plugin. This is a crucial component of many Freenet plugins: * **Sone**, an anonymous social network / microblogging tool. * **Freemail**, a private and untraceable email over Freenet system. * A filesharing system as yet unnamed which a student is working on. * Extensions to Infocalypse, being worked on by another student, a tool for managing source code which is vital to developing software over Freenet. See the Freenet Social Networking Guide for how to load the first 2 plugins. xor is well qualified for the role as he wrote most of the current code in the Web of Trust. The immediate priority will be to improve stability and performance by implementing a new more efficient FCP API. After that further optimisations are planned. Freenet relies on unpaid volunteer developers as well as a few key paid developers. Toad (Matthew Toseland) is returning to full time work for Freenet after a study break, although he is off to university in October, and xor is just starting working for Freenet. Improving the Web of Trust should substantially improve the performance of the key tools mentioned above and may be used by more in the future. Thanks to all our developers and donors!
fr: Le codeur de longue date xor (aussi connu sous le nom de p0s) a accepté de travailler pour nous, rémunéré, pour corriger le greffon de la toile de confiance « Web of Trust », un composant essentiel de nombreux greffons Freenet : * **Sone**, un outil anonyme de réseautage social / microblogage. * **Freemail**, un système de courriel sur Freenet protégeant votre vie privée et qui ne peut pas être suivi à la trace. * Un système de partage de fichiers qui n’a pas encore été nommé sur lequel un étudiant travaille. * Des extensions à Infocalypse, sur lesquelles un autre étudiant travaille. Infocalypse est un outil de gestion du code source qui est essentiel au développement de logiciels sur Freenet. Consulter le guide du réseautage social de Freenet pour savoir comment charger les deux premiers greffons. xor est bien qualifié pour ce rôle puisqu’il a écrit la plus grande partie du code de la toile de confiance « Web of Trust ». La priorité immédiate sera d’améliorer la stabilité et les performances en implémentant une API plus efficace du FCP. D’autres améliorations sont aussi prévues ensuite. Le Projet Freenet dépend de développeurs bénévoles ainsi que de quelques développeurs clés rémunérés. Toad (Matthew Toseland) revient travailler à temps plein après une pause de ses études, bien qu’il retourne à l’université en octobre, et xor commence juste à travailler pour Freenet. L’amélioration de la toile de confiance « Web of Trust » devrait considérablement améliorer les performances des outils clés mentionnés ci-dessus, et pourrait en augmenter l’utilisation par d’autres à l’avenir. Nous remercions tous nos développeurs et donateurs !

source: 2012-09-11 - Response to the University of Hawaii's "Experimental Study of Accountability in Existing Anonymous Networks"
fr: 2012-09-11 - Réponse à l’« Étude expérimentale de reddition dans les réseaux anonymes existants » (Experimental Study of Accountability in Existing Anonymous Networks) de l’université d’Hawaï
